// BlueprintGeneratedClass BP_GameModeTeams_TuningData.BP_GameModeTeams_TuningData_C
// Size: 0x350 (Inherited: 0x30)
struct UBP_GameModeTeams_TuningData_C : UPrimaryDataAsset {
	int32_t MaxTeams; // 0x30(0x04)
	float Duration:Intro1; // 0x34(0x04)
	float Duration:Main1; // 0x38(0x04)
	float Duration:Main2; // 0x3c(0x04)
	float Duration:Endgame1; // 0x40(0x04)
	float Duration:Endgame2; // 0x44(0x04)
	float Duration:WrapUp1; // 0x48(0x04)
	float Duration:WrapUp2; // 0x4c(0x04)
	int32_t SmallStockpile; // 0x50(0x04)
	int32_t MediumStockpile; // 0x54(0x04)
	int32_t LargeStockpile; // 0x58(0x04)
	int32_t ScourgeLockerStockpile; // 0x5c(0x04)
	int32_t EarlygameBossStockpile; // 0x60(0x04)
	int32_t MidgameBossStockpile; // 0x64(0x04)
	int32_t BossStockpile; // 0x68(0x04)
	int32_t IndividualStockpile; // 0x6c(0x04)
	int32_t StockpileTweaksPerRegion; // 0x70(0x04)
	int32_t StockpileTweakValue; // 0x74(0x04)
	int32_t DefaultHarvestLeash; // 0x78(0x04)
	struct FInt32Range GrowthPointRange; // 0x7c(0x10)
	struct FInt32Range SpaceJunkPointRange; // 0x8c(0x10)
	struct FInt32Range DefaultHarvestTimeBounds; // 0x9c(0x10)
	struct FInt32Range DefaultLockpickTimeBounds; // 0xac(0x10)
	struct FInt32Range DefaultVehicleRepairTimeBounds; // 0xbc(0x10)
	struct FInt32Range DefaultSupplyDropTimeBounds; // 0xcc(0x10)
	struct FInt32Range DefaultDropshipOpenerTimeBounds; // 0xdc(0x10)
	struct FInt32Range DefaultStrategicChestTimeBounds; // 0xec(0x10)
	struct FInt32Range DefaultShardAltarTimeBounds; // 0xfc(0x10)
	struct FInt32Range DefaultGrowthTimeBounds; // 0x10c(0x10)
	struct FInt32Range DefaultSpaceJunkTimeBounds; // 0x11c(0x10)
	struct FInt32Range DefaultScourgeLockerTimeBounds; // 0x12c(0x10)
	float HarvestTimePenaltyForKeeperDamaged; // 0x13c(0x04)
	int32_t PlayersPerDropship; // 0x140(0x04)
	int32_t MaxDropships; // 0x144(0x04)
	float MinimumStormCatTime; // 0x148(0x04)
	float Cat1LeadInTime; // 0x14c(0x04)
	float MaxWaitTilCat2; // 0x150(0x04)
	float MaxWaitTilCat3; // 0x154(0x04)
	float MaxWaitTilCat4; // 0x158(0x04)
	float MaxWaitTilCat5; // 0x15c(0x04)
	float Cat1NoCoverCold; // 0x160(0x04)
	float Cat1PartialShelterCold; // 0x164(0x04)
	float Cat1FullShelterCold; // 0x168(0x04)
	float Cat1AbilityShelterCold; // 0x16c(0x04)
	float Cat2NoCoverCold; // 0x170(0x04)
	float Cat2PartialShelterCold; // 0x174(0x04)
	float Cat2FullShelterCold; // 0x178(0x04)
	float Cat2AbilityShelterCold; // 0x17c(0x04)
	float Cat3AbilityShelterCold; // 0x180(0x04)
	float Cat3NoCoverCold; // 0x184(0x04)
	float Cat3PartialShelterCold; // 0x188(0x04)
	float Cat3FullShelterCold; // 0x18c(0x04)
	float Cat4AbilityShelterCold; // 0x190(0x04)
	float Cat4NoCoverCold; // 0x194(0x04)
	float Cat4PartialShelterCold; // 0x198(0x04)
	float Cat4FullShelterCold; // 0x19c(0x04)
	float Cat5NoCoverCold; // 0x1a0(0x04)
	float Cat5PartialShelterCold; // 0x1a4(0x04)
	float Cat5FullShelterCold; // 0x1a8(0x04)
	float Cat5AbilityShelterCold; // 0x1ac(0x04)
	float MaxCollapseSpeed; // 0x1b0(0x04)
	float MaxCollapseSpeedCat5; // 0x1b4(0x04)
	float SupplyDrop1Percentage; // 0x1b8(0x04)
	float SupplyDrop2Percentage; // 0x1bc(0x04)
	float SupplyDropDescentTime; // 0x1c0(0x04)
	int32_t SupplyDropPerPlayers; // 0x1c4(0x04)
	int32_t RandomSalvagePerMatch; // 0x1c8(0x04)
	float VehiclesPerPlayer; // 0x1cc(0x04)
	int32_t VehicleGantriesMin; // 0x1d0(0x04)
	int32_t VehicleGantriesMax; // 0x1d4(0x04)
	int32_t VehicleGantryCost; // 0x1d8(0x04)
	float EscapePodDescentTime; // 0x1dc(0x04)
	int32_t DataCreatedByPlayerDeath; // 0x1e0(0x04)
	int32_t MinimumForFatAlbert; // 0x1e4(0x04)
	int32_t NumberOfFatAlberts; // 0x1e8(0x04)
	bool NoRezOnTeamWipe; // 0x1ec(0x01)
	bool AutorezInEffect; // 0x1ed(0x01)
	char pad_1EE[0x2]; // 0x1ee(0x02)
	float AutorezTimeBase; // 0x1f0(0x04)
	float AutorezTimeIncrement; // 0x1f4(0x04)
	float AutorezTimeMax; // 0x1f8(0x04)
	float AutorezTimeMutatorMin; // 0x1fc(0x04)
	bool SalvageOnExecute; // 0x200(0x01)
	bool PlayersDropLoot; // 0x201(0x01)
	char pad_202[0x2]; // 0x202(0x02)
	int32_t DataSpillPerDeathCap; // 0x204(0x04)
	int32_t DataSpillPerTeamWipe; // 0x208(0x04)
	int32_t ScrapSpillPerDeath; // 0x20c(0x04)
	int32_t TargetSpillSizeSingle; // 0x210(0x04)
	int32_t TargetSpillSizeWipe; // 0x214(0x04)
	float KeeferGracePeriod; // 0x218(0x04)
	float KeeferHitCost:Chest; // 0x21c(0x04)
	float KeeferHitCost:Shard; // 0x220(0x04)
	float KeeferHitCost:Gantry; // 0x224(0x04)
	float KeeferHitCost:SupplyDrop; // 0x228(0x04)
	float KeeferHitCost:Dropship; // 0x22c(0x04)
	float KeeferHitCost:StrategicChest; // 0x230(0x04)
	float KeeferHitCost:Growth; // 0x234(0x04)
	float KeeferHitCost:SpaceJunk; // 0x238(0x04)
	float KeeferRecoveryPerFrame; // 0x23c(0x04)
	float BankingInterval1X; // 0x240(0x04)
	float BankingMultiplier; // 0x244(0x04)
	float EndgameMultiplier; // 0x248(0x04)
	float BankCooldown; // 0x24c(0x04)
	struct FInt32Range TorchReignitionTime; // 0x250(0x10)
	struct FInt32Range HearthReignitionTime; // 0x260(0x10)
	float DuosXPBonus; // 0x270(0x04)
	float SoloXPBonus; // 0x274(0x04)
	float Cat2Accel%ObjectivesAvailable; // 0x278(0x04)
	float Cat3Accel%ObjectivesAvailable; // 0x27c(0x04)
	float Cat4Accel%ObjectivesAvailable; // 0x280(0x04)
	float Cat5Accel%ObjectivesAvailable; // 0x284(0x04)
	float PctPlayerForCat2; // 0x288(0x04)
	float PctPlayerForCat3; // 0x28c(0x04)
	float PctPlayerForCat4; // 0x290(0x04)
	float PctPlayerForCat5; // 0x294(0x04)
	int32_t Cat1DynamicObjectiveCap; // 0x298(0x04)
	int32_t Cat2DynamicObjectiveCap; // 0x29c(0x04)
	int32_t Cat3DynamicObjectiveCap; // 0x2a0(0x04)
	int32_t Cat4DynamicObjectiveCap; // 0x2a4(0x04)
	int32_t Cat5DynamicObjectiveCap; // 0x2a8(0x04)
	int32_t PctPlayerMinPlayers; // 0x2ac(0x04)
	int32_t EarlygameScourgeLockers; // 0x2b0(0x04)
	int32_t EarlygameBossCount; // 0x2b4(0x04)
	int32_t MidgameBossCount; // 0x2b8(0x04)
	int32_t HighValueSupplyPods; // 0x2bc(0x04)
	int32_t EndgameBossCount; // 0x2c0(0x04)
	int32_t HighValueSpaceJunk; // 0x2c4(0x04)
	bool SingleTeamHurryup; // 0x2c8(0x01)
	char pad_2C9[0x3]; // 0x2c9(0x03)
	struct FInt32Range ScrapRarityThreshholds; // 0x2cc(0x10)
	int32_t SupplyDropVendingCost; // 0x2dc(0x04)
	int32_t RegionalChestUpgrades; // 0x2e0(0x04)
	float StartLocSafeRadius; // 0x2e4(0x04)
	int32_t StartLocExtras; // 0x2e8(0x04)
	int32_t HeadhunterSpillMin; // 0x2ec(0x04)
	int32_t SafariLow; // 0x2f0(0x04)
	int32_t SafariMid; // 0x2f4(0x04)
	int32_t SafariHigh; // 0x2f8(0x04)
	int32_t SafariMiniboss; // 0x2fc(0x04)
	int32_t SafariBossMultiplier; // 0x300(0x04)
	int32_t SafariStockpile; // 0x304(0x04)
	float SafariDataXPAdjustment; // 0x308(0x04)
	float AIPhaseUpgradeCadence; // 0x30c(0x04)
	float DataPickupDuration; // 0x310(0x04)
	float DropshipSafeRadius; // 0x314(0x04)
	float DropshipSafeRadiusActual; // 0x318(0x04)
	int32_t MaxUplinks; // 0x31c(0x04)
	float BankingInterval2X; // 0x320(0x04)
	float BankingInterval3X; // 0x324(0x04)
	int32_t PvPScrapTier1; // 0x328(0x04)
	int32_t PvPScrapTier2; // 0x32c(0x04)
	int32_t PvPScrapTier3; // 0x330(0x04)
	int32_t PvPScrapTier4; // 0x334(0x04)
	int32_t PvPWipeScrapMultiplier; // 0x338(0x04)
	int32_t CloneBackupAmount3man; // 0x33c(0x04)
	int32_t CloneBackupAmount2man; // 0x340(0x04)
	float CloneBackupIncrement; // 0x344(0x04)
	float RefreshHVOGrowthChance; // 0x348(0x04)
	int32_t NoobCutoff; // 0x34c(0x04)
};

