// BlueprintGeneratedClass BP_PlayerController.BP_PlayerController_C
// Size: 0x250b (Inherited: 0x1f68)
struct ABP_PlayerController_C : AS_PlayerController {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x1f68(0x08)
	struct US_CraftingComponent* ScavengerCrafting; // 0x1f70(0x08)
	struct US_ItemManagerComponent* ScavengerItemManager; // 0x1f78(0x08)
	struct US_EquipmentComponent* ScavengerEquipment; // 0x1f80(0x08)
	struct US_InventoryComponent* ScavengerInventory; // 0x1f88(0x08)
	struct UAudioComponent* A_GeigerSound; // 0x1f90(0x08)
	float GeigerTotalsThisTick; // 0x1f98(0x04)
	struct FName LastLocation; // 0x1f9c(0x08)
	struct FActiveGameplayEffectHandle StunHandle; // 0x1fa4(0x08)
	bool BaseWeaponInInventory; // 0x1fac(0x01)
	bool UpgradedWeaponInInventory; // 0x1fad(0x01)
	bool BaseWeaponInHands; // 0x1fae(0x01)
	bool UpgradedWeaponInHands; // 0x1faf(0x01)
	struct FTimerHandle RogueEventTimer; // 0x1fb0(0x08)
	struct FTimerHandle RogueDamageTimer; // 0x1fb8(0x08)
	float RogueTimer; // 0x1fc0(0x04)
	float RogueTimerMax; // 0x1fc4(0x04)
	struct FMulticastInlineDelegate OnToggleHUD_1; // 0x1fc8(0x10)
	struct FMulticastInlineDelegate OnShowMouseCursor; // 0x1fd8(0x10)
	struct FMulticastInlineDelegate OnResurrect; // 0x1fe8(0x10)
	struct US_ItemData* CraftedBaseWeaponData; // 0x1ff8(0x08)
	struct TArray<struct US_ItemData*> FullyLoadedItems; // 0x2000(0x10)
	struct FActiveGameplayEffectHandle GearUpgradeHandle; // 0x2010(0x08)
	struct US_ItemData* PocketItem; // 0x2018(0x08)
	int32_t PocketAmmoCount; // 0x2020(0x04)
	char pad_2024[0x4]; // 0x2024(0x04)
	struct AActor* ItemBeingInteractedWith; // 0x2028(0x08)
	struct AS_WeaponBase* CurrentPrimaryLargeWeapon; // 0x2030(0x08)
	struct AS_WeaponBase* CurrentSecondaryLargeWeapon; // 0x2038(0x08)
	struct AS_WeaponBase* CurrentWeaponThrowable; // 0x2040(0x08)
	int32_t DistanceToShardWarning; // 0x2048(0x04)
	int32_t DistanceToShard; // 0x204c(0x04)
	bool PauseMenuActive; // 0x2050(0x01)
	char pad_2051[0x3]; // 0x2051(0x03)
	int32_t SetGearTier; // 0x2054(0x04)
	struct UWBP_TeamStatusTray_C* TeamStatusTrays; // 0x2058(0x08)
	struct FTimerHandle ReportCardTimerHandle; // 0x2060(0x08)
	bool SavingReportCardAndReturningToMenu; // 0x2068(0x01)
	char pad_2069[0x7]; // 0x2069(0x07)
	struct TMap<struct US_RecipeData*, struct US_RecipeData*> CharacterToWpnRecipeUpgrade; // 0x2070(0x50)
	bool WpnRecipeUpgraded; // 0x20c0(0x01)
	char pad_20C1[0x7]; // 0x20c1(0x07)
	struct UDataTable* DTAmmoBox; // 0x20c8(0x08)
	struct FMulticastInlineDelegate OnTierUpgrade; // 0x20d0(0x10)
	struct FMulticastInlineDelegate OnEnterInventoryScreen; // 0x20e0(0x10)
	struct FMulticastInlineDelegate OnEnterCraftingScreen; // 0x20f0(0x10)
	struct FMulticastInlineDelegate OnEnterMapScreen; // 0x2100(0x10)
	struct US_ItemData* CurrentClassWeapon; // 0x2110(0x08)
	struct TArray<struct US_ItemData*> ItemDataOfAllClassWeapons; // 0x2118(0x10)
	bool RecentMusic; // 0x2128(0x01)
	char pad_2129[0x3]; // 0x2129(0x03)
	float RecentMusicPeriod; // 0x212c(0x04)
	enum class ES_MusicCue RecentMusicTrack; // 0x2130(0x01)
	char pad_2131[0x7]; // 0x2131(0x07)
	struct TMap<struct AS_PlayerCharacter*, float> RIFFStencilTimers; // 0x2138(0x50)
	struct TMap<struct AS_PlayerCharacter*, float> RIFFFadeTimers; // 0x2188(0x50)
	struct TArray<struct US_RecipeData*> FullyLoadedRecipeData; // 0x21d8(0x10)
	struct TMap<struct TSoftObjectPtr<struct US_RecipeData>, struct US_RecipeData*> WeaponUpgradeRecipeMap; // 0x21e8(0x50)
	struct TSoftObjectPtr<struct US_RecipeData> RecipeHandle_GearUpgrade01; // 0x2238(0x28)
	struct TSoftObjectPtr<struct US_RecipeData> RecipeHandle_GearUpgrade02; // 0x2260(0x28)
	struct TSoftObjectPtr<struct US_RecipeData> RecipeHandle_WildcardVehicleScout; // 0x2288(0x28)
	struct TArray<struct US_RecipeData*> Current Recipes; // 0x22b0(0x10)
	struct TMap<struct TSoftObjectPtr<struct US_PlayerClassData>, struct US_RecipeData*> CharacterToWeaponRecipe; // 0x22c0(0x50)
	struct TSoftObjectPtr<struct US_RecipeData> AR_Recipe_Handle; // 0x2310(0x28)
	float KeeperInteractionTimeRemaining; // 0x2338(0x04)
	float KeeperInteractionTimeMax; // 0x233c(0x04)
	struct FMulticastInlineDelegate OnDistanceToShardNonZero; // 0x2340(0x10)
	struct FMulticastInlineDelegate OnDistanceToShardZero; // 0x2350(0x10)
	float KeeperInteractionHealth; // 0x2360(0x04)
	enum class ES_KeeperInteractables KIType; // 0x2364(0x01)
	char pad_2365[0x3]; // 0x2365(0x03)
	struct TMap<struct US_ItemData*, int32_t> RezInventory; // 0x2368(0x50)
	struct TSoftObjectPtr<struct US_RecipeData> RecipeHandle_GearUpgrade03; // 0x23b8(0x28)
	struct TSoftObjectPtr<struct US_RecipeData> RecipeHandle_GearUpgrade04; // 0x23e0(0x28)
	float PvPUpgradeTimestamp; // 0x2408(0x04)
	int32_t PvPCurrentPowerRank; // 0x240c(0x04)
	struct FS_ItemState ItemState_PocketAmmo; // 0x2410(0x40)
	struct TArray<struct US_ItemData*> WeaponInventory; // 0x2450(0x10)
	struct TArray<struct US_ItemData*> WeaponInventoryOnRez; // 0x2460(0x10)
	bool KeeperOccupied; // 0x2470(0x01)
	bool BlippedCold; // 0x2471(0x01)
	bool BlippedHunger; // 0x2472(0x01)
	bool KnowsAboutCold; // 0x2473(0x01)
	bool KnowsAboutHunger; // 0x2474(0x01)
	bool HasWeapon; // 0x2475(0x01)
	bool Executed; // 0x2476(0x01)
	char pad_2477[0x1]; // 0x2477(0x01)
	int32_t SetShieldLevel; // 0x2478(0x04)
	bool Banking; // 0x247c(0x01)
	char pad_247D[0x3]; // 0x247d(0x03)
	struct FMulticastInlineDelegate OnBonusMode; // 0x2480(0x10)
	struct AActor* ActiveBankActor; // 0x2490(0x08)
	struct TSet<enum class ES_ItemType> AcquiredItemsThisFrame; // 0x2498(0x50)
	bool Streaming Called; // 0x24e8(0x01)
	bool ForceSuppressVO; // 0x24e9(0x01)
	char pad_24EA[0x6]; // 0x24ea(0x06)
	struct ABP_InGameHUD_C* TEMP_HardRefTo_BP_InGameHUD; // 0x24f0(0x08)
	struct ABP_PlayerState_C* TEMP_HardRefTo_BP_PlayerState; // 0x24f8(0x08)
	struct AActor* KeeperInteractable; // 0x2500(0x08)
	bool HasStoppedDownedAndBleedingMusic; // 0x2508(0x01)
	bool InBankingLoop; // 0x2509(0x01)
	bool bIsBlueprintTickEnabled; // 0x250a(0x01)

	void SetForceSuppressVO(bool Value, bool Unused); // Function BP_PlayerController.BP_PlayerController_C.SetForceSuppressVO // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xffff8008e4a10000
	void GetIsColdEnoughForHearthPing_BPI(bool yep); // Function BP_PlayerController.BP_PlayerController_C.GetIsColdEnoughForHearthPing_BPI // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xffff8008e4a10000
	void GetIsHungryEnoughForAutoping_BPI(bool yep); // Function BP_PlayerController.BP_PlayerController_C.GetIsHungryEnoughForAutoping_BPI // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xffff8008e4a10000
	void GetIsColdEnoughForAutoping_BPI(bool yep); // Function BP_PlayerController.BP_PlayerController_C.GetIsColdEnoughForAutoping_BPI // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xffff8008e4a10000
