// BlueprintGeneratedClass BP_PlayerCharacter.BP_PlayerCharacter_C
// Size: 0x33e4 (Inherited: 0x2d80)
struct ABP_PlayerCharacter_C : AS_PlayerCharacter {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2d80(0x08)
	struct UBP_PriorityAudioInstigatorComponent_C* PriorityAudioInstigatorComponent; // 0x2d88(0x08)
	struct UPostProcessComponent* DamageIndicatorPP; // 0x2d90(0x08)
	struct USkeletalMeshComponent* Backpack; // 0x2d98(0x08)
	struct USC_CollisionDamageReciver* SC_CollisionDamageReciver; // 0x2da0(0x08)
	struct US_SpringArmComponent* Camera Stick; // 0x2da8(0x08)
	struct UAudioComponent* StormAmbience; // 0x2db0(0x08)
	struct UAudioComponent* LocalAmbience; // 0x2db8(0x08)
	struct UCameraComponent* Camera; // 0x2dc0(0x08)
	struct US_BoneDataComponent* BoneDataComponent; // 0x2dc8(0x08)
	float Scanline_Scanline_ACBF929E4FF261F455E85784A665119C; // 0x2dd0(0x04)
	enum class ETimelineDirection Scanline__Direction_ACBF929E4FF261F455E85784A665119C; // 0x2dd4(0x01)
	char pad_2DD5[0x3]; // 0x2dd5(0x03)
	struct UTimelineComponent* Scanline; // 0x2dd8(0x08)
	float ScanStripes_ScanFX_7652BA42464DFB13D9C5C5BBF96F700D; // 0x2de0(0x04)
	enum class ETimelineDirection ScanStripes__Direction_7652BA42464DFB13D9C5C5BBF96F700D; // 0x2de4(0x01)
	char pad_2DE5[0x3]; // 0x2de5(0x03)
	struct UTimelineComponent* ScanStripes; // 0x2de8(0x08)
	float TL_RecentDamageFade_Opacity_537FF3C242B71D93FD0737A085A18F90; // 0x2df0(0x04)
	enum class ETimelineDirection TL_RecentDamageFade__Direction_537FF3C242B71D93FD0737A085A18F90; // 0x2df4(0x01)
	char pad_2DF5[0x3]; // 0x2df5(0x03)
	struct UTimelineComponent* TL_RecentDamageFade; // 0x2df8(0x08)
	float CurrentDamageIndicator; // 0x2e00(0x04)
	float DeltaTime; // 0x2e04(0x04)
	float DesiredDamageIndicator; // 0x2e08(0x04)
	float DamageIndicatorSpeed; // 0x2e0c(0x04)
	float LowHealthIndicatorPower; // 0x2e10(0x04)
	float DamageDirection; // 0x2e14(0x04)
	bool isDebugCam; // 0x2e18(0x01)
	bool IsUnderCeiling; // 0x2e19(0x01)
	char pad_2E1A[0x6]; // 0x2e1a(0x06)
	struct AActor* LastEnemy; // 0x2e20(0x08)
	float BlendWeight; // 0x2e28(0x04)
	char pad_2E2C[0x4]; // 0x2e2c(0x04)
	struct UCurveLinearColor* StormOverlayColorCurve; // 0x2e30(0x08)
	float IK Foot Scale; // 0x2e38(0x04)
	char pad_2E3C[0x4]; // 0x2e3c(0x04)
	struct FS_CameraArmSettings DebugCameraSettingsAnimations; // 0x2e40(0x170)
	struct UMaterialInstanceDynamic* RecentDamageMaterialInstance; // 0x2fb0(0x08)
	bool IsInDropshipSanctuary; // 0x2fb8(0x01)
	char CurrentStencilValue; // 0x2fb9(0x01)
	bool TeammateStencilInitialized; // 0x2fba(0x01)
	char pad_2FBB[0x5]; // 0x2fbb(0x05)
	struct TArray<struct AActor*> Companions; // 0x2fc0(0x10)
	bool LooksLikeSprinting; // 0x2fd0(0x01)
	char pad_2FD1[0x3]; // 0x2fd1(0x03)
	float ShaderOpacity; // 0x2fd4(0x04)
	int32_t TeammateInfoIndex; // 0x2fd8(0x04)
	char pad_2FDC[0x4]; // 0x2fdc(0x04)
	struct ACharacter* Revive Target; // 0x2fe0(0x08)
	char pad_2FE8[0x8]; // 0x2fe8(0x08)
	struct FTransform T_PrimaryStow_R; // 0x2ff0(0x30)
	struct FTransform T_PrimaryStow_L; // 0x3020(0x30)
	struct UMaterialInstanceDynamic* MI_StormOverlay; // 0x3050(0x08)
	bool IsInfected; // 0x3058(0x01)
	bool IsFreezing; // 0x3059(0x01)
	bool IsStarving; // 0x305a(0x01)
	char pad_305B[0x1]; // 0x305b(0x01)
	float Time; // 0x305c(0x04)
	float MovementSpeed; // 0x3060(0x04)
	char pad_3064[0xc]; // 0x3064(0x0c)
	struct FTransform T_Backpack_Center; // 0x3070(0x30)
	bool BeginPlayPostStreamingCalled; // 0x30a0(0x01)
	char pad_30A1[0x7]; // 0x30a1(0x07)
	struct FMulticastInlineDelegate OnGearUpgrade; // 0x30a8(0x10)
	struct FMulticastInlineDelegate OnTimeUntilStormUpgradeValid; // 0x30b8(0x10)
	struct USC_SkeletalMeshComponent* FakeKeeperMeshTwo; // 0x30c8(0x08)
	struct TArray<struct FString> MatFilters; // 0x30d0(0x10)
	struct TSoftObjectPtr<struct ABP_CameraEffects_C> CameraEffects; // 0x30e0(0x28)
	struct FName CharacterId; // 0x3108(0x08)
	float BoardingTime; // 0x3110(0x04)
	char pad_3114[0x4]; // 0x3114(0x04)
	struct UBP_PlayerCharacterGameVarsTemplate_C* GameVars; // 0x3118(0x08)
	bool TutorColdGracePeriod; // 0x3120(0x01)
	bool DiedOnPlanet; // 0x3121(0x01)
	char pad_3122[0x6]; // 0x3122(0x06)
	struct FS_StatusAlertSoundEffect HungerStatusAlert; // 0x3128(0x10)
	struct FS_StatusLoopSoundEffect ExhaustionStatusLoop; // 0x3138(0x18)
	struct FS_StatusLoopSoundEffect HealthStatusLoop; // 0x3150(0x18)
	struct FS_StatusAlertSoundEffect ColdStatusAlert; // 0x3168(0x10)
	struct FS_StatusLoopSoundEffect ColdStatusLoop_Female; // 0x3178(0x18)
	struct FS_StatusLoopSoundEffect ColdStatusLoop_Male; // 0x3190(0x18)
	struct FS_StatusAlertSoundEffect InfectionStatusAlert; // 0x31a8(0x10)
	struct FS_StatusLoopSoundEffect InfectionStatusLoop; // 0x31b8(0x18)
	struct AActor* TestingActor; // 0x31d0(0x08)
	float DirectionalParticleEffectNextAllowed; // 0x31d8(0x04)
	enum class ES_StatType StatType; // 0x31dc(0x01)
	char pad_31DD[0x3]; // 0x31dd(0x03)
	struct UMatineeCameraShake* LandingCameraShake; // 0x31e0(0x08)
	float LandingCameraShakeScale; // 0x31e8(0x04)
	float LandingCameraShakeVelocityDeltaMin; // 0x31ec(0x04)
	float LandingCameraShakeVelocityDeltaMax; // 0x31f0(0x04)
	int32_t BunnyJumpCountDebuffLimit; // 0x31f4(0x04)
	float BunnyJumpTimerDuration; // 0x31f8(0x04)
	float BunnyJumpVelocityMultiplier; // 0x31fc(0x04)
	struct UGameplayEffect* BunnyJumpDebuffGameplayEffect; // 0x3200(0x08)
	struct FTimerHandle BunnyJumpTimerHandle; // 0x3208(0x08)
	int32_t BunnyJumpCounter; // 0x3210(0x04)
	bool IsSliding; // 0x3214(0x01)
	bool JaeUIToggle; // 0x3215(0x01)
	char pad_3216[0xa]; // 0x3216(0x0a)
	struct FTransform ItemMasterTransform; // 0x3220(0x30)
	float HealthMPC; // 0x3250(0x04)
	bool isInStorm; // 0x3254(0x01)
	bool IsExecutionCamera_01; // 0x3255(0x01)
	char pad_3256[0x2]; // 0x3256(0x02)
	struct AActor* LastHitByAbilityActor; // 0x3258(0x08)
	bool IsInvolvedInExecution; // 0x3260(0x01)
	char pad_3261[0x3]; // 0x3261(0x03)
	struct FVector CurrentCharacterScale; // 0x3264(0x0c)
	bool OnExecution_HideWeapons; // 0x3270(0x01)
	char pad_3271[0x3]; // 0x3271(0x03)
	float DOT Fire Removed On Dodge; // 0x3274(0x04)
	enum class ES_Character_ID ExplorerClassID; // 0x3278(0x01)
	char pad_3279[0x7]; // 0x3279(0x07)
	struct UParticleSystemComponent* Breath Particles; // 0x3280(0x08)
	char pad_3288[0x8]; // 0x3288(0x08)
	struct FS_CameraSettingOverride Camera Overrides; // 0x3290(0xa0)
	struct FS_DialogueContextValue CharacterClassDialogueContext; // 0x3330(0x08)
	struct FTimerHandle Breath Handle; // 0x3338(0x08)
	struct FS_CameraSettingOverride Camera Overrides_JumpSlide; // 0x3340(0xa0)
	float FreezingThreshold; // 0x33e0(0x04)

	bool GetPingDialogueContext(struct AS_PlayerController* pingingPlayerController, struct FS_DialogueContext OutContext); // Function BP_PlayerCharacter.BP_PlayerCharacter_C.GetPingDialogueContext // (Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0xffff8008e4a10000
	void BeginPlayPostStreamingCalledWithNotification(bool StreamingCalled, bool StreamingCalledOut); // Function BP_PlayerCharacter.BP_PlayerCharacter_C.BeginPlayPostStreamingCalledWithNotification // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0xffff8008e4a10000
	void BankingFX(); // Function BP_PlayerCharacter.BP_PlayerCharacter_C.BankingFX // (Public|BlueprintCallable|BlueprintEvent) // @ game+0xffff8008e4a10000
