// BlueprintGeneratedClass BP_SessionEconomy.BP_SessionEconomy_C
// Size: 0x138 (Inherited: 0x30)
struct UBP_SessionEconomy_C : UPrimaryDataAsset {
	struct UDataTable* CommonItems; // 0x30(0x08)
	struct UDataTable* CorpseWeapons; // 0x38(0x08)
	struct UDataTable* CommonWeapons; // 0x40(0x08)
	struct UDataTable* RareWeapons; // 0x48(0x08)
	struct UDataTable* EpicWeapons; // 0x50(0x08)
	struct UDataTable* Meat; // 0x58(0x08)
	struct UDataTable* Berries; // 0x60(0x08)
	struct UDataTable* Ammo; // 0x68(0x08)
	struct TArray<struct UDataTable*> SupplyDrops; // 0x70(0x10)
	int32_t StrategicChestWeight_Blank; // 0x80(0x04)
	int32_t StrategicChestWeight_Scrap; // 0x84(0x04)
	int32_t StrategicChestWeight_Food; // 0x88(0x04)
	int32_t StrategicChestWeight_Healing; // 0x8c(0x04)
	int32_t StrategicChestWeight_Ammo; // 0x90(0x04)
	int32_t StrategicChestWeight_Salvage; // 0x94(0x04)
	struct UDataTable* ScourgeLocker; // 0x98(0x08)
	struct UDataTable* StrategicScrap; // 0xa0(0x08)
	struct UDataTable* StrategicFood; // 0xa8(0x08)
	struct UDataTable* StrategicHealing; // 0xb0(0x08)
	struct UDataTable* StrategicAmmo; // 0xb8(0x08)
	struct UDataTable* StrategicSalvage; // 0xc0(0x08)
	struct UDataTable* SpaceJunkScrap; // 0xc8(0x08)
	struct UDataTable* SpaceJunkScrapTutorial; // 0xd0(0x08)
	int32_t SpaceJunkScrapBundle; // 0xd8(0x04)
	char pad_DC[0x4]; // 0xdc(0x04)
	struct UDataTable* LootedSalvage; // 0xe0(0x08)
	float SpaceJunkSalvageChance; // 0xe8(0x04)
	char pad_EC[0x4]; // 0xec(0x04)
	struct UDataTable* SpaceJunkSalvage; // 0xf0(0x08)
	float ScourgeBossSalvageChance; // 0xf8(0x04)
	char pad_FC[0x4]; // 0xfc(0x04)
	struct UDataTable* ScourgeBossSalvage; // 0x100(0x08)
	float SupplyPodSalvageChance; // 0x108(0x04)
	char pad_10C[0x4]; // 0x10c(0x04)
	struct UDataTable* SupplyPodSalvage; // 0x110(0x08)
	struct UDataTable* Arsenal_LootTable; // 0x118(0x08)
	struct UDataTable* GunFu_LootTable; // 0x120(0x08)
	struct UDataTable* SpecialEvent_LootTable; // 0x128(0x08)
	struct UDataTable* NoobBlessing_LootTable; // 0x130(0x08)
};

