// BlueprintGeneratedClass BP_ScourgeSacData.BP_ScourgeSacData_C
// Size: 0x5c (Inherited: 0x30)
struct UBP_ScourgeSacData_C : UPrimaryDataAsset {
	float SwellTime; // 0x30(0x04)
	float EmissiveSpeedStart; // 0x34(0x04)
	float EmissiveSpeedEnd; // 0x38(0x04)
	float EmissiveDamageStart; // 0x3c(0x04)
	float EmissiveDamageEnd; // 0x40(0x04)
	float ExplodeMeshStart; // 0x44(0x04)
	float ExplodeMeshEnd; // 0x48(0x04)
	float DissolveStart; // 0x4c(0x04)
	float DissolveEnd; // 0x50(0x04)
	float SwellUpdatesPerSecond; // 0x54(0x04)
	float Life; // 0x58(0x04)
};

