// Class Scavenger.BPFL_HUD
// Size: 0x28 (Inherited: 0x28)
struct UBPFL_HUD : UBlueprintFunctionLibrary {

	bool BetterProjectWorldToScreen(struct APlayerController* Player, struct FVector WorldPosition, struct FVector2D ScreenPosition, bool bTargetBehindCamera, bool bPlayerViewportRelative); // Function Scavenger.BPFL_HUD.BetterProjectWorldToScreen // (Final|Native|Static|Private|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0xffff8008e4a10000
};

// Class Scavenger.CaptureMask
// Size: 0x2b0 (Inherited: 0x288)
struct ACaptureMask : AActor {
	struct TArray<struct FName> RenderTags; // 0x288(0x10)
	struct FString RenderDirectory; // 0x298(0x10)
	struct UTextureRenderTarget2D* RenderTarget; // 0x2a8(0x08)

	void CaptureRenderMasks(); // Function Scavenger.CaptureMask.CaptureRenderMasks // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_AbilityDebugHUD
// Size: 0x438 (Inherited: 0x378)
struct AS_AbilityDebugHUD : AHUD {
	char pad_378[0xc0]; // 0x378(0xc0)
};

// Class Scavenger.S_AbilitySystemBlueprintLibrary
// Size: 0x28 (Inherited: 0x28)
struct US_AbilitySystemBlueprintLibrary : UBlueprintFunctionLibrary {

	float GetMaxArmorLevelFromActor(struct AActor* Actor); // Function Scavenger.S_AbilitySystemBlueprintLibrary.GetMaxArmorLevelFromActor // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0xffff8008e4a10000
	float GetDamageResistanceFromActor(struct AActor* Actor); // Function Scavenger.S_AbilitySystemBlueprintLibrary.GetDamageResistanceFromActor // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0xffff8008e4a10000
	float GetDamageMultiplierFromActor(struct AActor* Actor, struct AS_WeaponTriggerableAttachment* weaponAttachment); // Function Scavenger.S_AbilitySystemBlueprintLibrary.GetDamageMultiplierFromActor // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0xffff8008e4a10000
	struct US_AttributeSetBase* GetAttributeSet(struct UAbilitySystemComponent* AbilitySystemComponent); // Function Scavenger.S_AbilitySystemBlueprintLibrary.GetAttributeSet // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0xffff8008e4a10000
	float GetArmorLevelFromActorWithNewStat(struct AActor* Actor, float newArmorStat); // Function Scavenger.S_AbilitySystemBlueprintLibrary.GetArmorLevelFromActorWithNewStat // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0xffff8008e4a10000
	float GetArmorLevelFromActor(struct AActor* Actor); // Function Scavenger.S_AbilitySystemBlueprintLibrary.GetArmorLevelFromActor // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0xffff8008e4a10000
	float GetArmorDamageResistanceFromActor(struct AActor* Actor); // Function Scavenger.S_AbilitySystemBlueprintLibrary.GetArmorDamageResistanceFromActor // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_AbilitySystemComponent
// Size: 0x1418 (Inherited: 0x1348)
struct US_AbilitySystemComponent : UAbilitySystemComponent {
	char pad_1348[0x70]; // 0x1348(0x70)
	struct FMulticastInlineDelegate OnAbilityCooldownExpired; // 0x13b8(0x10)
	struct FMulticastInlineDelegate OnAbilityDurationExpired; // 0x13c8(0x10)
	struct FMulticastInlineDelegate OnAbilityActivated; // 0x13d8(0x10)
	struct TArray<struct FS_AbilityHandleNamePair> m_namedAbilities; // 0x13e8(0x10)
	struct TArray<struct FS_AbilityTimer> m_abilityTimers; // 0x13f8(0x10)
	char pad_1408[0x8]; // 0x1408(0x08)
	struct UGameplayEffect* AbilityCooldownEffect; // 0x1410(0x08)

	bool TryActivateAbilityByName(struct FName AbilityName, bool bAllowRemoteActivation); // Function Scavenger.S_AbilitySystemComponent.TryActivateAbilityByName // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool IsAbilityActiveByName(struct FName AbilityName); // Function Scavenger.S_AbilitySystemComponent.IsAbilityActiveByName // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	float GetMaxAbilityTimerTime(enum class ES_AbilityTimerIndex TimerIndex); // Function Scavenger.S_AbilitySystemComponent.GetMaxAbilityTimerTime // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool DoesAbilityTimerAllowActivation(enum class ES_AbilityTimerIndex TimerIndex); // Function Scavenger.S_AbilitySystemComponent.DoesAbilityTimerAllowActivation // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0xffff8008e4a10000
	void CrossServer_ApplyGameplayEffectSpecToSelfRemote(struct FGameplayEffectSpecForCrossServer GameplayEffect, struct FPredictionKey PredictionKey); // Function Scavenger.S_AbilitySystemComponent.CrossServer_ApplyGameplayEffectSpecToSelfRemote // (Net|NetReliableNative|Event|Public) // @ game+0xffff8008e4a10000
	bool CanActivateAbilityByName(struct FName AbilityName); // Function Scavenger.S_AbilitySystemComponent.CanActivateAbilityByName // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void BP_ApplyGameplayEffectToSelfRemote(struct UGameplayEffect* GameplayEffectClass, float Level, struct FGameplayEffectContextHandle EffectContext); // Function Scavenger.S_AbilitySystemComponent.BP_ApplyGameplayEffectToSelfRemote // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void AbilityTimerSetActive(enum class ES_AbilityTimerIndex TimerIndex); // Function Scavenger.S_AbilitySystemComponent.AbilityTimerSetActive // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void AbilityTimerGetState(enum class ES_AbilityTimerIndex TimerIndex, enum class ES_AbilityTimerState TimerState, float RemainingTime); // Function Scavenger.S_AbilitySystemComponent.AbilityTimerGetState // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0xffff8008e4a10000
	void AbilityTimerClear(enum class ES_AbilityTimerIndex TimerIndex); // Function Scavenger.S_AbilitySystemComponent.AbilityTimerClear // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool AbilityDurationStart(enum class ES_AbilityTimerIndex TimerIndex, float Duration); // Function Scavenger.S_AbilitySystemComponent.AbilityDurationStart // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool AbilityDurationForceEnd(enum class ES_AbilityTimerIndex TimerIndex); // Function Scavenger.S_AbilitySystemComponent.AbilityDurationForceEnd // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool AbilityDurationAddTime(enum class ES_AbilityTimerIndex TimerIndex, float Duration); // Function Scavenger.S_AbilitySystemComponent.AbilityDurationAddTime // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool AbilityCooldownStart(enum class ES_AbilityTimerIndex TimerIndex, float Duration); // Function Scavenger.S_AbilitySystemComponent.AbilityCooldownStart // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool AbilityCooldownForceEnd(enum class ES_AbilityTimerIndex TimerIndex); // Function Scavenger.S_AbilitySystemComponent.AbilityCooldownForceEnd // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool AbilityCooldownAddTime(enum class ES_AbilityTimerIndex TimerIndex, float Duration); // Function Scavenger.S_AbilitySystemComponent.AbilityCooldownAddTime // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_AbilityTask_AssassinationPositioningTask
// Size: 0x80 (Inherited: 0x80)
struct US_AbilityTask_AssassinationPositioningTask : UAbilityTask {
};

// Class Scavenger.S_AbilityTask_AssassinationSyncMontage
// Size: 0x90 (Inherited: 0x80)
struct US_AbilityTask_AssassinationSyncMontage : UAbilityTask {
	struct UAnimMontage* AttackerMontage; // 0x80(0x08)
	struct UAnimMontage* VictimMontage; // 0x88(0x08)
};

// Class Scavenger.S_AbilityTask_KeeperTaskBase
// Size: 0xa8 (Inherited: 0x80)
struct US_AbilityTask_KeeperTaskBase : UAbilityTask {
	struct AS_PlayerCharacter* OwningPlayer; // 0x80(0x08)
	struct AS_Keeper* OwningKeeper; // 0x88(0x08)
	char pad_90[0x8]; // 0x90(0x08)
	struct FString InstanceNameAsString; // 0x98(0x10)
};

// Class Scavenger.S_AbilityTask_FaceKeeperAtLocation
// Size: 0xd0 (Inherited: 0xa8)
struct US_AbilityTask_FaceKeeperAtLocation : US_AbilityTask_KeeperTaskBase {
	struct FMulticastInlineDelegate OnFaced; // 0xa8(0x10)
	struct FVector TargetLocation; // 0xb8(0x0c)
	float InterpolationSpeed; // 0xc4(0x04)
	bool ShouldEndTaskOnFaced; // 0xc8(0x01)
	char pad_C9[0x7]; // 0xc9(0x07)

	struct US_AbilityTask_FaceKeeperAtLocation* KeeperFaceLocation(struct UGameplayAbility* OwningAbility, struct FName TaskInstanceName, struct AS_PlayerCharacter* Player, struct FVector locationToFace, float facingInterpolationSpeed, bool endTaskWhenFaced); // Function Scavenger.S_AbilityTask_FaceKeeperAtLocation.KeeperFaceLocation // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_AbilityTask_FaceKeeperAtActor
// Size: 0xe8 (Inherited: 0xd0)
struct US_AbilityTask_FaceKeeperAtActor : US_AbilityTask_FaceKeeperAtLocation {
	struct AActor* TargetActor; // 0xd0(0x08)
	struct FVector OffsetFromActor; // 0xd8(0x0c)
	char pad_E4[0x4]; // 0xe4(0x04)

	struct US_AbilityTask_FaceKeeperAtActor* KeeperFaceActor(struct UGameplayAbility* OwningAbility, struct FName TaskInstanceName, struct AS_PlayerCharacter* Player, struct AActor* actorToFace, struct FVector optionalOffsetFromActor, float facingInterpolationSpeed, bool endTaskWhenFaced); // Function Scavenger.S_AbilityTask_FaceKeeperAtActor.KeeperFaceActor // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_AbilityTask_HoldKeeperLocationAndRotation
// Size: 0xc0 (Inherited: 0xa8)
struct US_AbilityTask_HoldKeeperLocationAndRotation : US_AbilityTask_KeeperTaskBase {
	struct FVector keeperLocation; // 0xa8(0x0c)
	struct FVector keeperFaceTowardsLocation; // 0xb4(0x0c)

	struct US_AbilityTask_HoldKeeperLocationAndRotation* HoldKeeperLocationAndRotation(struct UGameplayAbility* OwningAbility, struct FName TaskInstanceName, struct AS_PlayerCharacter* Player, struct FVector keeperLocation, struct FVector keeperFaceTowardsLocation); // Function Scavenger.S_AbilityTask_HoldKeeperLocationAndRotation.HoldKeeperLocationAndRotation // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_AbilityTask_MoveKeeperToLocation
// Size: 0xe0 (Inherited: 0xa8)
struct US_AbilityTask_MoveKeeperToLocation : US_AbilityTask_KeeperTaskBase {
	struct FMulticastInlineDelegate OnLocationReached; // 0xa8(0x10)
	struct FVector StartLocation; // 0xb8(0x0c)
	struct FVector TargetLocation; // 0xc4(0x0c)
	float expectedDuration; // 0xd0(0x04)
	char pad_D4[0xc]; // 0xd4(0x0c)

	struct US_AbilityTask_MoveKeeperToLocation* KeeperMoveToLocation(struct UGameplayAbility* OwningAbility, struct FName TaskInstanceName, struct AS_PlayerCharacter* Player, struct FVector TargetLocation, float expectedDuration); // Function Scavenger.S_AbilityTask_MoveKeeperToLocation.KeeperMoveToLocation // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_AbilityTask_PlayMontageAndWait
// Size: 0xe0 (Inherited: 0x80)
struct US_AbilityTask_PlayMontageAndWait : UAbilityTask {
	struct FMulticastInlineDelegate OnCompleted; // 0x80(0x10)
	struct FMulticastInlineDelegate OnBlendOut; // 0x90(0x10)
	struct FMulticastInlineDelegate OnInterrupted; // 0xa0(0x10)
	struct FMulticastInlineDelegate OnCancelled; // 0xb0(0x10)
	struct UAnimMontage* Montage; // 0xc0(0x08)
	char pad_C8[0x18]; // 0xc8(0x18)

	void OnMontageEnded(struct UAnimMontage* Montage, bool bInterrupted, int32_t montageInstanceID); // Function Scavenger.S_AbilityTask_PlayMontageAndWait.OnMontageEnded // (Final|Native|Private) // @ game+0xffff8008e4a10000
	void OnMontageBlendingOut(struct UAnimMontage* Montage, bool bInterrupted, int32_t montageInstanceID); // Function Scavenger.S_AbilityTask_PlayMontageAndWait.OnMontageBlendingOut // (Final|Native|Private) // @ game+0xffff8008e4a10000
	struct US_AbilityTask_PlayMontageAndWait* CreatePlayMontageAndWaitTask(struct UGameplayAbility* OwningAbility, struct FName TaskInstanceName, struct UAnimMontage* Montage, float Rate, struct FName StartSection, bool bStopWhenAbilityEnds, float AnimRootMotionTranslationScale); // Function Scavenger.S_AbilityTask_PlayMontageAndWait.CreatePlayMontageAndWaitTask // (Final|Native|Static|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_AbilityTask_PlayMontageOnKeeper
// Size: 0x100 (Inherited: 0xa8)
struct US_AbilityTask_PlayMontageOnKeeper : US_AbilityTask_KeeperTaskBase {
	struct FMulticastInlineDelegate OnCompleted; // 0xa8(0x10)
	struct FMulticastInlineDelegate OnBlendOut; // 0xb8(0x10)
	struct FMulticastInlineDelegate OnInterrupted; // 0xc8(0x10)
	struct FMulticastInlineDelegate OnCancelled; // 0xd8(0x10)
	struct UAnimMontage* Montage; // 0xe8(0x08)
	struct FName StartSection; // 0xf0(0x08)
	float Rate; // 0xf8(0x04)
	float AnimRootMotionTranslationScale; // 0xfc(0x04)

	struct US_AbilityTask_PlayMontageOnKeeper* PlayMontageOnKeeper(struct UGameplayAbility* OwningAbility, struct FName TaskInstanceName, struct AS_PlayerCharacter* Player, struct UAnimMontage* MontageToPlay, float Rate, struct FName StartSection, float AnimRootMotionTranslationScale); // Function Scavenger.S_AbilityTask_PlayMontageOnKeeper.PlayMontageOnKeeper // (Final|Native|Static|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void OnMontageInterrupted(); // Function Scavenger.S_AbilityTask_PlayMontageOnKeeper.OnMontageInterrupted // (Final|Native|Private) // @ game+0xffff8008e4a10000
	void OnMontageEnded(struct UAnimMontage* Montage, bool bInterrupted, int32_t montageInstanceID); // Function Scavenger.S_AbilityTask_PlayMontageOnKeeper.OnMontageEnded // (Final|Native|Private) // @ game+0xffff8008e4a10000
	void OnMontageCancelled(); // Function Scavenger.S_AbilityTask_PlayMontageOnKeeper.OnMontageCancelled // (Final|Native|Private) // @ game+0xffff8008e4a10000
	void OnMontageBlendingOut(struct UAnimMontage* Montage, bool bInterrupted, int32_t montageInstanceID); // Function Scavenger.S_AbilityTask_PlayMontageOnKeeper.OnMontageBlendingOut // (Final|Native|Private) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_AbilityTask_ReturnKeeperToDefaultFacing
// Size: 0xc0 (Inherited: 0xa8)
struct US_AbilityTask_ReturnKeeperToDefaultFacing : US_AbilityTask_KeeperTaskBase {
	struct FMulticastInlineDelegate OnFaced; // 0xa8(0x10)
	float InterpolationSpeed; // 0xb8(0x04)
	char pad_BC[0x4]; // 0xbc(0x04)

	struct US_AbilityTask_ReturnKeeperToDefaultFacing* KeeperReturnToDefaultFacing(struct UGameplayAbility* OwningAbility, struct FName TaskInstanceName, struct AS_PlayerCharacter* Player, float facingInterpolationSpeed); // Function Scavenger.S_AbilityTask_ReturnKeeperToDefaultFacing.KeeperReturnToDefaultFacing // (Final|Native|Static|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_AbilityTask_WaitToLand
// Size: 0x90 (Inherited: 0x80)
struct US_AbilityTask_WaitToLand : UAbilityTask {
	struct FMulticastInlineDelegate OnLanded; // 0x80(0x10)

	struct US_AbilityTask_WaitToLand* CreateWaitToLandTask(struct UGameplayAbility* OwningAbility, struct FName TaskInstanceName); // Function Scavenger.S_AbilityTask_WaitToLand.CreateWaitToLandTask // (Final|Native|Static|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_AccountCheatsUtility
// Size: 0x28 (Inherited: 0x28)
struct US_AccountCheatsUtility : UBlueprintFunctionLibrary {

	void CheatResetAccountState(struct UWorld* World, struct APlayerController* PlayerController); // Function Scavenger.S_AccountCheatsUtility.CheatResetAccountState // (Final|Native|Static|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void CheatGrantOnlineCurrency(struct UWorld* World, struct APlayerController* PlayerController, int32_t Count); // Function Scavenger.S_AccountCheatsUtility.CheatGrantOnlineCurrency // (Final|Native|Static|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void CheatGrantOneClassLevel(struct UWorld* World, struct APlayerController* PlayerController, struct FName ClassId); // Function Scavenger.S_AccountCheatsUtility.CheatGrantOneClassLevel // (Final|Native|Static|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void CheatGrantMaxClassLevel(struct UWorld* World, struct APlayerController* PlayerController, struct FName ClassId); // Function Scavenger.S_AccountCheatsUtility.CheatGrantMaxClassLevel // (Final|Native|Static|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void CheatGrantCharacter(struct UWorld* World, struct APlayerController* PlayerController, struct FName ClassId); // Function Scavenger.S_AccountCheatsUtility.CheatGrantCharacter // (Final|Native|Static|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void CheatGrantAllSalvageItems(struct UWorld* World, struct APlayerController* PlayerController, int32_t Count); // Function Scavenger.S_AccountCheatsUtility.CheatGrantAllSalvageItems // (Final|Native|Static|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void CheatGrantAllResearchTiers(struct UWorld* World, struct APlayerController* PlayerController); // Function Scavenger.S_AccountCheatsUtility.CheatGrantAllResearchTiers // (Final|Native|Static|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void CheatGrantAllResearchResources(struct UWorld* World, struct APlayerController* PlayerController, int32_t Count); // Function Scavenger.S_AccountCheatsUtility.CheatGrantAllResearchResources // (Final|Native|Static|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void CheatGrantAllRecipesForLoadoutSlotType(struct UWorld* World, struct APlayerController* PlayerController, enum class ES_LoadoutSlotType loadoutSlotType); // Function Scavenger.S_AccountCheatsUtility.CheatGrantAllRecipesForLoadoutSlotType // (Final|Native|Static|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void CheatGrantAllCosmeticItemsThatBeginWith(struct UWorld* World, struct APlayerController* PlayerController, struct FString Prefix); // Function Scavenger.S_AccountCheatsUtility.CheatGrantAllCosmeticItemsThatBeginWith // (Final|Native|Static|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void CheatGrantAllCosmeticItems(struct UWorld* World, struct APlayerController* PlayerController); // Function Scavenger.S_AccountCheatsUtility.CheatGrantAllCosmeticItems // (Final|Native|Static|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void CheatGrantAllClassSpecificWeapons(struct UWorld* World, struct APlayerController* PlayerController, struct FName ClassId); // Function Scavenger.S_AccountCheatsUtility.CheatGrantAllClassSpecificWeapons // (Final|Native|Static|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void CheatGrantAllClassSpecificTalents(struct UWorld* World, struct APlayerController* PlayerController, struct FName ClassId); // Function Scavenger.S_AccountCheatsUtility.CheatGrantAllClassSpecificTalents // (Final|Native|Static|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void CheatGrantAllCharacters(struct UWorld* World, struct APlayerController* PlayerController); // Function Scavenger.S_AccountCheatsUtility.CheatGrantAllCharacters // (Final|Native|Static|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_PostMatchPhase
// Size: 0x58 (Inherited: 0x28)
struct US_PostMatchPhase : UObject {
	struct FMulticastInlineDelegate OnPhaseStarted; // 0x28(0x10)
	struct FMulticastInlineDelegate OnPhaseEnded; // 0x38(0x10)
	char pad_48[0x8]; // 0x48(0x08)
	enum class ES_ResummonedPhaseState ResummonedState; // 0x50(0x01)
	char pad_51[0x7]; // 0x51(0x07)

	void RunSessionPhase(struct FS_MatchRecord matchRecord); // Function Scavenger.S_PostMatchPhase.RunSessionPhase // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	void RunMainMenuPhase(struct FS_GameReportCardForPlayer playerReportCard, struct FS_RewardPresentation playerRewards); // Function Scavenger.S_PostMatchPhase.RunMainMenuPhase // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	void MoveToNextStep(); // Function Scavenger.S_PostMatchPhase.MoveToNextStep // (Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool IsPhaseRunning(); // Function Scavenger.S_PostMatchPhase.IsPhaseRunning // (Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void EndPhase(); // Function Scavenger.S_PostMatchPhase.EndPhase // (Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_AccountProgressionPhase
// Size: 0x250 (Inherited: 0x58)
struct US_AccountProgressionPhase : US_PostMatchPhase {
	SoftClassProperty AccountProgressionSubscreen; // 0x58(0x28)
	SoftClassProperty AccountRewardsSubscreen; // 0x80(0x28)
	float StepDelay; // 0xa8(0x04)
	char pad_AC[0x4]; // 0xac(0x04)
	struct US_WidgetAccountProgressionSubscreen* m_accountProgressionSubscreen; // 0xb0(0x08)
	struct FS_GameReportCardForPlayer m_reportCard; // 0xb8(0x118)
	struct FS_RewardPresentation m_playerRewards; // 0x1d0(0x78)
	struct US_WidgetOnlineRewardGrants* m_accountRewardsSubscreen; // 0x248(0x08)

	void NotifyPlayerLevelUp(); // Function Scavenger.S_AccountProgressionPhase.NotifyPlayerLevelUp // (Event|Protected|BlueprintEvent) // @ game+0xffff8008e4a10000
	void HandleOnRewardSubscreenStepEnded(); // Function Scavenger.S_AccountProgressionPhase.HandleOnRewardSubscreenStepEnded // (Final|Native|Private) // @ game+0xffff8008e4a10000
	void HandleOnProgressionSubscreenStepEnded(); // Function Scavenger.S_AccountProgressionPhase.HandleOnProgressionSubscreenStepEnded // (Final|Native|Private) // @ game+0xffff8008e4a10000
	void HandleAccountRewardsSubscreenCreated(struct US_WidgetMinimal* subscreen); // Function Scavenger.S_AccountProgressionPhase.HandleAccountRewardsSubscreenCreated // (Final|Native|Private) // @ game+0xffff8008e4a10000
	void HandleAccountProgressionSubscreenCreated(struct US_WidgetMinimal* subscreen); // Function Scavenger.S_AccountProgressionPhase.HandleAccountProgressionSubscreenCreated // (Final|Native|Private) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_GameplayAbility
// Size: 0x3b8 (Inherited: 0x3b8)
struct US_GameplayAbility : UGameplayAbility {

	void NotifyGiveAbility_BP(struct FGameplayAbilityActorInfo GameplayAbilityActorInfo, struct FGameplayAbilitySpec GameplayAbilitySpec); // Function Scavenger.S_GameplayAbility.NotifyGiveAbility_BP // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_ActionAbility
// Size: 0x3c0 (Inherited: 0x3b8)
struct US_ActionAbility : US_GameplayAbility {
	char pad_3B8[0x8]; // 0x3b8(0x08)
};

// Class Scavenger.S_ActionConfiguration
// Size: 0x2d8 (Inherited: 0x30)
struct US_ActionConfiguration : UDataAsset {
	struct UDataTable* m_actionDataTable; // 0x30(0x08)
	enum class ES_ActionQueueLength m_maxQueueLength[0x10]; // 0x38(0x10)
	float m_maxRemoteQueueLength[0x10]; // 0x48(0x40)
	enum class ES_MultiActionCondition m_multiActionCondition[0x10]; // 0x88(0x10)
	float m_actionCooldownTimes[0x10]; // 0x98(0x40)
	struct FS_ActionConfig m_actionList[0x10]; // 0xd8(0x200)
};

// Class Scavenger.S_ActionHandler
// Size: 0x138 (Inherited: 0xb0)
struct US_ActionHandler : UActorComponent {
	bool bDoMatrixChecksOnNonLocal; // 0xb0(0x01)
	char pad_B1[0x47]; // 0xb1(0x47)
	struct TArray<struct FS_QueuedAction> m_queuedActions; // 0xf8(0x10)
	char pad_108[0x30]; // 0x108(0x30)
};

// Class Scavenger.S_ActionManager
// Size: 0x28 (Inherited: 0x28)
struct US_ActionManager : UInterface {

	void UnlockAction(enum class ES_ActionID ActionType); // Function Scavenger.S_ActionManager.UnlockAction // (Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	struct FS_TryActionResult TryAction(struct FS_ActionPayload ActionPayload); // Function Scavenger.S_ActionManager.TryAction // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	void StopAction(struct FS_ActionHandle ActionHandle); // Function Scavenger.S_ActionManager.StopAction // (Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void ResetActions(); // Function Scavenger.S_ActionManager.ResetActions // (Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void LockAction(enum class ES_ActionID ActionType); // Function Scavenger.S_ActionManager.LockAction // (Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool GetActionPayload_BP(struct FS_ActionHandle ActionHandle, struct FS_ActionPayload OutActionPayload); // Function Scavenger.S_ActionManager.GetActionPayload_BP // (Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool CanDoAction(struct FS_ActionPayload ActionPayload); // Function Scavenger.S_ActionManager.CanDoAction // (Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	void AddOnRemovedFromQueueListener(struct FS_ActionHandle ActionHandle, struct FDelegate RemovedFromQueueDelegate); // Function Scavenger.S_ActionManager.AddOnRemovedFromQueueListener // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	void AddOnInterruptListener(struct FS_ActionHandle ActionHandle, struct FDelegate InterruptDelegate); // Function Scavenger.S_ActionManager.AddOnInterruptListener // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	void AddOnCompleteListener(struct FS_ActionHandle ActionHandle, struct FDelegate CompleteDelegate); // Function Scavenger.S_ActionManager.AddOnCompleteListener // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	void AddOnActiveListener(struct FS_ActionHandle ActionHandle, struct FDelegate ActiveDelegate); // Function Scavenger.S_ActionManager.AddOnActiveListener // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	void AddOnActionQueuedListener(struct FDelegate ActionQueuedDelegate); // Function Scavenger.S_ActionManager.AddOnActionQueuedListener // (Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void AddOnActionActivatedListener(struct FDelegate ActionActivatedDelegate); // Function Scavenger.S_ActionManager.AddOnActionActivatedListener // (Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_ActionHelpers
// Size: 0x28 (Inherited: 0x28)
struct US_ActionHelpers : UBlueprintFunctionLibrary {

	struct FS_ActionPayload MakeUseItemPayload(int32_t Identifier, struct US_ItemData* ItemData, enum class ES_UseItemActionOrigin Origin); // Function Scavenger.S_ActionHelpers.MakeUseItemPayload // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0xffff8008e4a10000
	struct FS_ActionPayload MakeSwapWeaponPayload(enum class ES_WeaponSlot desiredWeaponSlot); // Function Scavenger.S_ActionHelpers.MakeSwapWeaponPayload // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0xffff8008e4a10000
	struct FS_ActionPayload MakeSlidePayload(bool bJumpSlide, bool bFellOutOfLastSlide, bool bPerfectSlide); // Function Scavenger.S_ActionHelpers.MakeSlidePayload // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0xffff8008e4a10000
	struct FS_ActionPayload MakeReloadPayload(enum class ES_WeaponSlot weaponSlot, enum class ES_TriggerType triggerType, bool bIsExplicit); // Function Scavenger.S_ActionHelpers.MakeReloadPayload // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0xffff8008e4a10000
	struct FS_ActionPayload MakeMeleeAttackPayload(enum class ES_WeaponSlot weaponSlot, enum class ES_TriggerType triggerType); // Function Scavenger.S_ActionHelpers.MakeMeleeAttackPayload // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0xffff8008e4a10000
	struct FS_ActionPayload MakeInteractPayload(enum class ES_Interaction interactType); // Function Scavenger.S_ActionHelpers.MakeInteractPayload // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0xffff8008e4a10000
	struct FS_ActionPayload MakeFireGunPayload(enum class ES_WeaponSlot weaponSlot, enum class ES_TriggerType triggerType); // Function Scavenger.S_ActionHelpers.MakeFireGunPayload // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0xffff8008e4a10000
	struct FS_ActionPayload MakeEmotePayload(struct FName emoteDataNameId); // Function Scavenger.S_ActionHelpers.MakeEmotePayload // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0xffff8008e4a10000
	struct FS_ActionPayload MakeADSPayload(); // Function Scavenger.S_ActionHelpers.MakeADSPayload // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_AIAudioEventType
// Size: 0x28 (Inherited: 0x28)
struct US_AIAudioEventType : UObject {
};

// Class Scavenger.S_AIAudioManagedGroup
// Size: 0x58 (Inherited: 0x28)
struct US_AIAudioManagedGroup : UObject {
	int32_t MaxConcurrent; // 0x28(0x04)
	int32_t RateLimitNum; // 0x2c(0x04)
	float RateLimitTimeWindowS; // 0x30(0x04)
	float MaxDistance; // 0x34(0x04)
	struct TArray<struct FS_GroupPlayingSound> PlayingSounds; // 0x38(0x10)
	struct TArray<struct FS_GroupPlayingSound> PreviousSounds; // 0x48(0x10)
};

// Class Scavenger.S_AIAudioComponent
// Size: 0x1b8 (Inherited: 0xb0)
struct US_AIAudioComponent : UActorComponent {
	struct UAkAudioEvent* DeathEvent; // 0xb0(0x08)
	struct TArray<struct FS_AITransitionStateSound> TransitionSounds; // 0xb8(0x10)
	struct TArray<struct FS_EventSoundGroup> EventSounds; // 0xc8(0x10)
	struct TArray<struct FS_AIStateSound> StateSounds; // 0xd8(0x10)
	int32_t PriorityBoost; // 0xe8(0x04)
	char pad_EC[0x4]; // 0xec(0x04)
	struct TArray<enum class ES_AIAudioState> StateStack; // 0xf0(0x10)
	enum class ES_AIAudioState CurrentState; // 0x100(0x01)
	char pad_101[0x1f]; // 0x101(0x1f)
	struct TArray<struct FS_ServerQueuedAISound> ServerQueuedSounds; // 0x120(0x10)
	struct FS_ClientQueuedAISound ClientQueuedSound; // 0x130(0x38)
	struct FS_PlayingAISound ClientPlayingSound; // 0x168(0x38)
	char pad_1A0[0x10]; // 0x1a0(0x10)
	char m_sonicVariant; // 0x1b0(0x01)
	char pad_1B1[0x7]; // 0x1b1(0x07)

	void TriggerAiEvent(struct US_AIAudioEventType* AiEvent); // Function Scavenger.S_AIAudioComponent.TriggerAiEvent // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void AuthorityTriggerAiEvent(struct US_AIAudioEventType* AiEvent); // Function Scavenger.S_AIAudioComponent.AuthorityTriggerAiEvent // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void AIAudioComponent_OnRollbackPredictivelyKilledCallback(struct AController* PredictiveInstigator); // Function Scavenger.S_AIAudioComponent.AIAudioComponent_OnRollbackPredictivelyKilledCallback // (Final|Native|Protected) // @ game+0xffff8008e4a10000
	void AIAudioComponent_OnPredictivelyKilledCallback(struct AController* PredictiveInstigator, float DamageAmount, struct FDamageEvent DamageEvent, struct AActor* CauseActor, bool Critical); // Function Scavenger.S_AIAudioComponent.AIAudioComponent_OnPredictivelyKilledCallback // (Final|Native|Protected|HasOutParms) // @ game+0xffff8008e4a10000
	void AIAudioComponent_OnDiedCallback(struct US_StatsComponent* StatsComponent, enum class ES_StatsState OldState, enum class ES_StatsState NewState); // Function Scavenger.S_AIAudioComponent.AIAudioComponent_OnDiedCallback // (Final|Native|Protected) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_CharacterBase
// Size: 0x2220 (Inherited: 0x530)
struct AS_CharacterBase : ACharacter {
	char pad_530[0xa0]; // 0x530(0xa0)
	struct USC_CommandHandler* m_commandHandler; // 0x5d0(0x08)
	char pad_5D8[0x10]; // 0x5d8(0x10)
	struct US_WeaponSystem* m_weaponSystemComponent; // 0x5e8(0x08)
	char pad_5F0[0x18]; // 0x5f0(0x18)
	struct FS_EquipmentStateComponent EquipmentStateComponent; // 0x608(0x228)
	char pad_830[0x4]; // 0x830(0x04)
	int32_t m_selfDestructMontageIndex; // 0x834(0x04)
	char pad_838[0x10]; // 0x838(0x10)
	struct FMulticastInlineDelegate OnADSUpdated; // 0x848(0x10)
	struct FMulticastInlineDelegate OnCrouchUpdated; // 0x858(0x10)
	struct FS_MeleeAttackState m_meleeAttackState; // 0x868(0x50)
	struct TArray<struct FS_MeleeAttackerInfo> m_meleeAttackingMeInfo; // 0x8b8(0x10)
	struct FString CharacterMeshPath; // 0x8c8(0x10)
	struct TSoftObjectPtr<struct USkeletalMesh> CharacterMesh; // 0x8d8(0x28)
	struct FS_CosmeticLoadoutForReplication m_characterCosmeticLoadoutForReplication; // 0x900(0x10)
	struct FS_CosmeticLoadoutForReplication m_accountCosmeticLoadoutForReplication; // 0x910(0x10)
	struct FMulticastInlineDelegate OnCosmeticLoadoutChanged; // 0x920(0x10)
	struct FS_CosmeticLoadout m_characterCosmeticLoadout; // 0x930(0x50)
	struct FS_CosmeticLoadout m_accountCosmeticLoadout; // 0x980(0x50)
	char pad_9D0[0x41]; // 0x9d0(0x41)
	bool HasDynamicSnowAccumulation; // 0xa11(0x01)
	char pad_A12[0x6]; // 0xa12(0x06)
	struct US_SkinningManagerComponent* CachedSkinningManagerComponent; // 0xa18(0x08)
	char pad_A20[0x8]; // 0xa20(0x08)
	struct US_CosmeticSkinningComponent* m_cosmeticSkinningComponent; // 0xa28(0x08)
	char pad_A30[0x20]; // 0xa30(0x20)
	struct US_VFXManagerComponent* CachedVFXManagerComponent; // 0xa50(0x08)
	enum class ES_ShelterType ShelterState; // 0xa58(0x01)
	char pad_A59[0x17]; // 0xa59(0x17)
	bool m_bIsJumping; // 0xa70(0x01)
	char pad_A71[0x7]; // 0xa71(0x07)
	struct FS_ShelterInterfaceData ShelterData; // 0xa78(0x98)
	struct FMulticastInlineDelegate OnShelterStateChanged; // 0xb10(0x10)
	struct FMulticastInlineDelegate OnDamagedBy; // 0xb20(0x10)
	struct FMulticastInlineDelegate OnDownedBy; // 0xb30(0x10)
	struct FMulticastInlineDelegate OnTerminalBy; // 0xb40(0x10)
	struct FMulticastInlineDelegate OnKilledBy; // 0xb50(0x10)
	struct FMulticastInlineDelegate OnResurrectedBy; // 0xb60(0x10)
	struct FMulticastInlineDelegate OnRevivedBy; // 0xb70(0x10)
	struct FMulticastInlineDelegate OnStatsStateChangedBy; // 0xb80(0x10)
	struct FMulticastInlineDelegate OnItemAcquired; // 0xb90(0x10)
	struct FMulticastInlineDelegate OnItemDestroyed; // 0xba0(0x10)
	struct FMulticastInlineDelegate OnItemDropped; // 0xbb0(0x10)
	struct FMulticastInlineDelegate OnItemEquipped; // 0xbc0(0x10)
	struct FMulticastInlineDelegate OnItemUnequipped; // 0xbd0(0x10)
	struct FMulticastInlineDelegate OnItemUsed; // 0xbe0(0x10)
	struct FMulticastInlineDelegate OnCocooned; // 0xbf0(0x10)
	struct FMulticastInlineDelegate OnFreedFromCocoon; // 0xc00(0x10)
	struct FMulticastInlineDelegate OnKilledInCocoon; // 0xc10(0x10)
	struct FMulticastInlineDelegate OnExtracting; // 0xc20(0x10)
	struct FMulticastInlineDelegate OnExtracted; // 0xc30(0x10)
	struct FMulticastInlineDelegate OnSelfDestructCompleted; // 0xc40(0x10)
	struct FMulticastInlineDelegate OnPreDealDamage; // 0xc50(0x10)
	struct FMulticastInlineDelegate OnPreTakeDamage; // 0xc60(0x10)
	struct FMulticastInlineDelegate OnPreTakePointDamage; // 0xc70(0x10)
	struct FMulticastInlineDelegate OnPostDealDamage; // 0xc80(0x10)
	struct FMulticastInlineDelegate OnPostTakeDamage; // 0xc90(0x10)
	struct FMulticastInlineDelegate OnPostTakePointDamage; // 0xca0(0x10)
	struct FMulticastInlineDelegate OnDealCriticalDamage; // 0xcb0(0x10)
	struct FMulticastInlineDelegate OnPoiseZero; // 0xcc0(0x10)
	struct FMulticastInlineDelegate OnFootDown; // 0xcd0(0x10)
	struct FMulticastInlineDelegate OnStormCategoryChanged; // 0xce0(0x10)
	struct FMulticastInlineDelegate OnSkeletalMeshChanged; // 0xcf0(0x10)
	char pad_D00[0x14]; // 0xd00(0x14)
	bool m_ragdollPostExecution; // 0xd14(0x01)
	char pad_D15[0x3]; // 0xd15(0x03)
	float RagdollOnDeathOrTerminalDelay; // 0xd18(0x04)
	float RagdollOnDeathOrTerminalDelayDuringExecution; // 0xd1c(0x04)
	float RagdollOnDeathSpectatorWaitInSeconds; // 0xd20(0x04)
	bool bDisableRagdollEntirely; // 0xd24(0x01)
	char pad_D25[0x3]; // 0xd25(0x03)
	float BaseThreatLevel; // 0xd28(0x04)
	struct FS_Visibility Visibility; // 0xd2c(0x14)
	struct FS_ThreatLevelMidnight ThreatLevelMidnight; // 0xd40(0x1c)
	struct FRotator GrenadeSpawnRotation; // 0xd5c(0x0c)
	struct FS_ProjectileSpawnPointInfo ProjectileSpawnPoint[0x4]; // 0xd68(0xc0)
	float ProjectileSpawnPointHeightOffset[0x4]; // 0xe28(0x10)
	struct FName SelfDestructMontageKey; // 0xe38(0x08)
	float MaximumPoise; // 0xe40(0x04)
	char pad_E44[0x4]; // 0xe44(0x04)
	float PoiseRefreshRate; // 0xe48(0x04)
	float PoiseCooldownTime; // 0xe4c(0x04)
	char pad_E50[0x8]; // 0xe50(0x08)
	struct FS_TimeBasedDamageTracker DamageDoneToCharacters; // 0xe58(0x28)
	struct FS_TimeBasedDamageTracker DamageRecievedFromCharacters; // 0xe80(0x28)
	struct FName RootBoneName; // 0xea8(0x08)
	struct FName PelvisBoneName; // 0xeb0(0x08)
	struct FName Spine1BoneName; // 0xeb8(0x08)
	struct FName Spine2BoneName; // 0xec0(0x08)
	struct AS_CharacterBase* AbilityOwnerToLastHitThisCharacter; // 0xec8(0x08)
	bool bHideDamageNumbersIfZero; // 0xed0(0x01)
	char pad_ED1[0x7]; // 0xed1(0x07)
	struct UDataTable* Impacts; // 0xed8(0x08)
	struct FS_FeedbackAudio Override1pTo3pHitFeedback; // 0xee0(0x100)
	struct FS_3PFeedbackAudio Override3pTo1pHitFeedback; // 0xfe0(0x140)
	struct FS_3PFeedbackAudio Override3pTo3pHitFeedback; // 0x1120(0x140)
	struct FS_LookAtInfo LookAtInfo; // 0x1260(0x10)
	struct FMulticastInlineDelegate OnSeatEntered; // 0x1270(0x10)
	struct FMulticastInlineDelegate OnSeatExited; // 0x1280(0x10)
	struct FText m_displayName; // 0x1290(0x18)
	bool bEnableDecalsOnCharacter; // 0x12a8(0x01)
	enum class ES_StormCategory m_IsInStormCategory; // 0x12a9(0x01)
	bool m_isInSmoke; // 0x12aa(0x01)
	char pad_12AB[0x5]; // 0x12ab(0x05)
	struct US_LandscapeDeformerAgent* m_landscapeDeformerAgent; // 0x12b0(0x08)
	struct FScavengerTeamID TeamInfo; // 0x12b8(0x01)
	char pad_12B9[0x7]; // 0x12b9(0x07)
	struct UPhysicalMaterial* CharacterPhysicsMaterial; // 0x12c0(0x08)
	struct US_AbilitySystemComponent* AbilitySystemComponent; // 0x12c8(0x08)
	struct US_FoleyComponent* FoleyComponent; // 0x12d0(0x08)
	struct US_FootstepComponent* FootstepComponent; // 0x12d8(0x08)
	struct UAkComponent* AkComponent; // 0x12e0(0x08)
	struct US_AttributeSetCharacter* AttributeSetCharacter; // 0x12e8(0x08)
	struct UDataTable* AttributeInitializationDataTable; // 0x12f0(0x08)
	struct FS_AbilitySet InitialAbilities; // 0x12f8(0x10)
	struct TArray<struct UGameplayEffect*> InitialGameplayEffects; // 0x1308(0x10)
	struct TArray<struct FName> BonesAllowingAttachingProjectiles; // 0x1318(0x10)
	struct FS_MontageCatalogue CharacterAnimationMontages; // 0x1328(0x50)
	struct UDataTable* CharacterMontageOverrideTable; // 0x1378(0x08)
	struct US_CharacterMontagePackage* AttackMontages; // 0x1380(0x08)
	float RagdollValidImpactTime; // 0x1388(0x04)
	float RagdollBaseImpactScalar; // 0x138c(0x04)
	struct UDataTable* PhysicalSurfaceOverrideDataTable; // 0x1390(0x08)
	struct US_StatsComponent* m_statsComponent; // 0x1398(0x08)
	bool DisableClientPhysics; // 0x13a0(0x01)
	bool DisableServerPhysics; // 0x13a1(0x01)
	char pad_13A2[0x2]; // 0x13a2(0x02)
	struct FName InitialCollisionProfile; // 0x13a4(0x08)
	char pad_13AC[0x4]; // 0x13ac(0x04)
	bool m_replicatedADSIsActive; // 0x13b0(0x01)
	char pad_13B1[0x7]; // 0x13b1(0x07)
	struct TArray<struct US_KungFuAttacker*> m_activeMeleeAttackers; // 0x13b8(0x10)
	struct TArray<struct US_KungFuAttacker*> m_activeMediumAttackers; // 0x13c8(0x10)
	struct TArray<struct US_KungFuAttacker*> m_activeExtendedAttackers; // 0x13d8(0x10)
	struct TArray<struct US_KungFuAttacker*> m_attackersToBecomeInactive; // 0x13e8(0x10)
	char pad_13F8[0x230]; // 0x13f8(0x230)
	int8_t m_notAITargetableCounter; // 0x1628(0x01)
	char pad_1629[0x7]; // 0x1629(0x07)
	struct AController* m_cachedController; // 0x1630(0x08)
	char pad_1638[0x8]; // 0x1638(0x08)
	struct FS_RepMontageState m_RepMontageState; // 0x1640(0x18)
	struct FS_RepMontageState m_lastRepMontageState; // 0x1658(0x18)
	char pad_1670[0x8]; // 0x1670(0x08)
	struct TArray<struct UAnimMontage*> m_currentPlayingAttackMontages; // 0x1678(0x10)
	struct UAnimMontage* WeaponRecoilMontage; // 0x1688(0x08)
	char pad_1690[0x8]; // 0x1690(0x08)
	bool bSnapPassengerTo90DegreeAim; // 0x1698(0x01)
	bool bLockPassengerRotationWhenSeated; // 0x1699(0x01)
	char pad_169A[0x46]; // 0x169a(0x46)
	struct FS_CachedLastDamageInfo m_cachedLastDamageInfo; // 0x16e0(0xa8)
	struct FRotator m_repClientAimRotation; // 0x1788(0x0c)
	char pad_1794[0xc]; // 0x1794(0x0c)
	struct UMaterialInterface* BloodSplatMaterial; // 0x17a0(0x08)
	float MaxCapsuleHitWidthPercent; // 0x17a8(0x04)
	char pad_17AC[0x4]; // 0x17ac(0x04)
	struct UMaterialInstanceDynamic* m_bloodSplatMaterialInstanceDynamic; // 0x17b0(0x08)
	char pad_17B8[0x698]; // 0x17b8(0x698)
	struct FMulticastInlineDelegate OnExecutionBegin; // 0x1e50(0x10)
	struct FMulticastInlineDelegate OnExecutionMontageEnded; // 0x1e60(0x10)
	struct FMulticastInlineDelegate OnEmoteBegin; // 0x1e70(0x10)
	struct FMulticastInlineDelegate OnEmoteEnd; // 0x1e80(0x10)
	char pad_1E90[0x18]; // 0x1e90(0x18)
	struct FVector m_executionStartLocation; // 0x1ea8(0x0c)
	struct FVector m_executionGoalLocation; // 0x1eb4(0x0c)
	struct FRotator m_executionStartRotation; // 0x1ec0(0x0c)
	struct FRotator m_executionGoalRotation; // 0x1ecc(0x0c)
	struct AS_CharacterBase* m_executor; // 0x1ed8(0x08)
	char pad_1EE0[0x8]; // 0x1ee0(0x08)
	struct TArray<enum class ES_ExecutionOverride> ExecutionOverridePriorityOrder; // 0x1ee8(0x10)
	char pad_1EF8[0x1c0]; // 0x1ef8(0x1c0)
	struct AS_CharacterBase* m_executionTarget; // 0x20b8(0x08)
	char pad_20C0[0x8]; // 0x20c0(0x08)
	struct UDataTable* ExecutionMontageDataTable; // 0x20c8(0x08)
	struct UDataTable* EmoteMontageDataTable; // 0x20d0(0x08)
	struct UDataTable* WeaponScaleDataTable; // 0x20d8(0x08)
	char pad_20E0[0x40]; // 0x20e0(0x40)
	struct US_SpottingComponent* m_spottingComponent; // 0x2120(0x08)
	char pad_2128[0x68]; // 0x2128(0x68)
	float VFXMaxSnowAccumulationNoShelter; // 0x2190(0x04)
	float VFXMaxSnowAccumulationCraterShelter; // 0x2194(0x04)
	float VFXMaxSnowAccumulationPartialShelter; // 0x2198(0x04)
	float VFXMaxSnowAccumulationFullShelter; // 0x219c(0x04)
	float VFXMaxSnowAccumulationLegacy; // 0x21a0(0x04)
	bool VFXSnowUseStorminess; // 0x21a4(0x01)
	char pad_21A5[0x3]; // 0x21a5(0x03)
	float VFXInStormSnowAccumulationPerSecond; // 0x21a8(0x04)
	float VFXLowerSnowAccumulationPerSecond; // 0x21ac(0x04)
	float VFXMediumSnowAccumulationPerSecond; // 0x21b0(0x04)
	float VFXCraterShelterSnowDissipationPerSecond; // 0x21b4(0x04)
	float VFXPartialShelterSnowDissipationPerSecond; // 0x21b8(0x04)
	float VFXFullShelterSnowDissipationPerSecond; // 0x21bc(0x04)
	float VFXHeatSourceSnowDissipationPerSecond; // 0x21c0(0x04)
	bool VFXGooEnabled; // 0x21c4(0x01)
	char pad_21C5[0x3]; // 0x21c5(0x03)
	float VFXMaxGooAccumulation; // 0x21c8(0x04)
	float VFXGooAccumulationPerSecond; // 0x21cc(0x04)
	float VFXGooDissipationPerSecond; // 0x21d0(0x04)
	struct FFloatInterval VFXDamageInflictedMinMax; // 0x21d4(0x08)
	bool VFXWoundsEnabled; // 0x21dc(0x01)
	char pad_21DD[0x3]; // 0x21dd(0x03)
	struct FFloatInterval VFXWoundInitialSizeMinMax; // 0x21e0(0x08)
	struct FFloatInterval VFXWoundFinalSizeMinMax; // 0x21e8(0x08)
	struct FFloatInterval VFXWoundTimeToMaxSizeMinMax; // 0x21f0(0x08)
	float VFXWoundTimeBeforeFadingOut; // 0x21f8(0x04)
	float VFXWoundFadeOutDuration; // 0x21fc(0x04)
	float VFXWoundOpacityMin; // 0x2200(0x04)
	char pad_2204[0x4]; // 0x2204(0x04)
	struct US_ShieldComponent* ShieldComponent; // 0x2208(0x08)
	char pad_2210[0x8]; // 0x2210(0x08)
	struct US_ManagedSoundBankComponent* m_managedSoundBankComponent; // 0x2218(0x08)

	void WeaponSlotStateChanged(enum class ES_WeaponSlot weaponSlot, struct AS_WeaponBase* weapon, enum class ES_WeaponSlotState weaponSlotState); // Function Scavenger.S_CharacterBase.WeaponSlotStateChanged // (Final|Native|Public) // @ game+0xffff8008e4a10000
	void WeaponSlotChanged(enum class ES_WeaponSlot weaponSlot, struct AS_WeaponBase* OldValue, struct AS_WeaponBase* NewValue); // Function Scavenger.S_CharacterBase.WeaponSlotChanged // (Final|Native|Public) // @ game+0xffff8008e4a10000
	void VFXInflictDamageWithLocation(float DamageAmount, struct FVector HitLocation); // Function Scavenger.S_CharacterBase.VFXInflictDamageWithLocation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0xffff8008e4a10000
	void VFXInflictDamageWithHitResult(float DamageAmount, struct FHitResult HitResult); // Function Scavenger.S_CharacterBase.VFXInflictDamageWithHitResult // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	void VFXEnableWounds(bool bEnable); // Function Scavenger.S_CharacterBase.VFXEnableWounds // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void UnCrouchOnRevivingStopped(); // Function Scavenger.S_CharacterBase.UnCrouchOnRevivingStopped // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void ToggleHolsterWeapon(); // Function Scavenger.S_CharacterBase.ToggleHolsterWeapon // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void ThrewGrenade(); // Function Scavenger.S_CharacterBase.ThrewGrenade // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void StopReplicatedMontage(float BlendOutTime); // Function Scavenger.S_CharacterBase.StopReplicatedMontage // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	int32_t ShellSpawnWithMeshFilters(struct FName ShellName, struct UMaterialInterface* Material, struct TArray<struct FString> MeshFilters); // Function Scavenger.S_CharacterBase.ShellSpawnWithMeshFilters // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	int32_t ShellSpawnWithMaterialFilters(struct FName ShellName, struct UMaterialInterface* Material, struct TArray<struct FString> MaterialFilters); // Function Scavenger.S_CharacterBase.ShellSpawnWithMaterialFilters // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	int32_t ShellSpawnWithFilters(struct FName ShellName, struct UMaterialInterface* Material, struct TArray<struct FString> MaterialFilters, struct TArray<struct FString> MeshFilters); // Function Scavenger.S_CharacterBase.ShellSpawnWithFilters // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	int32_t ShellSpawn(struct FName ShellName, struct UMaterialInterface* Material); // Function Scavenger.S_CharacterBase.ShellSpawn // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	int32_t ShellGetIdByName(struct FName ShellName); // Function Scavenger.S_CharacterBase.ShellGetIdByName // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void ShellDestroyById(int32_t ShellId); // Function Scavenger.S_CharacterBase.ShellDestroyById // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void ShellDestroy(struct FName ShellName); // Function Scavenger.S_CharacterBase.ShellDestroy // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void SetScavengerTeam(enum class ES_ScavAITeams TeamId); // Function Scavenger.S_CharacterBase.SetScavengerTeam // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void SetRagdoll(bool bEnabled); // Function Scavenger.S_CharacterBase.SetRagdoll // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void SetOverridePriorityOrderForExecutions(struct TArray<enum class ES_ExecutionOverride> overridePriorityOrder); // Function Scavenger.S_CharacterBase.SetOverridePriorityOrderForExecutions // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	void SetLookAtTargetActor(bool Value); // Function Scavenger.S_CharacterBase.SetLookAtTargetActor // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void SetLookAtPosition(struct FVector newFocalPoint); // Function Scavenger.S_CharacterBase.SetLookAtPosition // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0xffff8008e4a10000
	void SetIsLaunched(bool bIsLaunched); // Function Scavenger.S_CharacterBase.SetIsLaunched // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void SetIsInStormCategory(enum class ES_StormCategory NewInStormCategory); // Function Scavenger.S_CharacterBase.SetIsInStormCategory // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void SetIsInSmoke(bool inSmoke); // Function Scavenger.S_CharacterBase.SetIsInSmoke // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void SetDisplayName(struct FText DisplayName); // Function Scavenger.S_CharacterBase.SetDisplayName // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void SetControlRotationLocked(bool bLocked); // Function Scavenger.S_CharacterBase.SetControlRotationLocked // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void SetCharacterCosmeticLoadout(struct FS_CosmeticLoadout newLoadout); // Function Scavenger.S_CharacterBase.SetCharacterCosmeticLoadout // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	void SetAccountCosmeticLoadout(struct FS_CosmeticLoadout newLoadout); // Function Scavenger.S_CharacterBase.SetAccountCosmeticLoadout // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	void SetABPIsFiringState(bool toggle); // Function Scavenger.S_CharacterBase.SetABPIsFiringState // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void ServerRequestStopReplicatedMontage(float BlendOutTime); // Function Scavenger.S_CharacterBase.ServerRequestStopReplicatedMontage // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0xffff8008e4a10000
	void ServerRequestPlayReplicatedMontage(struct UAnimMontage* Montage, float PlayRate); // Function Scavenger.S_CharacterBase.ServerRequestPlayReplicatedMontage // (Final|Net|NetReliableNative|Event|Private|NetServer|NetValidate) // @ game+0xffff8008e4a10000
	void ServerRequestInterruptEmote(); // Function Scavenger.S_CharacterBase.ServerRequestInterruptEmote // (Net|Native|Event|Protected|NetServer|NetValidate) // @ game+0xffff8008e4a10000
	void ServerRequestExitSeat(); // Function Scavenger.S_CharacterBase.ServerRequestExitSeat // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0xffff8008e4a10000
	void ServerRequestDoEmote(struct FName emoteNameId); // Function Scavenger.S_CharacterBase.ServerRequestDoEmote // (Net|Native|Event|Protected|NetServer|NetValidate) // @ game+0xffff8008e4a10000
	void ServerNotifyJumpBegin(bool bExhaustedJump); // Function Scavenger.S_CharacterBase.ServerNotifyJumpBegin // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0xffff8008e4a10000
	void ServerNotifyClientAimRotation(uint16_t Yaw, uint16_t Pitch); // Function Scavenger.S_CharacterBase.ServerNotifyClientAimRotation // (Final|Net|Native|Event|Private|NetServer|NetValidate) // @ game+0xffff8008e4a10000
	void ServerDeactivateADS(); // Function Scavenger.S_CharacterBase.ServerDeactivateADS // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0xffff8008e4a10000
	void ServerActivateADS(); // Function Scavenger.S_CharacterBase.ServerActivateADS // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0xffff8008e4a10000
	bool SelectCurrentWeaponAndHolster(enum class ES_WeaponSlot weaponSlot); // Function Scavenger.S_CharacterBase.SelectCurrentWeaponAndHolster // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool SelectCurrentWeapon(enum class ES_WeaponSlot weaponSlot); // Function Scavenger.S_CharacterBase.SelectCurrentWeapon // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	struct UAnimMontage* SelectAttackMontageVariant(struct TArray<struct UAnimMontage*> MontageVariations, enum class ES_WeaponMontageEvent attackEvent, enum class ES_TriggerType triggerType); // Function Scavenger.S_CharacterBase.SelectAttackMontageVariant // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xffff8008e4a10000
	void ScavengerCrossServerTakeDamage(float DamageAmount, struct FS_PointDamageEvent DamageEvent, struct AController* EventInstigator, struct AActor* DamageCauser, enum class ES_TriggerType triggerType); // Function Scavenger.S_CharacterBase.ScavengerCrossServerTakeDamage // (Net|NetReliableNative|Event|Public) // @ game+0xffff8008e4a10000
	void ScavengerCrossServerAddImpulseAtLocation(struct FVector Impulse, struct FVector Location); // Function Scavenger.S_CharacterBase.ScavengerCrossServerAddImpulseAtLocation // (Net|NetReliableNative|Event|Public|HasDefaults) // @ game+0xffff8008e4a10000
	void RollbackPredictivelyKilled(struct AController* PredictiveInstigator); // Function Scavenger.S_CharacterBase.RollbackPredictivelyKilled // (Final|Native|Public) // @ game+0xffff8008e4a10000
	void ResetControlRotationLock(); // Function Scavenger.S_CharacterBase.ResetControlRotationLock // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void RegisterEquippedWeapon(enum class ES_WeaponSlot weaponSlot, struct AS_WeaponBase* weapon); // Function Scavenger.S_CharacterBase.RegisterEquippedWeapon // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void ProcessAttackRelease(enum class ES_WeaponSlot weaponSlot, enum class ES_TriggerType triggerType); // Function Scavenger.S_CharacterBase.ProcessAttackRelease // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool ProcessAttackPress(enum class ES_WeaponSlot weaponSlot, enum class ES_TriggerType triggerType); // Function Scavenger.S_CharacterBase.ProcessAttackPress // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void PostProcessEffectSpawn(struct FName EffectName, struct UMaterialInterface* Material); // Function Scavenger.S_CharacterBase.PostProcessEffectSpawn // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void PostProcessEffectDestroy(struct FName EffectName); // Function Scavenger.S_CharacterBase.PostProcessEffectDestroy // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void PlayReplicatedMontageByTableIndex(struct FS_MontageCatalogueIndex Index); // Function Scavenger.S_CharacterBase.PlayReplicatedMontageByTableIndex // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void PlayReplicatedMontage(struct UAnimMontage* Montage, float PlayRate); // Function Scavenger.S_CharacterBase.PlayReplicatedMontage // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void PlayRandomReplicatedMontageByTableKey(struct FName MontageKey); // Function Scavenger.S_CharacterBase.PlayRandomReplicatedMontageByTableKey // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void PlayRandomNonReplicatedMontageByTableKey(struct FName MontageKey); // Function Scavenger.S_CharacterBase.PlayRandomNonReplicatedMontageByTableKey // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void PlayNonReplicatedMontageByTableIndex(struct FS_MontageCatalogueIndex Index); // Function Scavenger.S_CharacterBase.PlayNonReplicatedMontageByTableIndex // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void OnTakePointDamageCallback(struct AActor* DamagedActor, float DamageAmount, struct AController* InstigatorController, struct FVector HitLocation, struct UPrimitiveComponent* HitComponent, struct FName BoneName, struct FVector ShotFromDirection, struct UDamageType* DamageType, struct AActor* DamageCauser); // Function Scavenger.S_CharacterBase.OnTakePointDamageCallback // (Final|Native|Public|HasDefaults) // @ game+0xffff8008e4a10000
	void OnSlideUpdated(enum class ES_Slide NewSlide, int32_t NewCustomIdx, enum class ES_Slide OldSlide, int32_t OldCustomIdx); // Function Scavenger.S_CharacterBase.OnSlideUpdated // (Native|Public) // @ game+0xffff8008e4a10000
	void OnRevivedCallback(struct US_StatsComponent* StatsComponent, enum class ES_StatsState OldState, enum class ES_StatsState NewState); // Function Scavenger.S_CharacterBase.OnRevivedCallback // (Final|Native|Protected) // @ game+0xffff8008e4a10000
	void OnRep_ShelterState(); // Function Scavenger.S_CharacterBase.OnRep_ShelterState // (Native|Event|Public|BlueprintEvent) // @ game+0xffff8008e4a10000
	void OnRep_CharacterMeshPath(); // Function Scavenger.S_CharacterBase.OnRep_CharacterMeshPath // (Final|Native|Public) // @ game+0xffff8008e4a10000
	void OnMontageEnded(struct UAnimMontage* Montage, bool bInterrupted, int32_t montageInstanceID); // Function Scavenger.S_CharacterBase.OnMontageEnded // (Final|Native|Protected) // @ game+0xffff8008e4a10000
	void OnEnterRagDoll_BP(struct FHitResult HitResult, float timeSinceHit); // Function Scavenger.S_CharacterBase.OnEnterRagDoll_BP // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0xffff8008e4a10000
	void OnDownedCallback(struct US_StatsComponent* StatsComponent, enum class ES_StatsState OldState, enum class ES_StatsState NewState); // Function Scavenger.S_CharacterBase.OnDownedCallback // (Final|Native|Protected) // @ game+0xffff8008e4a10000
	void OnDodgeUpdated(bool IsDodgeOn, int32_t customIdx); // Function Scavenger.S_CharacterBase.OnDodgeUpdated // (Native|Public) // @ game+0xffff8008e4a10000
	void OnAttackEvent(enum class ES_WeaponSlot weaponSlot, enum class ES_TriggerType triggerType, enum class ES_AttackEvent attackEvent); // Function Scavenger.S_CharacterBase.OnAttackEvent // (Native|Protected) // @ game+0xffff8008e4a10000
	void OnAttack_BP(enum class ES_WeaponSlot weaponSlot, enum class ES_TriggerType triggerType, enum class ES_AttackEvent attackEvent); // Function Scavenger.S_CharacterBase.OnAttack_BP // (Event|Public|BlueprintEvent) // @ game+0xffff8008e4a10000
	void NotifyTerminalBy_BP(struct FS_EventParameterControllerVariant TerminatingController, struct FS_ActorTerminalParameters ActorTerminalParameters); // Function Scavenger.S_CharacterBase.NotifyTerminalBy_BP // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xffff8008e4a10000
	void NotifyStatsStateChangedBy_BP(struct FS_EventParameterControllerVariant ChangeCausingController, enum class ES_StatsState OldState, enum class ES_StatsState NewState, struct FS_ActorStatsStateChangedParameters ActorStatsStateChangedParameters); // Function Scavenger.S_CharacterBase.NotifyStatsStateChangedBy_BP // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xffff8008e4a10000
	void NotifySeatExited_BP(struct USC_Seat* Seat); // Function Scavenger.S_CharacterBase.NotifySeatExited_BP // (Event|Public|BlueprintEvent) // @ game+0xffff8008e4a10000
	void NotifySeatEntered_BP(struct USC_Seat* Seat); // Function Scavenger.S_CharacterBase.NotifySeatEntered_BP // (Event|Public|BlueprintEvent) // @ game+0xffff8008e4a10000
	void NotifyRevivedBy_BP(struct FS_EventParameterControllerVariant revivingController); // Function Scavenger.S_CharacterBase.NotifyRevivedBy_BP // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xffff8008e4a10000
	void NotifyResurrectedBy_BP(struct FS_EventParameterControllerVariant resurrectingController); // Function Scavenger.S_CharacterBase.NotifyResurrectedBy_BP // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xffff8008e4a10000
	void NotifyReplicatedSelfDestructMontage(); // Function Scavenger.S_CharacterBase.NotifyReplicatedSelfDestructMontage // (Final|Native|Protected) // @ game+0xffff8008e4a10000
	void NotifyReplicatedMontageState(); // Function Scavenger.S_CharacterBase.NotifyReplicatedMontageState // (Final|Native|Private) // @ game+0xffff8008e4a10000
	void NotifyReplicatedExecutor_BP(); // Function Scavenger.S_CharacterBase.NotifyReplicatedExecutor_BP // (Event|Protected|BlueprintEvent) // @ game+0xffff8008e4a10000
	void NotifyReplicatedExecutor(); // Function Scavenger.S_CharacterBase.NotifyReplicatedExecutor // (Final|Native|Protected) // @ game+0xffff8008e4a10000
	void NotifyReplicatedExecutionTarget_BP(); // Function Scavenger.S_CharacterBase.NotifyReplicatedExecutionTarget_BP // (Event|Protected|BlueprintEvent) // @ game+0xffff8008e4a10000
	void NotifyReplicatedExecutionTarget(); // Function Scavenger.S_CharacterBase.NotifyReplicatedExecutionTarget // (Final|Native|Protected) // @ game+0xffff8008e4a10000
	void NotifyReplicatedEquipmentState(); // Function Scavenger.S_CharacterBase.NotifyReplicatedEquipmentState // (Final|Native|Public) // @ game+0xffff8008e4a10000
	void NotifyReplicatedCharacterCosmeticLoadout(); // Function Scavenger.S_CharacterBase.NotifyReplicatedCharacterCosmeticLoadout // (Final|Native|Protected) // @ game+0xffff8008e4a10000
	void NotifyReplicatedADSIsActive(); // Function Scavenger.S_CharacterBase.NotifyReplicatedADSIsActive // (Final|Native|Public) // @ game+0xffff8008e4a10000
	void NotifyReplicatedAccountCosmeticLoadout(); // Function Scavenger.S_CharacterBase.NotifyReplicatedAccountCosmeticLoadout // (Final|Native|Protected) // @ game+0xffff8008e4a10000
	void NotifyPredictivelyKilled(struct AController* PredictiveInstigator, float DamageAmount, struct FDamageEvent DamageEvent, struct AActor* CauseActor, bool bIsCritical); // Function Scavenger.S_CharacterBase.NotifyPredictivelyKilled // (Final|Native|Public|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyPostExecutionRagdoll(); // Function Scavenger.S_CharacterBase.NotifyPostExecutionRagdoll // (Final|Native|Public) // @ game+0xffff8008e4a10000
	void NotifyKilledInCocoon_BP(struct FS_PlayerKilledInCocoonParameters PlayerKilledInCocoonParameters); // Function Scavenger.S_CharacterBase.NotifyKilledInCocoon_BP // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xffff8008e4a10000
	void NotifyKilledBy_BP(struct FS_EventParameterControllerVariant KillingController); // Function Scavenger.S_CharacterBase.NotifyKilledBy_BP // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xffff8008e4a10000
	void NotifyItemUsed_BP(struct FS_ItemState ItemState); // Function Scavenger.S_CharacterBase.NotifyItemUsed_BP // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xffff8008e4a10000
	void NotifyItemUnequipped_BP(enum class ES_EquipmentSlot EquipmentSlot, struct FS_ItemState ItemState); // Function Scavenger.S_CharacterBase.NotifyItemUnequipped_BP // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xffff8008e4a10000
	void NotifyItemEquipped_BP(enum class ES_EquipmentSlot EquipmentSlot, struct FS_ItemState ItemState); // Function Scavenger.S_CharacterBase.NotifyItemEquipped_BP // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xffff8008e4a10000
	void NotifyItemDropped_BP(struct FS_ItemState ItemState, struct FS_EventParameterVariant ItemPickup); // Function Scavenger.S_CharacterBase.NotifyItemDropped_BP // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xffff8008e4a10000
	void NotifyItemDestroyed_BP(struct FS_ItemState ItemState); // Function Scavenger.S_CharacterBase.NotifyItemDestroyed_BP // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xffff8008e4a10000
	void NotifyItemAcquired_BP(struct FS_ItemState ItemState); // Function Scavenger.S_CharacterBase.NotifyItemAcquired_BP // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xffff8008e4a10000
	void NotifyIsInStormCategory(); // Function Scavenger.S_CharacterBase.NotifyIsInStormCategory // (Final|Native|Protected) // @ game+0xffff8008e4a10000
	void NotifyFreedFromCocoon_BP(struct FS_PlayerFreedFromCocoonParameters PlayerFreedFromCocoonParameters); // Function Scavenger.S_CharacterBase.NotifyFreedFromCocoon_BP // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xffff8008e4a10000
	void NotifyExtracting_BP(struct FS_PlayerExtractingParameters PlayerExtractingParameters); // Function Scavenger.S_CharacterBase.NotifyExtracting_BP // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xffff8008e4a10000
	void NotifyExtracted_BP(struct FS_PlayerExtractedParameters PlayerExtractedParameters); // Function Scavenger.S_CharacterBase.NotifyExtracted_BP // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xffff8008e4a10000
	void NotifyDownedBy_BP(struct FS_EventParameterControllerVariant DowningController, struct FS_ActorDownedParameters ActorDownedParameters); // Function Scavenger.S_CharacterBase.NotifyDownedBy_BP // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xffff8008e4a10000
	void NotifyDamagedBy_BP(struct FS_EventParameterControllerVariant DamagingController, float DamageDealt); // Function Scavenger.S_CharacterBase.NotifyDamagedBy_BP // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xffff8008e4a10000
	void NotifyCosmeticLoadoutChanged_BP(); // Function Scavenger.S_CharacterBase.NotifyCosmeticLoadoutChanged_BP // (Event|Protected|BlueprintEvent) // @ game+0xffff8008e4a10000
	void NotifyControllerChanged_BP(struct AController* OldController, struct AController* NewController); // Function Scavenger.S_CharacterBase.NotifyControllerChanged_BP // (Event|Public|BlueprintEvent) // @ game+0xffff8008e4a10000
	void NotifyCocooned_BP(struct FS_PlayerCocoonedParameters PlayerCocoonedParameters); // Function Scavenger.S_CharacterBase.NotifyCocooned_BP // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xffff8008e4a10000
	void NotifyBoneLeftSnow_BP(struct FName BoneName, struct FVector GroundPosition, float SnowHeight, struct UPhysicalMaterial* PhysicalMaterial); // Function Scavenger.S_CharacterBase.NotifyBoneLeftSnow_BP // (Event|Public|HasOutParms|HasDefaults|BlueprintEvent) // @ game+0xffff8008e4a10000
	void NotifyBoneEnteredSnow_BP(struct FName BoneName, struct FVector GroundPosition, float SnowHeight, struct UPhysicalMaterial* PhysicalMaterial); // Function Scavenger.S_CharacterBase.NotifyBoneEnteredSnow_BP // (Event|Public|HasOutParms|HasDefaults|BlueprintEvent) // @ game+0xffff8008e4a10000
	void MulticastTakePointDamageBatch(struct TArray<struct FS_PointDamageMulticast> multiCastEvents); // Function Scavenger.S_CharacterBase.MulticastTakePointDamageBatch // (Net|Native|Event|NetMulticast|Public|NetValidate) // @ game+0xffff8008e4a10000
	void MulticastTakePointDamage(float DamageAmount, struct FS_PointDamageEvent PointDamageEvent, struct APawn* instigatorPawn, struct AActor* CauseActor, enum class ES_TriggerType triggerType); // Function Scavenger.S_CharacterBase.MulticastTakePointDamage // (Net|Native|Event|NetMulticast|Public|NetValidate) // @ game+0xffff8008e4a10000
	void MulticastInterruptEmote(); // Function Scavenger.S_CharacterBase.MulticastInterruptEmote // (Net|Native|Event|NetMulticast|Protected|NetValidate) // @ game+0xffff8008e4a10000
	void MulticastDoEmote(struct FName emoteNameId); // Function Scavenger.S_CharacterBase.MulticastDoEmote // (Net|Native|Event|NetMulticast|Protected|NetValidate) // @ game+0xffff8008e4a10000
	bool IsWeaponAttacking(); // Function Scavenger.S_CharacterBase.IsWeaponAttacking // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool IsTriggerHeld(enum class ES_WeaponSlot weaponSlot, enum class ES_TriggerType Trigger); // Function Scavenger.S_CharacterBase.IsTriggerHeld // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool IsThrowingGrenade(); // Function Scavenger.S_CharacterBase.IsThrowingGrenade // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool IsTargetableByAI(); // Function Scavenger.S_CharacterBase.IsTargetableByAI // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool IsStunned(); // Function Scavenger.S_CharacterBase.IsStunned // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool IsSprinting(); // Function Scavenger.S_CharacterBase.IsSprinting // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool IsReloading(); // Function Scavenger.S_CharacterBase.IsReloading // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool IsNextToHeatSource(); // Function Scavenger.S_CharacterBase.IsNextToHeatSource // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool IsMantling(); // Function Scavenger.S_CharacterBase.IsMantling // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool IsJumping(); // Function Scavenger.S_CharacterBase.IsJumping // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool IsExhausted(); // Function Scavenger.S_CharacterBase.IsExhausted // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool IsExecuting(); // Function Scavenger.S_CharacterBase.IsExecuting // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool IsDowned(); // Function Scavenger.S_CharacterBase.IsDowned // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool IsDoingEmote(); // Function Scavenger.S_CharacterBase.IsDoingEmote // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool IsDodging(); // Function Scavenger.S_CharacterBase.IsDodging // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool IsDead(); // Function Scavenger.S_CharacterBase.IsDead // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool IsCrouching(); // Function Scavenger.S_CharacterBase.IsCrouching // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool IsCloaked(); // Function Scavenger.S_CharacterBase.IsCloaked // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool IsBeingExecuted(); // Function Scavenger.S_CharacterBase.IsBeingExecuted // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool IsAttacking(); // Function Scavenger.S_CharacterBase.IsAttacking // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool IsAnyMontagePlaying(); // Function Scavenger.S_CharacterBase.IsAnyMontagePlaying // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool IsAlive(); // Function Scavenger.S_CharacterBase.IsAlive // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool IsActuallyDead(); // Function Scavenger.S_CharacterBase.IsActuallyDead // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool IsActuallyAlive(); // Function Scavenger.S_CharacterBase.IsActuallyAlive // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	void IncrementNotAITargetableCounter(); // Function Scavenger.S_CharacterBase.IncrementNotAITargetableCounter // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool HasStaminaForAttack(enum class ES_WeaponSlot weaponSlot, enum class ES_TriggerType triggerType); // Function Scavenger.S_CharacterBase.HasStaminaForAttack // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool HasAnyWeaponEquipped(); // Function Scavenger.S_CharacterBase.HasAnyWeaponEquipped // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	void HandleCharacterCosmeticLoadoutChanged(); // Function Scavenger.S_CharacterBase.HandleCharacterCosmeticLoadoutChanged // (Native|Protected) // @ game+0xffff8008e4a10000
	void HandleAccountCosmeticLoadoutChanged(); // Function Scavenger.S_CharacterBase.HandleAccountCosmeticLoadoutChanged // (Native|Protected) // @ game+0xffff8008e4a10000
	struct FTransform GetWSBoneTransformFromBoneName(struct FName Name); // Function Scavenger.S_CharacterBase.GetWSBoneTransformFromBoneName // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	enum class ES_WeaponSlotState GetWeaponSlotState(enum class ES_WeaponSlot weaponSlot); // Function Scavenger.S_CharacterBase.GetWeaponSlotState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct AS_WeaponBase* GetWeaponBySlot(enum class ES_WeaponSlot weaponSlot); // Function Scavenger.S_CharacterBase.GetWeaponBySlot // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct AS_VehiclePawn* GetVehicle(); // Function Scavenger.S_CharacterBase.GetVehicle // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct FScavengerTeamID GetTeamInfo(); // Function Scavenger.S_CharacterBase.GetTeamInfo // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	void GetTeamAttitudeTowards_BP(struct AActor* Other, bool IsFriendly, bool IsNeutral, bool IsHostile); // Function Scavenger.S_CharacterBase.GetTeamAttitudeTowards_BP // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	struct US_SpottingComponent* GetSpottingComponent(); // Function Scavenger.S_CharacterBase.GetSpottingComponent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	enum class ES_WeaponSlot GetSlotByWeapon(struct AS_WeaponBase* weapon); // Function Scavenger.S_CharacterBase.GetSlotByWeapon // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct US_ShieldComponent* GetShieldComponent(); // Function Scavenger.S_CharacterBase.GetShieldComponent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	enum class ES_SeatType GetSeatType(); // Function Scavenger.S_CharacterBase.GetSeatType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct USC_Seat* GetSeat(); // Function Scavenger.S_CharacterBase.GetSeat // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	enum class ES_ScavAITeams GetScavengerTeam(); // Function Scavenger.S_CharacterBase.GetScavengerTeam // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	float GetPawnRemoteViewPitch(); // Function Scavenger.S_CharacterBase.GetPawnRemoteViewPitch // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	void GetOwnedGameplayTags(struct FGameplayTagContainer TagContainer); // Function Scavenger.S_CharacterBase.GetOwnedGameplayTags // (Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool GetMontageCollectionByTableKey_BP(struct FName MontageKey, struct TArray<struct UAnimMontage*> OutMontageCollection); // Function Scavenger.S_CharacterBase.GetMontageCollectionByTableKey_BP // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct UAnimMontage* GetMontageByTableIndex(struct FS_MontageCatalogueIndex Index); // Function Scavenger.S_CharacterBase.GetMontageByTableIndex // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct US_ManagedSoundBankComponent* GetManagedSoundBankComponent(); // Function Scavenger.S_CharacterBase.GetManagedSoundBankComponent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct FVector GetLastRawMovementInputVector(); // Function Scavenger.S_CharacterBase.GetLastRawMovementInputVector // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool GetIsPassenger(); // Function Scavenger.S_CharacterBase.GetIsPassenger // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool GetIsLaunched(); // Function Scavenger.S_CharacterBase.GetIsLaunched // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	enum class ES_StormCategory GetIsInStormCategory(); // Function Scavenger.S_CharacterBase.GetIsInStormCategory // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0xffff8008e4a10000
	bool GetIsInStorm(); // Function Scavenger.S_CharacterBase.GetIsInStorm // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool GetIsInSmoke(); // Function Scavenger.S_CharacterBase.GetIsInSmoke // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool GetIsDriver(); // Function Scavenger.S_CharacterBase.GetIsDriver // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct AActor* GetEquipmentBySlot(enum class ES_EquipmentSlot EquipmentSlot); // Function Scavenger.S_CharacterBase.GetEquipmentBySlot // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct FText GetDisplayName(); // Function Scavenger.S_CharacterBase.GetDisplayName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct FRotator GetDesiredSeatedRotation(struct FRotator AimRotation, int32_t outSnapIndex); // Function Scavenger.S_CharacterBase.GetDesiredSeatedRotation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	enum class ES_DerivedCharacterBaseState GetDerivedBaseState(); // Function Scavenger.S_CharacterBase.GetDerivedBaseState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	float GetDamageRecievedFromCharacters(); // Function Scavenger.S_CharacterBase.GetDamageRecievedFromCharacters // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	float GetDamageDoneToCharacters(); // Function Scavenger.S_CharacterBase.GetDamageDoneToCharacters // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	enum class ES_WeaponSlot GetCurrentWeaponSlot(); // Function Scavenger.S_CharacterBase.GetCurrentWeaponSlot // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct AS_WeaponBase* GetCurrentWeapon(); // Function Scavenger.S_CharacterBase.GetCurrentWeapon // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct US_CosmeticSkinningComponent* GetCosmeticSkinningComponent(); // Function Scavenger.S_CharacterBase.GetCosmeticSkinningComponent // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0xffff8008e4a10000
	bool GetControlRotationLocked(); // Function Scavenger.S_CharacterBase.GetControlRotationLocked // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	void GetControllerToActorRotation_BP(float outYaw, float outPitch, float outRoll); // Function Scavenger.S_CharacterBase.GetControllerToActorRotation_BP // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	struct FS_CosmeticLoadout GetCharacterCosmeticLoadout(); // Function Scavenger.S_CharacterBase.GetCharacterCosmeticLoadout // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct UMeshComponent* GetBackpackMesh(); // Function Scavenger.S_CharacterBase.GetBackpackMesh // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	int32_t GetAmmoCount(enum class ES_AmmoType AmmoType); // Function Scavenger.S_CharacterBase.GetAmmoCount // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	void GetAimScreenPitchYaw_BP(float outPitch, float outYaw, bool clampTo90); // Function Scavenger.S_CharacterBase.GetAimScreenPitchYaw_BP // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	enum class ES_CharacterBodyStance GetActiveBodyStance(); // Function Scavenger.S_CharacterBase.GetActiveBodyStance // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct FS_CosmeticLoadout GetAccountCosmeticLoadout(); // Function Scavenger.S_CharacterBase.GetAccountCosmeticLoadout // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct US_AbilitySystemComponent* GetAbilitySystemComponent_BP(); // Function Scavenger.S_CharacterBase.GetAbilitySystemComponent_BP // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool ExecuteCharacter(struct AS_CharacterBase* Target); // Function Scavenger.S_CharacterBase.ExecuteCharacter // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void EventTerminalBy(struct FS_EventParameterControllerVariant TerminatingController, struct FS_ActorTerminalParameters ActorTerminalParameters); // Function Scavenger.S_CharacterBase.EventTerminalBy // (Net|NetReliableNative|Event|Public) // @ game+0xffff8008e4a10000
	void EventStatsStateChangedBy(struct FS_EventParameterControllerVariant ChangeCausingController, enum class ES_StatsState OldState, enum class ES_StatsState NewState, struct FS_ActorStatsStateChangedParameters ActorStatsStateChangedParameters); // Function Scavenger.S_CharacterBase.EventStatsStateChangedBy // (Net|NetReliableNative|Event|Public) // @ game+0xffff8008e4a10000
	void EventRevivedBy(struct FS_EventParameterControllerVariant revivingController); // Function Scavenger.S_CharacterBase.EventRevivedBy // (Net|NetReliableNative|Event|Public) // @ game+0xffff8008e4a10000
	void EventResurrectedBy(struct FS_EventParameterControllerVariant resurrectingController); // Function Scavenger.S_CharacterBase.EventResurrectedBy // (Net|NetReliableNative|Event|Public) // @ game+0xffff8008e4a10000
	void EventKilledInCocoon(struct FS_PlayerKilledInCocoonParameters PlayerKilledInCocoonParameters); // Function Scavenger.S_CharacterBase.EventKilledInCocoon // (Net|NetReliableNative|Event|Public) // @ game+0xffff8008e4a10000
	void EventKilledBy(struct FS_EventParameterControllerVariant KillingController); // Function Scavenger.S_CharacterBase.EventKilledBy // (Net|NetReliableNative|Event|Public) // @ game+0xffff8008e4a10000
	void EventItemUsed(struct FS_ItemState ItemState); // Function Scavenger.S_CharacterBase.EventItemUsed // (Net|NetReliableNative|Event|Public) // @ game+0xffff8008e4a10000
	void EventItemUnequipped(enum class ES_EquipmentSlot EquipmentSlot, struct FS_ItemState ItemState); // Function Scavenger.S_CharacterBase.EventItemUnequipped // (Net|NetReliableNative|Event|Public) // @ game+0xffff8008e4a10000
	void EventItemEquipped(enum class ES_EquipmentSlot EquipmentSlot, struct FS_ItemState ItemState); // Function Scavenger.S_CharacterBase.EventItemEquipped // (Net|NetReliableNative|Event|Public) // @ game+0xffff8008e4a10000
	void EventItemDropped(struct FS_ItemState ItemState, struct FS_EventParameterVariant ItemPickup); // Function Scavenger.S_CharacterBase.EventItemDropped // (Net|NetReliableNative|Event|Public) // @ game+0xffff8008e4a10000
	void EventItemDestroyed(struct FS_ItemState ItemState); // Function Scavenger.S_CharacterBase.EventItemDestroyed // (Net|NetReliableNative|Event|Public) // @ game+0xffff8008e4a10000
	void EventItemAcquired(struct FS_ItemState ItemState); // Function Scavenger.S_CharacterBase.EventItemAcquired // (Net|NetReliableNative|Event|Public) // @ game+0xffff8008e4a10000
	void EventFreedFromCocoon(struct FS_PlayerFreedFromCocoonParameters PlayerFreedFromCocoonParameters); // Function Scavenger.S_CharacterBase.EventFreedFromCocoon // (Net|NetReliableNative|Event|Public) // @ game+0xffff8008e4a10000
	void EventExtracting(struct FS_PlayerExtractingParameters PlayerExtractingParameters); // Function Scavenger.S_CharacterBase.EventExtracting // (Net|NetReliableNative|Event|Public) // @ game+0xffff8008e4a10000
	void EventExtracted(struct FS_PlayerExtractedParameters PlayerExtractedParameters); // Function Scavenger.S_CharacterBase.EventExtracted // (Net|NetReliableNative|Event|Public) // @ game+0xffff8008e4a10000
	void EventDownedBy(struct FS_EventParameterControllerVariant DowningController, struct FS_ActorDownedParameters ActorDownedParameters); // Function Scavenger.S_CharacterBase.EventDownedBy // (Net|NetReliableNative|Event|Public) // @ game+0xffff8008e4a10000
	void EventDamagedBy(struct FS_EventParameterControllerVariant DamagingController, float DamageDealt); // Function Scavenger.S_CharacterBase.EventDamagedBy // (Net|NetReliableNative|Event|Public) // @ game+0xffff8008e4a10000
	void EventCocooned(struct FS_PlayerCocoonedParameters PlayerCocoonedParameters); // Function Scavenger.S_CharacterBase.EventCocooned // (Net|NetReliableNative|Event|Public) // @ game+0xffff8008e4a10000
	void EnterRagdoll(); // Function Scavenger.S_CharacterBase.EnterRagdoll // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void EndExecution(struct UAnimMontage* Montage, bool Interrupted, int32_t montageInstanceID); // Function Scavenger.S_CharacterBase.EndExecution // (Native|Protected) // @ game+0xffff8008e4a10000
	void DropEquippedWeapon(enum class ES_WeaponSlot weaponSlot); // Function Scavenger.S_CharacterBase.DropEquippedWeapon // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void DropAllEquippedWeapons(); // Function Scavenger.S_CharacterBase.DropAllEquippedWeapons // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void DirtyCharacterSkin(); // Function Scavenger.S_CharacterBase.DirtyCharacterSkin // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void DirtyBackpackSkin(); // Function Scavenger.S_CharacterBase.DirtyBackpackSkin // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void DirtyAllSkins(); // Function Scavenger.S_CharacterBase.DirtyAllSkins // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void DestroyAllEquippedWeapons(); // Function Scavenger.S_CharacterBase.DestroyAllEquippedWeapons // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void DecrementNotAITargetableCounter(); // Function Scavenger.S_CharacterBase.DecrementNotAITargetableCounter // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void DeactivateADS(); // Function Scavenger.S_CharacterBase.DeactivateADS // (Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool CycleCurrentWeapon(enum class ES_CycleDirection cycleDirection); // Function Scavenger.S_CharacterBase.CycleCurrentWeapon // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void CustomizationSetBackpackMeshLazy(struct TSoftObjectPtr<struct USkeletalMesh> newBackpackMesh); // Function Scavenger.S_CharacterBase.CustomizationSetBackpackMeshLazy // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	void CustomizationSetActiveMeshLazy(struct TSoftObjectPtr<struct USkeletalMesh> NewActiveMesh); // Function Scavenger.S_CharacterBase.CustomizationSetActiveMeshLazy // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool CustomizationIsMeshLoadPending(); // Function Scavenger.S_CharacterBase.CustomizationIsMeshLoadPending // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	void CrouchOnRevivingStarted(); // Function Scavenger.S_CharacterBase.CrouchOnRevivingStarted // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void CrossServerTakePoiseDamage(float PoiseDamageAmount, struct FHitResult HitResult, struct US_DamageTypeBase* DamageType); // Function Scavenger.S_CharacterBase.CrossServerTakePoiseDamage // (Net|NetReliableNative|Event|Public) // @ game+0xffff8008e4a10000
	void CrossServerLaunchCharacter(struct FVector LaunchVelocity, bool bXYOverride, bool bZOverride); // Function Scavenger.S_CharacterBase.CrossServerLaunchCharacter // (Net|NetReliableNative|Event|Public|HasDefaults) // @ game+0xffff8008e4a10000
	int32_t ConsumeAmmo(enum class ES_AmmoType AmmoType, int32_t amountToConsume); // Function Scavenger.S_CharacterBase.ConsumeAmmo // (Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void ClearLookAtPosition(); // Function Scavenger.S_CharacterBase.ClearLookAtPosition // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void CharacterMeshLoadFinished(); // Function Scavenger.S_CharacterBase.CharacterMeshLoadFinished // (Final|Native|Private) // @ game+0xffff8008e4a10000
	void CharacterBase_OnTerminalCallback(struct US_StatsComponent* StatsComponent, enum class ES_StatsState OldState, enum class ES_StatsState NewState); // Function Scavenger.S_CharacterBase.CharacterBase_OnTerminalCallback // (Final|Native|Protected) // @ game+0xffff8008e4a10000
	void CharacterBase_OnSimpleStatChange(enum class ES_StatType StatType, float OldStatValue, float StatValueChange, float NewStatValue); // Function Scavenger.S_CharacterBase.CharacterBase_OnSimpleStatChange // (Final|Native|Protected) // @ game+0xffff8008e4a10000
	void CharacterBase_OnDiedCallback(struct US_StatsComponent* StatsComponent, enum class ES_StatsState OldState, enum class ES_StatsState NewState); // Function Scavenger.S_CharacterBase.CharacterBase_OnDiedCallback // (Final|Native|Protected) // @ game+0xffff8008e4a10000
	void CharacterBase_OnBoneHitCallback(struct FBoneHitInfo BoneHitInfo, struct FS_PointDamageEvent PointDamageEvent, float DamageAmount); // Function Scavenger.S_CharacterBase.CharacterBase_OnBoneHitCallback // (Final|Native|Protected|HasOutParms) // @ game+0xffff8008e4a10000
	void Character_OnRepMontageStartedCallback(); // Function Scavenger.S_CharacterBase.Character_OnRepMontageStartedCallback // (Final|Native|Public) // @ game+0xffff8008e4a10000
	void Character_OnRepMontageInterruptedCallback(); // Function Scavenger.S_CharacterBase.Character_OnRepMontageInterruptedCallback // (Final|Native|Public) // @ game+0xffff8008e4a10000
	void Character_OnRepMontageCompletedCallback(); // Function Scavenger.S_CharacterBase.Character_OnRepMontageCompletedCallback // (Final|Native|Public) // @ game+0xffff8008e4a10000
	void CancelReloading(); // Function Scavenger.S_CharacterBase.CancelReloading // (Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool CancelExecution(); // Function Scavenger.S_CharacterBase.CancelExecution // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool CanBeExecuted(); // Function Scavenger.S_CharacterBase.CanBeExecuted // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	void BackpackMeshLoadFinished(); // Function Scavenger.S_CharacterBase.BackpackMeshLoadFinished // (Final|Native|Private) // @ game+0xffff8008e4a10000
	bool AnyMontageExistsForKey(struct FName MontageKey); // Function Scavenger.S_CharacterBase.AnyMontageExistsForKey // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool ADSIsActive(); // Function Scavenger.S_CharacterBase.ADSIsActive // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	void ActivateADS(); // Function Scavenger.S_CharacterBase.ActivateADS // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_AICharacter
// Size: 0x2650 (Inherited: 0x2220)
struct AS_AICharacter : AS_CharacterBase {
	char pad_2220[0x8]; // 0x2220(0x08)
	struct FColor sphereColor; // 0x2228(0x04)
	float MeleeAttackForwardScalar; // 0x222c(0x04)
	struct FMulticastInlineDelegate OnCurrentTargetChanged; // 0x2230(0x10)
	struct FMulticastInlineDelegate OnNearbyGrenadeDetected; // 0x2240(0x10)
	struct US_ItemData* InitialEquippedItemDataOverride[0x11]; // 0x2250(0x88)
	bool CanDynamicallyChangeRankTuning; // 0x22d8(0x01)
	char pad_22D9[0x3]; // 0x22d9(0x03)
	int32_t RankTuningAdjustment; // 0x22dc(0x04)
	char pad_22E0[0x4]; // 0x22e0(0x04)
	int32_t RankTuning; // 0x22e4(0x04)
	int32_t RankId; // 0x22e8(0x04)
	enum class ES_KillExperienceTier KillExperienceTier; // 0x22ec(0x01)
	bool IsElite; // 0x22ed(0x01)
	bool IsCheap; // 0x22ee(0x01)
	bool IsMeleeOnlyCharacter; // 0x22ef(0x01)
	float HelmetVitality; // 0x22f0(0x04)
	bool bHelmetShattered; // 0x22f4(0x01)
	char pad_22F5[0x3]; // 0x22f5(0x03)
	struct UParticleSystem* HelmetShatterFX; // 0x22f8(0x08)
	struct FVector HeadHitLocation; // 0x2300(0x0c)
	float ForwardOriginOffset; // 0x230c(0x04)
	struct US_AIAudioComponent* AudioComponentAI; // 0x2310(0x08)
	bool ShouldOverrideTargetThreatWeights; // 0x2318(0x01)
	char pad_2319[0x3]; // 0x2319(0x03)
	struct FS_AITargetingWeights AITargetThreatWeightOverrides; // 0x231c(0x20)
	float MinimumTargetSwitchCooldown; // 0x233c(0x04)
	enum class ES_AIAlertState AIAlertState; // 0x2340(0x01)
	char pad_2341[0x3]; // 0x2341(0x03)
	float AIAlertStatePercentage; // 0x2344(0x04)
	char m_replicatedAlertStatePercent; // 0x2348(0x01)
	char pad_2349[0x7]; // 0x2349(0x07)
	struct UGameplayEffect* HardPingEffect; // 0x2350(0x08)
	float HardPingOverrideDuration; // 0x2358(0x04)
	bool DisableHardPings; // 0x235c(0x01)
	char pad_235D[0x3]; // 0x235d(0x03)
	struct FName DefaultShotRightKey; // 0x2360(0x08)
	struct FName DefaultShotLeftKey; // 0x2368(0x08)
	struct FName DefaultShotForwardsKey; // 0x2370(0x08)
	struct FName DefaultShotBackwardsKey; // 0x2378(0x08)
	struct FName DefaultMeleeRightKey; // 0x2380(0x08)
	struct FName DefaultMeleeLeftKey; // 0x2388(0x08)
	struct FName DefaultMeleeForwardsKey; // 0x2390(0x08)
	struct FName DefaultMeleeBackwardsKey; // 0x2398(0x08)
	struct FName DefaultExplosionForwardsKey; // 0x23a0(0x08)
	struct FName DefaultExplosionBackwardsKey; // 0x23a8(0x08)
	struct FName DefaultExplosionAirForwardsKey; // 0x23b0(0x08)
	struct FName DefaultExplosionAirBackwardsKey; // 0x23b8(0x08)
	struct UDataTable* DirectionlessHardpingResponseTable; // 0x23c0(0x08)
	bool CalculatePathFindingSpineBend; // 0x23c8(0x01)
	bool CalculateVelocitySpineBend; // 0x23c9(0x01)
	char pad_23CA[0x2]; // 0x23ca(0x02)
	float SpineBendInDegrees; // 0x23cc(0x04)
	float m_replicatedSpineBend; // 0x23d0(0x04)
	float SpineBendRate; // 0x23d4(0x04)
	float SpineBendMaxAngleInDegrees; // 0x23d8(0x04)
	float SpineBendDistanceThreshold; // 0x23dc(0x04)
	float SpineBendPathAngleFactor; // 0x23e0(0x04)
	bool CalculateHeadLookWhilePathFinding; // 0x23e4(0x01)
	char pad_23E5[0x3]; // 0x23e5(0x03)
	float PathfindingHeadLookPitchInDegrees; // 0x23e8(0x04)
	float m_replicatedHeadLookPitch; // 0x23ec(0x04)
	float PathfindingHeadLookYawInDegrees; // 0x23f0(0x04)
	float m_replicatedHeadLookYaw; // 0x23f4(0x04)
	float MaxHeadLookWhilePathFindingDistance; // 0x23f8(0x04)
	float MinHeadLookWhilePathFindingDistance; // 0x23fc(0x04)
	float MaxPathfindingHeadLookYawInDegrees; // 0x2400(0x04)
	float MaxPathfindingHeadLookPitchInDegrees; // 0x2404(0x04)
	float PathFindingHeadLookRate; // 0x2408(0x04)
	float CheckForValidNavmeshFrequencyInSeconds; // 0x240c(0x04)
	char pad_2410[0x18]; // 0x2410(0x18)
	struct UAnimMontage* m_currentPingMontage; // 0x2428(0x08)
	struct AS_AISpawner* m_spawner; // 0x2430(0x08)
	char pad_2438[0x8]; // 0x2438(0x08)
	struct AActor* m_spawnOnDeathActorClass; // 0x2440(0x08)
	float TileGenerationRadius; // 0x2448(0x04)
	float TileRemovalRadius; // 0x244c(0x04)
	struct FVector m_spawnOnDeathActorOffset; // 0x2450(0x0c)
	char pad_245C[0x4]; // 0x245c(0x04)
	struct FS_LootDescriptor LootDescriptor; // 0x2460(0x28)
	struct US_LootComponent* LootComponent; // 0x2488(0x08)
	struct FS_LootSpawnSettings LootSpawnSettings; // 0x2490(0x30)
	enum class ES_AILocomotionState m_currentAILocomotionState; // 0x24c0(0x01)
	char pad_24C1[0x7]; // 0x24c1(0x07)
	struct USC_CollisionDamageReciver* CollisionDamageReciver; // 0x24c8(0x08)
	struct TArray<struct FS_DebugAIData> m_debugAIData; // 0x24d0(0x10)
	char pad_24E0[0x8]; // 0x24e0(0x08)
	struct TArray<struct FS_DebugAIHitData> m_debugHitTargetData; // 0x24e8(0x10)
	char m_remotePerceptionYaw; // 0x24f8(0x01)
	char pad_24F9[0xf]; // 0x24f9(0x0f)
	float SpreadModifierResetTimer; // 0x2508(0x04)
	char pad_250C[0x4]; // 0x250c(0x04)
	float SpreadModifierResetAmountOnDamage; // 0x2510(0x04)
	float SpreadModifierResetOnOldTargetAge; // 0x2514(0x04)
	float TargetFireAtOffsetScale; // 0x2518(0x04)
	char pad_251C[0x1]; // 0x251c(0x01)
	bool bEnableClientSideNavWalkingPhysics; // 0x251d(0x01)
	char pad_251E[0xa]; // 0x251e(0x0a)
	struct AS_CharacterBase* CurrentTarget; // 0x2528(0x08)
	struct TWeakObjectPtr<struct AS_AICharacter> m_MostRecentAIToDamageMe; // 0x2530(0x08)
	char pad_2538[0x8]; // 0x2538(0x08)
	struct AS_CharacterBase* AIMaster; // 0x2540(0x08)
	float DistanceToCurrentTargetLKP; // 0x2548(0x04)
	struct FName AssociatedChallengeIdentifier; // 0x254c(0x08)
	char pad_2554[0x9c]; // 0x2554(0x9c)
	int32_t m_AIIndex; // 0x25f0(0x04)
	char pad_25F4[0xc]; // 0x25f4(0x0c)
	struct AS_WeaponTriggerableAttachment* GrenadeWeaponAttachment; // 0x2600(0x08)
	char pad_2608[0x20]; // 0x2608(0x20)
	struct US_LerpToAction* m_lerpToLocationAction; // 0x2628(0x08)
	char pad_2630[0x10]; // 0x2630(0x10)
	struct AS_AIController* m_playerBotController; // 0x2640(0x08)
	bool m_isHumanControlled; // 0x2648(0x01)
	bool m_isServerPlayerBot; // 0x2649(0x01)
	char pad_264A[0x1]; // 0x264a(0x01)
	bool IsInvisibleToAI; // 0x264b(0x01)
	bool bDrawOutline; // 0x264c(0x01)
	char pad_264D[0x3]; // 0x264d(0x03)

	void UnReserveReservedAIPoint(); // Function Scavenger.S_AICharacter.UnReserveReservedAIPoint // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void TriggerPing(struct FS_MontageCatalogueIndex airMontageIndex); // Function Scavenger.S_AICharacter.TriggerPing // (Final|Native|Protected) // @ game+0xffff8008e4a10000
	void TriggerHardPingByTableKey(struct FName MontageKey); // Function Scavenger.S_AICharacter.TriggerHardPingByTableKey // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void TriggerHardPingByIndex(struct FS_MontageCatalogueIndex Index); // Function Scavenger.S_AICharacter.TriggerHardPingByIndex // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	void TriggerHardPing(struct UAnimMontage* Montage); // Function Scavenger.S_AICharacter.TriggerHardPing // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void TickFallingPing(struct FS_MontageCatalogueIndex airMontageIndex); // Function Scavenger.S_AICharacter.TickFallingPing // (Final|Native|Protected) // @ game+0xffff8008e4a10000
	void TargetChanged_BP(struct AS_CharacterBase* oldTarget, struct AS_CharacterBase* newTarget); // Function Scavenger.S_AICharacter.TargetChanged_BP // (Event|Public|BlueprintEvent) // @ game+0xffff8008e4a10000
	void StopJumpWithMantle(); // Function Scavenger.S_AICharacter.StopJumpWithMantle // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void StartJumpWithMantle(); // Function Scavenger.S_AICharacter.StartJumpWithMantle // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void StartCrouching(); // Function Scavenger.S_AICharacter.StartCrouching // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void SetLocomotionState(enum class ES_AILocomotionState newLocomotionState); // Function Scavenger.S_AICharacter.SetLocomotionState // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void SetAIMaster(struct AS_CharacterBase* Master); // Function Scavenger.S_AICharacter.SetAIMaster // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void SetAIIndex(int32_t newAIIndex); // Function Scavenger.S_AICharacter.SetAIIndex // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void ServerPlayerBotTestsToggleBoolBB(struct FName KeyName); // Function Scavenger.S_AICharacter.ServerPlayerBotTestsToggleBoolBB // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0xffff8008e4a10000
	void ServerPlayerBotTestsStop(); // Function Scavenger.S_AICharacter.ServerPlayerBotTestsStop // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0xffff8008e4a10000
	void ServerPlayerBotStopGathering(); // Function Scavenger.S_AICharacter.ServerPlayerBotStopGathering // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0xffff8008e4a10000
	void ServerPlayerBotGatherAtLocation(struct FVector gatherLocation, bool AndDisperse); // Function Scavenger.S_AICharacter.ServerPlayerBotGatherAtLocation // (Net|NetReliableNative|Event|Public|NetServer|HasDefaults) // @ game+0xffff8008e4a10000
	void ServerNotifyDebugTeleported(); // Function Scavenger.S_AICharacter.ServerNotifyDebugTeleported // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0xffff8008e4a10000
	void ScoringProducedValidAIPoint(enum class ES_ScavengerResult resultOut); // Function Scavenger.S_AICharacter.ScoringProducedValidAIPoint // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	void ReserveBestScoredAIPoint(enum class ES_ScavengerResult resultOut); // Function Scavenger.S_AICharacter.ReserveBestScoredAIPoint // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	void ReserveActiveAIPoint(enum class ES_ScavengerResult resultOut); // Function Scavenger.S_AICharacter.ReserveActiveAIPoint // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	void RequestTemporaryPhysWalking(bool needsPhysWalking, float timeOutDuration); // Function Scavenger.S_AICharacter.RequestTemporaryPhysWalking // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void PoiseZeroHardPing(struct FHitResult HitResult, enum class ES_PoiseDamageType dmgType); // Function Scavenger.S_AICharacter.PoiseZeroHardPing // (Final|Native|Protected|HasOutParms) // @ game+0xffff8008e4a10000
	void OnRep_HelmetShattered(); // Function Scavenger.S_AICharacter.OnRep_HelmetShattered // (Final|Native|Protected) // @ game+0xffff8008e4a10000
	void OnRep_CurrentTarget(); // Function Scavenger.S_AICharacter.OnRep_CurrentTarget // (Final|Native|Protected) // @ game+0xffff8008e4a10000
	void MoveReservedAIPointToActiveAIPoint(enum class ES_ScavengerResult resultOut); // Function Scavenger.S_AICharacter.MoveReservedAIPointToActiveAIPoint // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	void LockOutActiveAIPoint(enum class ES_ScavengerResult resultOut, float lockOutDurationInSeconds); // Function Scavenger.S_AICharacter.LockOutActiveAIPoint // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool IsTargetInVehicle(); // Function Scavenger.S_AICharacter.IsTargetInVehicle // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool IsOutlineOverridden(); // Function Scavenger.S_AICharacter.IsOutlineOverridden // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0xffff8008e4a10000
	bool IsHumanControlled(); // Function Scavenger.S_AICharacter.IsHumanControlled // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool IsCurrentTargetSensedBySight(float ageOut); // Function Scavenger.S_AICharacter.IsCurrentTargetSensedBySight // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0xffff8008e4a10000
	bool IsCurrentTargetSensedByHearing(float ageOut); // Function Scavenger.S_AICharacter.IsCurrentTargetSensedByHearing // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0xffff8008e4a10000
	bool IsCurrentTargetSensedByHail(float ageOut); // Function Scavenger.S_AICharacter.IsCurrentTargetSensedByHail // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0xffff8008e4a10000
	bool IsCurrentTargetSensedByDamage(float ageOut); // Function Scavenger.S_AICharacter.IsCurrentTargetSensedByDamage // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0xffff8008e4a10000
	bool HasGrenadeAttachment(); // Function Scavenger.S_AICharacter.HasGrenadeAttachment // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool GetTargetStateByFlag(enum class ES_AITargetStateFlags flag); // Function Scavenger.S_AICharacter.GetTargetStateByFlag // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct AS_AISpawner* GetSpawner(); // Function Scavenger.S_AICharacter.GetSpawner // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct FS_AIPoint GetReservedAIPoint(enum class ES_ScavengerResult resultOut); // Function Scavenger.S_AICharacter.GetReservedAIPoint // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	struct UAnimMontage* GetRandomAttackMontageVariant(struct TArray<struct UAnimMontage*> Montages); // Function Scavenger.S_AICharacter.GetRandomAttackMontageVariant // (Final|Native|Protected|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	float GetPlayerVsAiDamageMultipler(float defaultMultiplier, struct AS_CharacterBase* causeCharacter); // Function Scavenger.S_AICharacter.GetPlayerVsAiDamageMultipler // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	float GetMeleeIdealDistance(enum class ES_TriggerType triggerType); // Function Scavenger.S_AICharacter.GetMeleeIdealDistance // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0xffff8008e4a10000
	enum class ES_AILocomotionState GetLocomotionState(); // Function Scavenger.S_AICharacter.GetLocomotionState // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0xffff8008e4a10000
	float GetDistanceToTargetLKP(); // Function Scavenger.S_AICharacter.GetDistanceToTargetLKP // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	float GetCurrentTargetVisibility(); // Function Scavenger.S_AICharacter.GetCurrentTargetVisibility // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0xffff8008e4a10000
	float GetCurrentTargetThreat(); // Function Scavenger.S_AICharacter.GetCurrentTargetThreat // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0xffff8008e4a10000
	struct FVector GetCurrentTargetLastKnownPosition(); // Function Scavenger.S_AICharacter.GetCurrentTargetLastKnownPosition // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0xffff8008e4a10000
	bool GetCurrentTargetIsVisible(); // Function Scavenger.S_AICharacter.GetCurrentTargetIsVisible // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0xffff8008e4a10000
	bool GetCurrentTargetIsInsideSightRadius(); // Function Scavenger.S_AICharacter.GetCurrentTargetIsInsideSightRadius // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0xffff8008e4a10000
	struct FVector GetCurrentTargetFireAtPosition(); // Function Scavenger.S_AICharacter.GetCurrentTargetFireAtPosition // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	void GetCurrentTargetAgeAndExpirationAge(float Age, float ExpirationAge); // Function Scavenger.S_AICharacter.GetCurrentTargetAgeAndExpirationAge // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	float GetCurrentTargetAge(); // Function Scavenger.S_AICharacter.GetCurrentTargetAge // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0xffff8008e4a10000
	struct FVector GetCurrentTargetActualPosition(); // Function Scavenger.S_AICharacter.GetCurrentTargetActualPosition // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0xffff8008e4a10000
	struct AS_CharacterBase* GetCurrentTarget(); // Function Scavenger.S_AICharacter.GetCurrentTarget // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	enum class ES_WeaponSlot GetBestWeaponSlot(bool allowUnarmed); // Function Scavenger.S_AICharacter.GetBestWeaponSlot // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct FName GetAssociatedChallengeIdentifier(); // Function Scavenger.S_AICharacter.GetAssociatedChallengeIdentifier // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct AS_CharacterBase* GetAIMaster(); // Function Scavenger.S_AICharacter.GetAIMaster // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	int32_t GetAIIndex(); // Function Scavenger.S_AICharacter.GetAIIndex // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct US_AIAudioComponent* GetAIAudioComponent(); // Function Scavenger.S_AICharacter.GetAIAudioComponent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	void GetActiveAIPoint(struct FS_AIPoint aiPointOut, enum class ES_ScavengerResult resultOut); // Function Scavenger.S_AICharacter.GetActiveAIPoint // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	void ForceNextTargetAcquisition(); // Function Scavenger.S_AICharacter.ForceNextTargetAcquisition // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool FireWillLikelyHitTarget_BP(enum class ES_TriggerType triggerType, struct AActor* outHitActor, bool forceLikelyToHit, bool checkWithAds); // Function Scavenger.S_AICharacter.FireWillLikelyHitTarget_BP // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0xffff8008e4a10000
	void EndHardPing(struct UAnimMontage* Montage, bool Interrupted, int32_t montageInstanceID); // Function Scavenger.S_AICharacter.EndHardPing // (Final|Native|Protected) // @ game+0xffff8008e4a10000
	void EndCrouching(); // Function Scavenger.S_AICharacter.EndCrouching // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void EnableOutlineOverride(); // Function Scavenger.S_AICharacter.EnableOutlineOverride // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void DisableTemporaryPhysWalking(); // Function Scavenger.S_AICharacter.DisableTemporaryPhysWalking // (Final|Native|Public) // @ game+0xffff8008e4a10000
	void DisableOutlineOverride(); // Function Scavenger.S_AICharacter.DisableOutlineOverride // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void CrossServerLaunchAICharacter(struct FVector LaunchVelocity, struct US_DamageTypeExplosive* DamageType, struct AActor* CauseActor); // Function Scavenger.S_AICharacter.CrossServerLaunchAICharacter // (Net|NetReliableNative|Event|Public|HasDefaults|BlueprintCallable) // @ game+0xffff8008e4a10000
	void ClientPlayerBotTestsToggleBoolBB(struct FName KeyName); // Function Scavenger.S_AICharacter.ClientPlayerBotTestsToggleBoolBB // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0xffff8008e4a10000
	void ClientPlayerBotTestsStop(); // Function Scavenger.S_AICharacter.ClientPlayerBotTestsStop // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0xffff8008e4a10000
	void ClientPlayerBotStopGathering(); // Function Scavenger.S_AICharacter.ClientPlayerBotStopGathering // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0xffff8008e4a10000
	void ClientPlayerBotGatherAtLocation(struct FVector gatherLocation, bool AndDisperse); // Function Scavenger.S_AICharacter.ClientPlayerBotGatherAtLocation // (Net|NetReliableNative|Event|Public|HasDefaults|NetClient) // @ game+0xffff8008e4a10000
	void ClientNotifyDebugTeleported(); // Function Scavenger.S_AICharacter.ClientNotifyDebugTeleported // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0xffff8008e4a10000
	void CleanupReservedAIPoint(); // Function Scavenger.S_AICharacter.CleanupReservedAIPoint // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void CleanupBestScoredAIPoint(); // Function Scavenger.S_AICharacter.CleanupBestScoredAIPoint // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void CleanupActiveAIPoint(); // Function Scavenger.S_AICharacter.CleanupActiveAIPoint // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void AICharacter_HandleDeath_Client(struct US_StatsComponent* StatsComponent, enum class ES_StatsState OldState, enum class ES_StatsState NewState); // Function Scavenger.S_AICharacter.AICharacter_HandleDeath_Client // (Final|Native|Protected) // @ game+0xffff8008e4a10000
	void AICharacter_HandleDeath(struct US_StatsComponent* StatsComponent, enum class ES_StatsState OldState, enum class ES_StatsState NewState); // Function Scavenger.S_AICharacter.AICharacter_HandleDeath // (Final|Native|Protected) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_AICharacterDebugHUD
// Size: 0x390 (Inherited: 0x378)
struct AS_AICharacterDebugHUD : AHUD {
	char pad_378[0x18]; // 0x378(0x18)
};

// Class Scavenger.S_AICharacterNoWeapon
// Size: 0x2650 (Inherited: 0x2650)
struct AS_AICharacterNoWeapon : AS_AICharacter {
};

// Class Scavenger.S_AICharacterScourge
// Size: 0x2670 (Inherited: 0x2650)
struct AS_AICharacterScourge : AS_AICharacter {
	enum class ES_AIShriekerState m_currentAIShriekerState; // 0x2650(0x01)
	char pad_2651[0x7]; // 0x2651(0x07)
	struct FMulticastInlineDelegate OnStateChanged; // 0x2658(0x10)
	char pad_2668[0x8]; // 0x2668(0x08)

	void SetShriekerState(enum class ES_AIShriekerState newShriekerState); // Function Scavenger.S_AICharacterScourge.SetShriekerState // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void NotifyReplicatedStateChanged_BP(enum class ES_AIShriekerState stateChanged); // Function Scavenger.S_AICharacterScourge.NotifyReplicatedStateChanged_BP // (Event|Protected|BlueprintEvent) // @ game+0xffff8008e4a10000
	void NotifyReplicatedStateChanged(); // Function Scavenger.S_AICharacterScourge.NotifyReplicatedStateChanged // (Final|Native|Protected) // @ game+0xffff8008e4a10000
	enum class ES_AIShriekerState GetShriekerState(); // Function Scavenger.S_AICharacterScourge.GetShriekerState // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_AIAndWeaponInteractionContainer
// Size: 0x38 (Inherited: 0x28)
struct US_AIAndWeaponInteractionContainer : UObject {
	struct TArray<struct FS_AIAndWeaponInteraction> WeaponInteractions; // 0x28(0x10)
};

// Class Scavenger.S_FireIfPossibleAsyncAction
// Size: 0x88 (Inherited: 0x30)
struct US_FireIfPossibleAsyncAction : UBlueprintAsyncActionBase {
	struct FMulticastInlineDelegate CountReached; // 0x30(0x10)
	char pad_40[0x48]; // 0x40(0x48)

	struct US_FireIfPossibleAsyncAction* StartFireWithCountNotify(struct AS_AIController* Controller, float angleToTargetToAllowFire, bool autoFocusOnFocusPoint, bool autoADSForTarget, struct FVector2D alternateFireAtAgeRange, struct FVector2D holdFireAtAgeRange, float stopFireAge, float stopFireTimer, int32_t notifyAfterCount, enum class ES_TriggerType triggerType, bool delayNotifyUntilAnimCompletes, int32_t montageVariationOverride, bool ignoreVisibilityCheck, bool avoidShootingFriendlies, bool shouldFireAtLocation, struct FVector fireAtLocation); // Function Scavenger.S_FireIfPossibleAsyncAction.StartFireWithCountNotify // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_AIController
// Size: 0x868 (Inherited: 0x398)
struct AS_AIController : AAIController {
	char pad_398[0x10]; // 0x398(0x10)
	struct FMulticastInlineDelegate OnDamagedBy; // 0x3a8(0x10)
	struct FMulticastInlineDelegate OnDamaged; // 0x3b8(0x10)
	struct FMulticastInlineDelegate OnDownedBy; // 0x3c8(0x10)
	struct FMulticastInlineDelegate OnDowned; // 0x3d8(0x10)
	struct FMulticastInlineDelegate OnTerminalBy; // 0x3e8(0x10)
	struct FMulticastInlineDelegate OnTerminal; // 0x3f8(0x10)
	struct FMulticastInlineDelegate OnKilledBy; // 0x408(0x10)
	struct FMulticastInlineDelegate OnKilled; // 0x418(0x10)
	struct FMulticastInlineDelegate OnResurrectedBy; // 0x428(0x10)
	struct FMulticastInlineDelegate OnRevivedBy; // 0x438(0x10)
	struct FMulticastInlineDelegate OnResurrected; // 0x448(0x10)
	struct FMulticastInlineDelegate OnRevived; // 0x458(0x10)
	struct FMulticastInlineDelegate OnStatsStateChangedBy; // 0x468(0x10)
	struct FMulticastInlineDelegate OnCausedStatsStateChange; // 0x478(0x10)
	char pad_488[0x110]; // 0x488(0x110)
	struct US_BTScavengerRequiredService* m_lastVisitedService; // 0x598(0x08)
	struct FMulticastInlineDelegate OnFriendlyHailDelegate; // 0x5a0(0x10)
	struct FMulticastInlineDelegate OnPreDealDamage; // 0x5b0(0x10)
	struct FMulticastInlineDelegate OnPreTakeDamage; // 0x5c0(0x10)
	struct FMulticastInlineDelegate OnPreTakePointDamage; // 0x5d0(0x10)
	struct FMulticastInlineDelegate OnPostDealDamage; // 0x5e0(0x10)
	struct FMulticastInlineDelegate OnPostTakeDamage; // 0x5f0(0x10)
	struct FMulticastInlineDelegate OnPostTakePointDamage; // 0x600(0x10)
	char pad_610[0xc]; // 0x610(0x0c)
	float m_brainDeadTimeout; // 0x61c(0x04)
	char pad_620[0x3a]; // 0x620(0x3a)
	bool m_bActiveKungFuAttacker; // 0x65a(0x01)
	bool m_bEligibleToBecomeActive; // 0x65b(0x01)
	bool m_bEligibleToBecomeInactive; // 0x65c(0x01)
	bool AutoAttemptToCureIsolation; // 0x65d(0x01)
	char pad_65E[0x4a]; // 0x65e(0x4a)
	struct US_AIAndWeaponInteractionContainer* WeaponInteractionContainer; // 0x6a8(0x08)
	struct US_AIAndWeaponInteractionContainer* m_WeaponInteractionContainerInstance; // 0x6b0(0x08)
	struct US_AIAndWeaponInteractionContainer* AlternateWeaponInteractionContainer; // 0x6b8(0x08)
	struct US_AIAndWeaponInteractionContainer* m_AlternateWeaponInteractionContainerInstance; // 0x6c0(0x08)
	struct US_FireIfPossibleAsyncAction* m_FireAction; // 0x6c8(0x08)
	struct TArray<struct US_FireIfPossibleAsyncAction*> m_DelayedFireActions; // 0x6d0(0x10)
	char pad_6E0[0x18]; // 0x6e0(0x18)
	struct US_ControllerComponent* ControllerComponent; // 0x6f8(0x08)
	char pad_700[0x70]; // 0x700(0x70)
	struct US_AITask_MoveTo* m_registeredMoveTo; // 0x770(0x08)
	float PawnRotationSpeed; // 0x778(0x04)
	float MaxRangeToIdentifyTarget; // 0x77c(0x04)
	float AIMaxResolve; // 0x780(0x04)
	float AICurrentResolve; // 0x784(0x04)
	float AIResolveBreakingPoint; // 0x788(0x04)
	enum class ES_AIIntensity Intensity; // 0x78c(0x01)
	enum class ES_AIHail hailType; // 0x78d(0x01)
	char pad_78E[0x2]; // 0x78e(0x02)
	float FriendlyHailedCooldownTimer; // 0x790(0x04)
	float HailingFriendliesCooldownTimer; // 0x794(0x04)
	float HailingScaleFactorInStorm; // 0x798(0x04)
	bool WasHailed; // 0x79c(0x01)
	bool IsHailing; // 0x79d(0x01)
	char pad_79E[0x2]; // 0x79e(0x02)
	struct FVector FiringPointLocOne; // 0x7a0(0x0c)
	bool FiringPointLocOneUsed; // 0x7ac(0x01)
	char pad_7AD[0x3]; // 0x7ad(0x03)
	struct FName Squad; // 0x7b0(0x08)
	char pad_7B8[0x10]; // 0x7b8(0x10)
	bool RestrictToFiringPointAreas; // 0x7c8(0x01)
	char pad_7C9[0x3]; // 0x7c9(0x03)
	float ICanSeeEverythingInThisRadius; // 0x7cc(0x04)
	float SightSenseScaleWhenEscalatedCombatStates; // 0x7d0(0x04)
	float SightSenseScaleWhenInStorm; // 0x7d4(0x04)
	char pad_7D8[0x8]; // 0x7d8(0x08)
	enum class ES_CombatState CombatState; // 0x7e0(0x01)
	char pad_7E1[0x3]; // 0x7e1(0x03)
	float TargetSpottedHailDelay; // 0x7e4(0x04)
	float GunFiredHailDelay; // 0x7e8(0x04)
	float TargetLostAge; // 0x7ec(0x04)
	float AlwaysSeenDistanceOnDamage; // 0x7f0(0x04)
	float AlwaysSee360Distance; // 0x7f4(0x04)
	float SearchPeripheralVisionHalfAngle; // 0x7f8(0x04)
	float InvestigatePeripheralVisionHalfAngle; // 0x7fc(0x04)
	float CombatPeripheralVisionHalfAngle; // 0x800(0x04)
	float FleePeripheralVisionHalfAngle; // 0x804(0x04)
	struct FS_AIAndHeadInteraction m_aiAndHeadInteraction; // 0x808(0x18)
	char pad_820[0x8]; // 0x820(0x08)
	enum class ES_OpportunityState OpportunityState; // 0x828(0x01)
	bool Combat_I_LoveCover; // 0x829(0x01)
	char pad_82A[0x2]; // 0x82a(0x02)
	float Combat_WalkSpeed; // 0x82c(0x04)
	float Combat_SlowStalkSpeed; // 0x830(0x04)
	float Combat_StalkSpeed; // 0x834(0x04)
	bool Combat_I_Am_Meleeing; // 0x838(0x01)
	bool Combat_InCombat; // 0x839(0x01)
	char pad_83A[0x2]; // 0x83a(0x02)
	float Search_TargetConsideredLostTime; // 0x83c(0x04)
	float Search_GiveUpTime; // 0x840(0x04)
	float Search_StartTime; // 0x844(0x04)
	float Search_CurrentTime; // 0x848(0x04)
	bool IsSearching; // 0x84c(0x01)
	bool IsInvestigating; // 0x84d(0x01)
	char pad_84E[0x2]; // 0x84e(0x02)
	float Flee_MinimumHealthScaleValue; // 0x850(0x04)
	bool Flee_I_LoveCover; // 0x854(0x01)
	char pad_855[0x3]; // 0x855(0x03)
	float FleeCharge_MinimumHealthScaleValue; // 0x858(0x04)
	float Patrol_WaitTimeAtAIPoint; // 0x85c(0x04)
	float Patrol_WalkSpeed; // 0x860(0x04)
	bool CanPatrol; // 0x864(0x01)
	char pad_865[0x3]; // 0x865(0x03)

	bool VerySlowSearchForPointOnNavMesh(struct FVector startPoint, struct FVector endPoint, struct FVector PointOnNavMesh); // Function Scavenger.S_AIController.VerySlowSearchForPointOnNavMesh // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0xffff8008e4a10000
	void UnForceFacing(); // Function Scavenger.S_AIController.UnForceFacing // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool ThrowGrenade_BP(float angleToTargetToAllowFire, float randomizedRadius); // Function Scavenger.S_AIController.ThrowGrenade_BP // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void StopTimedBBUpdateBool(struct FName BBName); // Function Scavenger.S_AIController.StopTimedBBUpdateBool // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void StopFiring(bool ClearFocus); // Function Scavenger.S_AIController.StopFiring // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void StopAttack(enum class ES_WeaponSlot weaponSlot); // Function Scavenger.S_AIController.StopAttack // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool StartFire_BP(float angleToTargetToAllowFire, bool autoFocusOnFocusPoint, bool autoADSForTarget, struct FVector2D alternateFireAtAgeRange, struct FVector2D holdFireAtAgeRange, float stopFireAge, float stopFireTimer, enum class ES_TriggerType triggerType, bool delayNotifyUntilAnimCompletes); // Function Scavenger.S_AIController.StartFire_BP // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0xffff8008e4a10000
	void StartAttack(enum class ES_WeaponSlot weaponSlot, enum class ES_TriggerType triggerType, float triggerReleaseRate); // Function Scavenger.S_AIController.StartAttack // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void SetWeaponInteractionContainer(struct US_AIAndWeaponInteractionContainer* containerTemplate); // Function Scavenger.S_AIController.SetWeaponInteractionContainer // (Final|Native|Protected|BlueprintCallable) // @ game+0xffff8008e4a10000
	void SetTimedBBUpdateBool(bool startVal, float timeToUpdate, struct FName BBName, bool loopingAlternating); // Function Scavenger.S_AIController.SetTimedBBUpdateBool // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void SetNewAssignedOpportunityPoint(); // Function Scavenger.S_AIController.SetNewAssignedOpportunityPoint // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool SetMyOpportunityPointEnabled(bool Enabled); // Function Scavenger.S_AIController.SetMyOpportunityPointEnabled // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void SetHeadPatternEnabled(bool Enabled, bool randomStartIndex); // Function Scavenger.S_AIController.SetHeadPatternEnabled // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void SetEligibleToBecomeInactive_KungFu(bool canBecomeInactive); // Function Scavenger.S_AIController.SetEligibleToBecomeInactive_KungFu // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void SetEligibleToBecomeActive_KungFu(bool canBecomeActive); // Function Scavenger.S_AIController.SetEligibleToBecomeActive_KungFu // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void SetCustomScoringPoint(struct FVector vectorIn); // Function Scavenger.S_AIController.SetCustomScoringPoint // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0xffff8008e4a10000
	void SetControlRotationTowardsActorLocation(struct AActor* Actor); // Function Scavenger.S_AIController.SetControlRotationTowardsActorLocation // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void SetBrainDead(bool toggle, enum class ES_BrainDeadSource brainDeadSource); // Function Scavenger.S_AIController.SetBrainDead // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool SetBBValueAsVector(struct FName KeyName, struct FVector VectorValue); // Function Scavenger.S_AIController.SetBBValueAsVector // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool SetBBValueAsString(struct FName KeyName, struct FString StringValue); // Function Scavenger.S_AIController.SetBBValueAsString // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool SetBBValueAsRotator(struct FName KeyName, struct FRotator VectorValue); // Function Scavenger.S_AIController.SetBBValueAsRotator // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool SetBBValueAsObject(struct FName KeyName, struct UObject* ObjectValue); // Function Scavenger.S_AIController.SetBBValueAsObject // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool SetBBValueAsName(struct FName KeyName, struct FName NameValue); // Function Scavenger.S_AIController.SetBBValueAsName // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool SetBBValueAsInt(struct FName KeyName, int32_t IntValue); // Function Scavenger.S_AIController.SetBBValueAsInt // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool SetBBValueAsFloat(struct FName KeyName, float FloatValue); // Function Scavenger.S_AIController.SetBBValueAsFloat // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool SetBBValueAsEnum(struct FName KeyName, char EnumValue); // Function Scavenger.S_AIController.SetBBValueAsEnum // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool SetBBValueAsClass(struct FName KeyName, struct UObject* ClassValue); // Function Scavenger.S_AIController.SetBBValueAsClass // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool SetBBValueAsBool(struct FName KeyName, bool BoolValue); // Function Scavenger.S_AIController.SetBBValueAsBool // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	void SetAIPeripheralVisionAngleDegAndDigest(float PeripheralVisionAngleDegrees); // Function Scavenger.S_AIController.SetAIPeripheralVisionAngleDegAndDigest // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void SetActiveKungFuAttacker(bool isActiveAttacker, struct FColor debugSphereColor); // Function Scavenger.S_AIController.SetActiveKungFuAttacker // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0xffff8008e4a10000
	void ResetExecutionBBState(); // Function Scavenger.S_AIController.ResetExecutionBBState // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool ReserveBestOpportunityPoint(bool overlordAssigning, struct FString matchingTextOpportunityType); // Function Scavenger.S_AIController.ReserveBestOpportunityPoint // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void Reload(enum class ES_WeaponSlot weaponSlot, enum class ES_TriggerType triggerType); // Function Scavenger.S_AIController.Reload // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void RegisterDebugCommandToBBKey(struct FString debugCommandKey, struct FName BBKey); // Function Scavenger.S_AIController.RegisterDebugCommandToBBKey // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	void PlayerBotTestsToggleBoolBB(struct FName KeyName); // Function Scavenger.S_AIController.PlayerBotTestsToggleBoolBB // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	void PlayerBotTestsStop(); // Function Scavenger.S_AIController.PlayerBotTestsStop // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void PlayerBotStopGathering(); // Function Scavenger.S_AIController.PlayerBotStopGathering // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void PlayerBotSetPriorityLocation(struct FVector NewLocation, bool AndDisperse); // Function Scavenger.S_AIController.PlayerBotSetPriorityLocation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0xffff8008e4a10000
	void OnWeaponAttackCallback(enum class ES_WeaponSlot weaponSlot, enum class ES_TriggerType triggerType, enum class ES_AttackEvent attackEvent); // Function Scavenger.S_AIController.OnWeaponAttackCallback // (Final|Native|Public) // @ game+0xffff8008e4a10000
	void OnNotifyDebugTeleported(); // Function Scavenger.S_AIController.OnNotifyDebugTeleported // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0xffff8008e4a10000
	void OnHailingFriendlies_BP(enum class ES_AIHail hailType, struct FString Message); // Function Scavenger.S_AIController.OnHailingFriendlies_BP // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0xffff8008e4a10000
	void OnFriendlyHail_BP(struct AS_AIController* ScavengerFriend, enum class ES_AIHail hailType, struct FString Message, float hailDistance); // Function Scavenger.S_AIController.OnFriendlyHail_BP // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0xffff8008e4a10000
	void OnFriendlyHail(struct AS_AIController* ScavengerFriend, enum class ES_AIHail hailType, struct FString Message); // Function Scavenger.S_AIController.OnFriendlyHail // (Final|Native|Public|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyTerminalBy_BP(struct FS_EventParameterControllerVariant TerminatingController, struct FS_ActorTerminalParameters ActorTerminalParameters); // Function Scavenger.S_AIController.NotifyTerminalBy_BP // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xffff8008e4a10000
	void NotifyTerminal_BP(struct FS_EventParameterVariant TerminalActor, struct FS_ActorTerminalParameters ActorTerminalParameters); // Function Scavenger.S_AIController.NotifyTerminal_BP // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xffff8008e4a10000
	void NotifyStatsStateChangedBy_BP(struct FS_EventParameterControllerVariant ChangeCausingController, enum class ES_StatsState OldState, enum class ES_StatsState NewState, struct FS_ActorStatsStateChangedParameters ActorStatsStateChangedParameters); // Function Scavenger.S_AIController.NotifyStatsStateChangedBy_BP // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xffff8008e4a10000
	void NotifyRevivedBy_BP(struct FS_EventParameterControllerVariant revivingController); // Function Scavenger.S_AIController.NotifyRevivedBy_BP // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xffff8008e4a10000
	void NotifyRevived_BP(struct FS_EventParameterVariant revivedActor); // Function Scavenger.S_AIController.NotifyRevived_BP // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xffff8008e4a10000
	void NotifyResurrectedBy_BP(struct FS_EventParameterControllerVariant resurrectingController); // Function Scavenger.S_AIController.NotifyResurrectedBy_BP // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xffff8008e4a10000
	void NotifyResurrected_BP(struct FS_EventParameterVariant resurrectedActor); // Function Scavenger.S_AIController.NotifyResurrected_BP // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xffff8008e4a10000
	void NotifyOverlordEligibleExecutionTargetReleased(struct AS_PlayerCharacter* Target); // Function Scavenger.S_AIController.NotifyOverlordEligibleExecutionTargetReleased // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void NotifyOverlordEligibleExecutionTargetAcquired(struct AS_PlayerCharacter* Target); // Function Scavenger.S_AIController.NotifyOverlordEligibleExecutionTargetAcquired // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void NotifyKilledBy_BP(struct FS_EventParameterControllerVariant KillingController); // Function Scavenger.S_AIController.NotifyKilledBy_BP // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xffff8008e4a10000
	void NotifyKilled_BP(struct FS_EventParameterVariant KilledActor); // Function Scavenger.S_AIController.NotifyKilled_BP // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xffff8008e4a10000
	void NotifyDownedBy_BP(struct FS_EventParameterControllerVariant DowningController, struct FS_ActorDownedParameters ActorDownedParameters); // Function Scavenger.S_AIController.NotifyDownedBy_BP // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xffff8008e4a10000
	void NotifyDowned_BP(struct FS_EventParameterVariant DownedActor, struct FS_ActorDownedParameters ActorDownedParameters); // Function Scavenger.S_AIController.NotifyDowned_BP // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xffff8008e4a10000
	void NotifyDamagedBy_BP(struct FS_EventParameterControllerVariant DamagingController, float DamageDealt); // Function Scavenger.S_AIController.NotifyDamagedBy_BP // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xffff8008e4a10000
	void NotifyDamaged_BP(struct FS_EventParameterVariant DamagedActor, float DamageDealt); // Function Scavenger.S_AIController.NotifyDamaged_BP // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xffff8008e4a10000
	void NotifyCausedStatsStateChange_BP(struct FS_EventParameterVariant ChangedActor, enum class ES_StatsState OldState, enum class ES_StatsState NewState, struct FS_ActorStatsStateChangedParameters ActorStatsStateChangedParameters); // Function Scavenger.S_AIController.NotifyCausedStatsStateChange_BP // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xffff8008e4a10000
	bool IsTargetReachableByMelee(struct AActor* actorToAttack, struct FVector meleeAttackPosition, float meleeRange, float verticalTolerance); // Function Scavenger.S_AIController.IsTargetReachableByMelee // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool IsOpportunityPointValid(bool clearInvalidPoint); // Function Scavenger.S_AIController.IsOpportunityPointValid // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool IsFiringWithTrigger(enum class ES_TriggerType triggerType); // Function Scavenger.S_AIController.IsFiringWithTrigger // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool IsFiring(); // Function Scavenger.S_AIController.IsFiring // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool IsEligibleToBecomeInactive_KungFu(); // Function Scavenger.S_AIController.IsEligibleToBecomeInactive_KungFu // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool IsEligibleToBecomeActive_KungFu(); // Function Scavenger.S_AIController.IsEligibleToBecomeActive_KungFu // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool IsBrainDead(); // Function Scavenger.S_AIController.IsBrainDead // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool IsActiveKungFuAttacker(); // Function Scavenger.S_AIController.IsActiveKungFuAttacker // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool IsAbilityActiveByName(struct FName AbilityName); // Function Scavenger.S_AIController.IsAbilityActiveByName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool HasReservedOpportunityPoint(); // Function Scavenger.S_AIController.HasReservedOpportunityPoint // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void Hail(struct FName hailTag, float MaxRange, float Loudness, float delayInSeconds); // Function Scavenger.S_AIController.Hail // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void GiveItemToPlayer(struct AS_PlayerCharacter* sendingPlayerCharacter, struct AActor* receivingPlayerCharacter, struct FS_ItemState ItemState); // Function Scavenger.S_AIController.GiveItemToPlayer // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	float GetSearchPeripheralVisionHalfAngle(); // Function Scavenger.S_AIController.GetSearchPeripheralVisionHalfAngle // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct UBehaviorTree* GetRootBehaviorTree(); // Function Scavenger.S_AIController.GetRootBehaviorTree // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct FS_BakedOpportunityPoint GetReservedOpportunityPoint(); // Function Scavenger.S_AIController.GetReservedOpportunityPoint // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	float GetOriginalPeripheralVisionHalfAngle(); // Function Scavenger.S_AIController.GetOriginalPeripheralVisionHalfAngle // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct UObject* GetOpportunityPointUserData(); // Function Scavenger.S_AIController.GetOpportunityPointUserData // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	struct FString GetOpportunityPointTextOpportunityType(); // Function Scavenger.S_AIController.GetOpportunityPointTextOpportunityType // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool GetOpportunityPointRequiresRun(); // Function Scavenger.S_AIController.GetOpportunityPointRequiresRun // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool GetOpportunityPointRequiresNonStateMachine(); // Function Scavenger.S_AIController.GetOpportunityPointRequiresNonStateMachine // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool GetOpportunityPointOverlordAssigned(); // Function Scavenger.S_AIController.GetOpportunityPointOverlordAssigned // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	int32_t GetOpportunityPointID(); // Function Scavenger.S_AIController.GetOpportunityPointID // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	int32_t GetNumberOfHostileTargetsInPerception(enum class ES_HostileTarget hostileType); // Function Scavenger.S_AIController.GetNumberOfHostileTargetsInPerception // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool GetMyOverlordSquadRef(struct FS_OverlordSquad outOverlordSquad); // Function Scavenger.S_AIController.GetMyOverlordSquadRef // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool GetMyOverlord(struct AS_AIOverlordActor* outOverlord); // Function Scavenger.S_AIController.GetMyOverlord // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	float GetInvestigatePeripheralVisionHalfAngle(); // Function Scavenger.S_AIController.GetInvestigatePeripheralVisionHalfAngle // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	float GetFleePeripheralVisionHalfAngle(); // Function Scavenger.S_AIController.GetFleePeripheralVisionHalfAngle // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct FVector GetCustomScoringPoint(); // Function Scavenger.S_AIController.GetCustomScoringPoint // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0xffff8008e4a10000
	float GetCurrentTargetAge(); // Function Scavenger.S_AIController.GetCurrentTargetAge // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	float GetCombatPeripheralVisionHalfAngle(); // Function Scavenger.S_AIController.GetCombatPeripheralVisionHalfAngle // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool GetCachedClosestOverlord(struct AS_AIOverlordActor* outOverlord); // Function Scavenger.S_AIController.GetCachedClosestOverlord // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	struct FVector GetBBValueAsVector(struct FName KeyName); // Function Scavenger.S_AIController.GetBBValueAsVector // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct FString GetBBValueAsString(struct FName KeyName); // Function Scavenger.S_AIController.GetBBValueAsString // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct FRotator GetBBValueAsRotator(struct FName KeyName); // Function Scavenger.S_AIController.GetBBValueAsRotator // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct UObject* GetBBValueAsObject(struct FName KeyName); // Function Scavenger.S_AIController.GetBBValueAsObject // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct FName GetBBValueAsName(struct FName KeyName); // Function Scavenger.S_AIController.GetBBValueAsName // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	int32_t GetBBValueAsInt(struct FName KeyName); // Function Scavenger.S_AIController.GetBBValueAsInt // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	float GetBBValueAsFloat(struct FName KeyName); // Function Scavenger.S_AIController.GetBBValueAsFloat // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	char GetBBValueAsEnum(struct FName KeyName); // Function Scavenger.S_AIController.GetBBValueAsEnum // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct UObject* GetBBValueAsClass(struct FName KeyName); // Function Scavenger.S_AIController.GetBBValueAsClass // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool GetBBValueAsBool(struct FName KeyName); // Function Scavenger.S_AIController.GetBBValueAsBool // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	float GetBBUpdateBoolCurrentTime(struct FName BBName); // Function Scavenger.S_AIController.GetBBUpdateBoolCurrentTime // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void ForceScaleAISightRadiusAsIfWithTarget(); // Function Scavenger.S_AIController.ForceScaleAISightRadiusAsIfWithTarget // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void ForceFacing(struct FRotator facing, float facingTime); // Function Scavenger.S_AIController.ForceFacing // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0xffff8008e4a10000
	void ForceActiveInTargetKungFu(enum class ES_KungFuAttackerRange rangeToAddTo); // Function Scavenger.S_AIController.ForceActiveInTargetKungFu // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void EventTerminalBy(struct FS_EventParameterControllerVariant TerminatingController, struct FS_ActorTerminalParameters ActorTerminalParameters); // Function Scavenger.S_AIController.EventTerminalBy // (Net|NetReliableNative|Event|Public) // @ game+0xffff8008e4a10000
	void EventTerminal(struct FS_EventParameterVariant TerminalActor, struct FS_ActorTerminalParameters ActorTerminalParameters); // Function Scavenger.S_AIController.EventTerminal // (Net|NetReliableNative|Event|Public) // @ game+0xffff8008e4a10000
	void EventStatsStateChangedBy(struct FS_EventParameterControllerVariant ChangeCausingController, enum class ES_StatsState OldState, enum class ES_StatsState NewState, struct FS_ActorStatsStateChangedParameters ActorStatsStateChangedParameters); // Function Scavenger.S_AIController.EventStatsStateChangedBy // (Net|NetReliableNative|Event|Public) // @ game+0xffff8008e4a10000
	void EventRevivedBy(struct FS_EventParameterControllerVariant revivingController); // Function Scavenger.S_AIController.EventRevivedBy // (Net|NetReliableNative|Event|Public) // @ game+0xffff8008e4a10000
	void EventRevived(struct FS_EventParameterVariant revivedActor); // Function Scavenger.S_AIController.EventRevived // (Net|NetReliableNative|Event|Public) // @ game+0xffff8008e4a10000
	void EventResurrectedBy(struct FS_EventParameterControllerVariant resurrectingController); // Function Scavenger.S_AIController.EventResurrectedBy // (Net|NetReliableNative|Event|Public) // @ game+0xffff8008e4a10000
	void EventResurrected(struct FS_EventParameterVariant resurrectedActor); // Function Scavenger.S_AIController.EventResurrected // (Net|NetReliableNative|Event|Public) // @ game+0xffff8008e4a10000
	void EventKilledBy(struct FS_EventParameterControllerVariant KillingController); // Function Scavenger.S_AIController.EventKilledBy // (Net|NetReliableNative|Event|Public) // @ game+0xffff8008e4a10000
	void EventKilled(struct FS_EventParameterVariant KilledActor); // Function Scavenger.S_AIController.EventKilled // (Net|NetReliableNative|Event|Public) // @ game+0xffff8008e4a10000
	void EventDownedBy(struct FS_EventParameterControllerVariant DowningController, struct FS_ActorDownedParameters ActorDownedParameters); // Function Scavenger.S_AIController.EventDownedBy // (Net|NetReliableNative|Event|Public) // @ game+0xffff8008e4a10000
	void EventDowned(struct FS_EventParameterVariant DownedActor, struct FS_ActorDownedParameters ActorDownedParameters); // Function Scavenger.S_AIController.EventDowned // (Net|NetReliableNative|Event|Public) // @ game+0xffff8008e4a10000
	void EventDamagedBy(struct FS_EventParameterControllerVariant DamagingController, float DamageDealt); // Function Scavenger.S_AIController.EventDamagedBy // (Net|NetReliableNative|Event|Public) // @ game+0xffff8008e4a10000
	void EventDamaged(struct FS_EventParameterVariant DamagedActor, float DamageDealt); // Function Scavenger.S_AIController.EventDamaged // (Net|NetReliableNative|Event|Public) // @ game+0xffff8008e4a10000
	void EventCausedStatsStateChange(struct FS_EventParameterVariant ChangedActor, enum class ES_StatsState OldState, enum class ES_StatsState NewState, struct FS_ActorStatsStateChangedParameters ActorStatsStateChangedParameters); // Function Scavenger.S_AIController.EventCausedStatsStateChange // (Net|NetReliableNative|Event|Public) // @ game+0xffff8008e4a10000
	bool CustomScoringPointIsValid(enum class ES_ScavengerResult resultOut); // Function Scavenger.S_AIController.CustomScoringPointIsValid // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	void ClearReservedOpportunityPoint(); // Function Scavenger.S_AIController.ClearReservedOpportunityPoint // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void ClearCustomScoringPoint(); // Function Scavenger.S_AIController.ClearCustomScoringPoint // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void ClearBBValue(struct FName KeyName); // Function Scavenger.S_AIController.ClearBBValue // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool CanThrowGrenade_BP(float angleToTargetToAllowFire); // Function Scavenger.S_AIController.CanThrowGrenade_BP // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool CanLeap(); // Function Scavenger.S_AIController.CanLeap // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool BBUpdateBoolHasTimer(struct FName BBName); // Function Scavenger.S_AIController.BBUpdateBoolHasTimer // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void AddPlayerBotDebugInfo(struct FString debugInfo); // Function Scavenger.S_AIController.AddPlayerBotDebugInfo // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool ActivateAbilityByName(struct FName AbilityName); // Function Scavenger.S_AIController.ActivateAbilityByName // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_AIKungFuAttacker
// Size: 0x48 (Inherited: 0x28)
struct US_AIKungFuAttacker : UObject {
	char pad_28[0x20]; // 0x28(0x20)
};

// Class Scavenger.S_AIKungFu
// Size: 0x90 (Inherited: 0x28)
struct US_AIKungFu : UObject {
	char pad_28[0x8]; // 0x28(0x08)
	struct TArray<struct US_AIKungFuAttacker*> attackersToRemove; // 0x30(0x10)
	struct TArray<struct US_AIKungFuAttacker*> m_currentMeleeAttackers; // 0x40(0x10)
	struct TArray<struct US_AIKungFuAttacker*> m_currentMediumAttackers; // 0x50(0x10)
	struct TArray<struct US_AIKungFuAttacker*> m_currentExtendedAttackers; // 0x60(0x10)
	struct TArray<struct US_AIKungFuAttacker*> m_availableAttackers; // 0x70(0x10)
	char pad_80[0x10]; // 0x80(0x10)
};

// Class Scavenger.S_AIKungFuManager
// Size: 0x90 (Inherited: 0x28)
struct US_AIKungFuManager : UObject {
	struct TMap<struct AS_CharacterBase*, struct US_AIKungFu*> CurrentSquads; // 0x28(0x50)
	int32_t DesiredNumberOfActiveMeleeAttackers; // 0x78(0x04)
	int32_t DesiredNumberOfActiveMediumAttackers; // 0x7c(0x04)
	int32_t DesiredNumberOfActiveExtendedAttackers; // 0x80(0x04)
	float HowLongToAttack; // 0x84(0x04)
	float TimeToWaitForFire; // 0x88(0x04)
	char pad_8C[0x4]; // 0x8c(0x04)
};

// Class Scavenger.S_AimAssistComponent
// Size: 0x1e8 (Inherited: 0xb0)
struct US_AimAssistComponent : UActorComponent {
	struct US_GameInstance* m_gameInstance; // 0xb0(0x08)
	struct AS_PlayerController* m_owningPlayerController; // 0xb8(0x08)
	struct FS_AimAssistCameraTransform m_cameraTransform; // 0xc0(0x18)
	struct TArray<struct FS_AimAssistRelevantPawnRecord> m_relevantPawns; // 0xd8(0x10)
	struct TArray<struct AActor*> m_actorsToIgnore; // 0xe8(0x10)
	char pad_F8[0xf0]; // 0xf8(0xf0)
};

// Class Scavenger.S_AimAssistDebugHUD
// Size: 0x3d0 (Inherited: 0x378)
struct AS_AimAssistDebugHUD : AHUD {
	char pad_378[0x58]; // 0x378(0x58)
};

// Class Scavenger.S_AIOverlordActor
// Size: 0x458 (Inherited: 0x288)
struct AS_AIOverlordActor : AActor {
	char pad_288[0x50]; // 0x288(0x50)
	struct UBlackboardData* BlackboardToUse; // 0x2d8(0x08)
	struct UBehaviorTree* BehaviorTreeToUse; // 0x2e0(0x08)
	struct UBlackboardComponent* Blackboard; // 0x2e8(0x08)
	struct UBehaviorTreeComponent* BrainComponent; // 0x2f0(0x08)
	char pad_2F8[0x10]; // 0x2f8(0x10)
	float CaptureRadius; // 0x308(0x04)
	float DownedPlayerCaptureRadius; // 0x30c(0x04)
	struct UBillboardComponent* TransformComponent; // 0x310(0x08)
	struct TArray<struct FS_OverlordSquad> Squads; // 0x318(0x10)
	struct TArray<struct FS_OverlordSquadStage> PredefinedStages; // 0x328(0x10)
	struct FMulticastInlineDelegate OnSquadStageChanged; // 0x338(0x10)
	struct TArray<struct AS_AISpawner*> LooseSpawners; // 0x348(0x10)
	struct TArray<struct FS_BakedOpportunityPoint> BakedOpportunityPoints; // 0x358(0x10)
	struct TArray<struct FS_OverlordSmatterAudioVolume> SmatterAudioVolumes; // 0x368(0x10)
	struct FVector ImportancePoint; // 0x378(0x0c)
	int32_t CurrentRank; // 0x384(0x04)
	bool IsAwareAlarm; // 0x388(0x01)
	char pad_389[0x3]; // 0x389(0x03)
	int32_t CountAlarmPinged; // 0x38c(0x04)
	bool AlarmSignalActivated; // 0x390(0x01)
	char pad_391[0x3]; // 0x391(0x03)
	float ExecutionReassignmentCooldown; // 0x394(0x04)
	float ExecutionAssignmentDelay; // 0x398(0x04)
	float ExecutionAssociatedActorRemovedDelay; // 0x39c(0x04)
	bool StingerOnCooldown; // 0x3a0(0x01)
	bool OutlanderRally; // 0x3a1(0x01)
	bool OutlanderBroken; // 0x3a2(0x01)
	bool AlarmRally; // 0x3a3(0x01)
	bool DebugTriggerAlarm; // 0x3a4(0x01)
	char pad_3A5[0x3]; // 0x3a5(0x03)
	struct TArray<struct FS_TriggerReference> AvailableTriggers; // 0x3a8(0x10)
	char pad_3B8[0x58]; // 0x3b8(0x58)
	float AILocationReportingInterval; // 0x410(0x04)
	char pad_414[0x28]; // 0x414(0x28)
	struct FName OriginalActorLabel; // 0x43c(0x08)
	char pad_444[0x14]; // 0x444(0x14)

	bool UseBlackboard(struct UBlackboardData* BlackboardAsset, struct UBlackboardComponent* BlackboardComponent); // Function Scavenger.S_AIOverlordActor.UseBlackboard // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool SetSquadStage(struct FString SquadName, struct FString StageName, enum class ES_StageChangeUrgency stageChangeUrgency, enum class ES_StageChangeStateHint stageChangeStateHint); // Function Scavenger.S_AIOverlordActor.SetSquadStage // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool SetSquadLastLeapTimeToCurrentTime(struct AS_AIController* AIController); // Function Scavenger.S_AIOverlordActor.SetSquadLastLeapTimeToCurrentTime // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool SetSquadLastGrenadeTimeToCurrentTime(struct AS_AIController* AIController); // Function Scavenger.S_AIOverlordActor.SetSquadLastGrenadeTimeToCurrentTime // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool SetBBValueAsVector(struct FName KeyName, struct FVector VectorValue); // Function Scavenger.S_AIOverlordActor.SetBBValueAsVector // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool SetBBValueAsString(struct FName KeyName, struct FString StringValue); // Function Scavenger.S_AIOverlordActor.SetBBValueAsString // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool SetBBValueAsRotator(struct FName KeyName, struct FRotator VectorValue); // Function Scavenger.S_AIOverlordActor.SetBBValueAsRotator // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool SetBBValueAsObject(struct FName KeyName, struct UObject* ObjectValue); // Function Scavenger.S_AIOverlordActor.SetBBValueAsObject // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool SetBBValueAsName(struct FName KeyName, struct FName NameValue); // Function Scavenger.S_AIOverlordActor.SetBBValueAsName // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool SetBBValueAsInt(struct FName KeyName, int32_t IntValue); // Function Scavenger.S_AIOverlordActor.SetBBValueAsInt // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool SetBBValueAsFloat(struct FName KeyName, float FloatValue); // Function Scavenger.S_AIOverlordActor.SetBBValueAsFloat // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool SetBBValueAsEnum(struct FName KeyName, char EnumValue); // Function Scavenger.S_AIOverlordActor.SetBBValueAsEnum // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool SetBBValueAsClass(struct FName KeyName, struct UObject* ClassValue); // Function Scavenger.S_AIOverlordActor.SetBBValueAsClass // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool SetBBValueAsBool(struct FName KeyName, bool BoolValue); // Function Scavenger.S_AIOverlordActor.SetBBValueAsBool // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool RunBehaviorTree(struct UBehaviorTree* BTAsset); // Function Scavenger.S_AIOverlordActor.RunBehaviorTree // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void PingAlarm(); // Function Scavenger.S_AIOverlordActor.PingAlarm // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void OnSpawnerMaxedOut_BP(struct AS_Spawner* spawner); // Function Scavenger.S_AIOverlordActor.OnSpawnerMaxedOut_BP // (Event|Public|BlueprintEvent) // @ game+0xffff8008e4a10000
	void OnPlayerExitSmatterTrigger(struct AS_AISmatterVolume* TriggerVolume); // Function Scavenger.S_AIOverlordActor.OnPlayerExitSmatterTrigger // (Final|Native|Private) // @ game+0xffff8008e4a10000
	void OnPlayerEnterSmatterTrigger(struct AS_AISmatterVolume* TriggerVolume); // Function Scavenger.S_AIOverlordActor.OnPlayerEnterSmatterTrigger // (Final|Native|Private) // @ game+0xffff8008e4a10000
	void OnAISpawned_BP(struct AS_AICharacter* aiChar); // Function Scavenger.S_AIOverlordActor.OnAISpawned_BP // (Event|Public|BlueprintEvent) // @ game+0xffff8008e4a10000
	void OnAIKilled_BP(struct AS_AICharacter* aiChar); // Function Scavenger.S_AIOverlordActor.OnAIKilled_BP // (Event|Public|BlueprintEvent) // @ game+0xffff8008e4a10000
	bool IsTargetCurrentlyInCombatWithOverlordAI(struct AActor* Target); // Function Scavenger.S_AIOverlordActor.IsTargetCurrentlyInCombatWithOverlordAI // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	float GetSquadStrength(struct FString SquadName); // Function Scavenger.S_AIOverlordActor.GetSquadStrength // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool GetSquadSpawnedActors(struct FString SquadName, struct TArray<struct AActor*> OutActors); // Function Scavenger.S_AIOverlordActor.GetSquadSpawnedActors // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool GetSquadRef(struct FString SquadName, struct FS_OverlordSquad outSquad); // Function Scavenger.S_AIOverlordActor.GetSquadRef // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	float GetSquadLastLeapTime(struct AS_AIController* AIController); // Function Scavenger.S_AIOverlordActor.GetSquadLastLeapTime // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	float GetSquadLastGrenadeTime(struct AS_AIController* AIController); // Function Scavenger.S_AIOverlordActor.GetSquadLastGrenadeTime // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	float GetSquadHealthStrengthCombined(); // Function Scavenger.S_AIOverlordActor.GetSquadHealthStrengthCombined // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	float GetSquadHealthStrength(struct FString SquadName); // Function Scavenger.S_AIOverlordActor.GetSquadHealthStrength // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool GetCanSquadThrowGrenade(struct AS_AIController* AIController); // Function Scavenger.S_AIOverlordActor.GetCanSquadThrowGrenade // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool GetCanSquadLeap(struct AS_AIController* AIController); // Function Scavenger.S_AIOverlordActor.GetCanSquadLeap // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct FVector GetBBValueAsVector(struct FName KeyName); // Function Scavenger.S_AIOverlordActor.GetBBValueAsVector // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct FString GetBBValueAsString(struct FName KeyName); // Function Scavenger.S_AIOverlordActor.GetBBValueAsString // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct FRotator GetBBValueAsRotator(struct FName KeyName); // Function Scavenger.S_AIOverlordActor.GetBBValueAsRotator // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct UObject* GetBBValueAsObject(struct FName KeyName); // Function Scavenger.S_AIOverlordActor.GetBBValueAsObject // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct FName GetBBValueAsName(struct FName KeyName); // Function Scavenger.S_AIOverlordActor.GetBBValueAsName // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	int32_t GetBBValueAsInt(struct FName KeyName); // Function Scavenger.S_AIOverlordActor.GetBBValueAsInt // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	float GetBBValueAsFloat(struct FName KeyName); // Function Scavenger.S_AIOverlordActor.GetBBValueAsFloat // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	char GetBBValueAsEnum(struct FName KeyName); // Function Scavenger.S_AIOverlordActor.GetBBValueAsEnum // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct UObject* GetBBValueAsClass(struct FName KeyName); // Function Scavenger.S_AIOverlordActor.GetBBValueAsClass // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool GetBBValueAsBool(struct FName KeyName); // Function Scavenger.S_AIOverlordActor.GetBBValueAsBool // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct TArray<struct AS_PlayerCharacter*> GetAllDownedPlayersInRange(bool filterActiveExecutions); // Function Scavenger.S_AIOverlordActor.GetAllDownedPlayersInRange // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	void GetAllAssociatedActors(struct TArray<struct AActor*> OutActors); // Function Scavenger.S_AIOverlordActor.GetAllAssociatedActors // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0xffff8008e4a10000
	int32_t GetActiveAIInStage(struct FString StageName); // Function Scavenger.S_AIOverlordActor.GetActiveAIInStage // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	void CleanUpEmptySpawners(); // Function Scavenger.S_AIOverlordActor.CleanUpEmptySpawners // (Final|Native|Protected) // @ game+0xffff8008e4a10000
	void AssociatedActorRemoved_BP(struct AActor* Actor); // Function Scavenger.S_AIOverlordActor.AssociatedActorRemoved_BP // (Event|Public|BlueprintEvent) // @ game+0xffff8008e4a10000
	void AssociatedActorAdded_BP(struct AActor* Actor); // Function Scavenger.S_AIOverlordActor.AssociatedActorAdded_BP // (Event|Public|BlueprintEvent) // @ game+0xffff8008e4a10000
	bool AssignBestOpportunityPointToClosestPlayer(struct AS_AIController* controllerAssigned, struct FString matchingTextOpportunityType); // Function Scavenger.S_AIOverlordActor.AssignBestOpportunityPointToClosestPlayer // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_Overlord_BlackboardComponent
// Size: 0x1c0 (Inherited: 0x1b8)
struct US_Overlord_BlackboardComponent : UBlackboardComponent {
	char pad_1B8[0x8]; // 0x1b8(0x08)
};

// Class Scavenger.S_AIPathFollowingComponent
// Size: 0x258 (Inherited: 0x250)
struct US_AIPathFollowingComponent : UPathFollowingComponent {
	bool OverridePathfollowingAcceptanceRadius; // 0x250(0x01)
	char pad_251[0x3]; // 0x251(0x03)
	float PathfollowingAcceptanceRadius; // 0x254(0x04)
};

// Class Scavenger.S_AIPerceptionSystem
// Size: 0x130 (Inherited: 0x130)
struct US_AIPerceptionSystem : UAIPerceptionSystem {
};

// Class Scavenger.S_AISense_Damage
// Size: 0x90 (Inherited: 0x90)
struct US_AISense_Damage : UAISense_Damage {
};

// Class Scavenger.S_AISense_Hail
// Size: 0x90 (Inherited: 0x80)
struct US_AISense_Hail : UAISense {
	struct TArray<struct FS_AIHailEvent> m_registeredEvents; // 0x80(0x10)

	void ReportHailEvent(struct AActor* Instigator, struct FName stimuliTag, float MaxRange, float delayInSeconds); // Function Scavenger.S_AISense_Hail.ReportHailEvent // (Final|Native|Static|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_AISenseConfig_Hail
// Size: 0x48 (Inherited: 0x48)
struct US_AISenseConfig_Hail : UAISenseConfig {
};

// Class Scavenger.S_AISense_Hearing
// Size: 0xe8 (Inherited: 0xe8)
struct US_AISense_Hearing : UAISense_Hearing {
};

// Class Scavenger.S_AISense_Sight
// Size: 0x150 (Inherited: 0x150)
struct US_AISense_Sight : UAISense_Sight {
};

// Class Scavenger.S_AreaVolumeBase
// Size: 0x2c0 (Inherited: 0x2c0)
struct AS_AreaVolumeBase : AVolume {
};

// Class Scavenger.S_AISmatterVolume
// Size: 0x2f8 (Inherited: 0x2c0)
struct AS_AISmatterVolume : AS_AreaVolumeBase {
	char pad_2C0[0x30]; // 0x2c0(0x30)
	struct FName OriginalActorLabel; // 0x2f0(0x08)
};

// Class Scavenger.S_Spawner
// Size: 0x3e0 (Inherited: 0x288)
struct AS_Spawner : AActor {
	char pad_288[0x4]; // 0x288(0x04)
	bool bAlwaysSpawnInPersistentLevel; // 0x28c(0x01)
	bool Sleeping; // 0x28d(0x01)
	char pad_28E[0x1]; // 0x28e(0x01)
	bool SpawnOneByOne; // 0x28f(0x01)
	bool OnlyUsePointsForSpawning; // 0x290(0x01)
	bool OnlyUsePointsForReplenish; // 0x291(0x01)
	char pad_292[0x2]; // 0x292(0x02)
	int32_t m_maximumNumberOfSpawnedActors; // 0x294(0x04)
	int32_t MaximumNumberInitiallySpawnedActors; // 0x298(0x04)
	struct FVector2D m_minimumTimeBetweenSpawns; // 0x29c(0x08)
	struct FVector2D m_minimumTimeAfterInitalSpawns; // 0x2a4(0x08)
	bool ReplenishmentActive; // 0x2ac(0x01)
	char pad_2AD[0x3]; // 0x2ad(0x03)
	int32_t MaxReplenishmentCount; // 0x2b0(0x04)
	bool SpawnOnNavigationMesh; // 0x2b4(0x01)
	char pad_2B5[0x3]; // 0x2b5(0x03)
	float FallbackSpawnRadius; // 0x2b8(0x04)
	float FallbackSpawnHeight; // 0x2bc(0x04)
	float FitPointToGroundRaycastHeight; // 0x2c0(0x04)
	float FitPointToGroundTraceLength; // 0x2c4(0x04)
	float ActiveRadius; // 0x2c8(0x04)
	float InactiveRadius; // 0x2cc(0x04)
	float DefaultPointBlockingRadius; // 0x2d0(0x04)
	bool AllowSpawnWithPlayersInside; // 0x2d4(0x01)
	bool FitSpawnPointsToGround; // 0x2d5(0x01)
	bool ShouldOverrideVerticalOffset; // 0x2d6(0x01)
	char pad_2D7[0x1]; // 0x2d7(0x01)
	float VerticalOffsetOverride; // 0x2d8(0x04)
	char pad_2DC[0x4]; // 0x2dc(0x04)
	struct FSoftObjectPath DataTableAssetReference; // 0x2e0(0x18)
	struct TSoftObjectPtr<struct UDataTable> SpawnDataTable; // 0x2f8(0x28)
	struct UDataTable* m_spawnDataTable; // 0x320(0x08)
	struct TArray<struct FS_SpawnPoints> SpawnPoints; // 0x328(0x10)
	struct UBillboardComponent* TransformComponent; // 0x338(0x08)
	char pad_340[0xc]; // 0x340(0x0c)
	int32_t TotalSpawnedCount; // 0x34c(0x04)
	int32_t TotalReplenishedCount; // 0x350(0x04)
	char pad_354[0x24]; // 0x354(0x24)
	struct TMap<struct FString, struct FSpawnTable> SpawnDataTables; // 0x378(0x50)
	struct TArray<struct AActor*> m_spawnedActors; // 0x3c8(0x10)
	char pad_3D8[0x8]; // 0x3d8(0x08)

	int32_t SpawnActorsManually(int32_t numberOfActors); // Function Scavenger.S_Spawner.SpawnActorsManually // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void SetSpawnerObjectOpen(bool Open); // Function Scavenger.S_Spawner.SetSpawnerObjectOpen // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0xffff8008e4a10000
	void SetReplenishActive(bool NewValue); // Function Scavenger.S_Spawner.SetReplenishActive // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void RequestLoadDataTables(); // Function Scavenger.S_Spawner.RequestLoadDataTables // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void InitializeDataTables(); // Function Scavenger.S_Spawner.InitializeDataTables // (Final|Native|Protected) // @ game+0xffff8008e4a10000
	void GetSpawnedActors(struct TArray<struct AActor*> outActorArray); // Function Scavenger.S_Spawner.GetSpawnedActors // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	void DespawnAllActorsAndReset(); // Function Scavenger.S_Spawner.DespawnAllActorsAndReset // (Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void BuildSpawnPointsFromTransforms(struct TArray<struct FTransform> Transforms); // Function Scavenger.S_Spawner.BuildSpawnPointsFromTransforms // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_AISpawner
// Size: 0x4d0 (Inherited: 0x3e0)
struct AS_AISpawner : AS_Spawner {
	float LocationQueryAdditionalRadius; // 0x3e0(0x04)
	bool UseLocationQueryAdditionalRadius; // 0x3e4(0x01)
	char pad_3E5[0x3]; // 0x3e5(0x03)
	struct FName StartingArea; // 0x3e8(0x08)
	bool PatrolOverride; // 0x3f0(0x01)
	bool UseInactiveRadiusForPerceptionCalculation; // 0x3f1(0x01)
	bool ShouldStartIgnoredByAI; // 0x3f2(0x01)
	bool bIsDynamicSpawnPoint; // 0x3f3(0x01)
	char pad_3F4[0xc]; // 0x3f4(0x0c)
	struct FS_SpawnPoints DynamicSpawnPointTemplate; // 0x400(0xb0)
	int32_t DynamicSpawnPointCount; // 0x4b0(0x04)
	int32_t MaxDynamicAICount; // 0x4b4(0x04)
	char pad_4B8[0x4]; // 0x4b8(0x04)
	struct FName OriginalActorLabel; // 0x4bc(0x08)
	char pad_4C4[0xc]; // 0x4c4(0x0c)

	int32_t SpawnAIAtLocation(int32_t numberOfActors, struct FTransform Transform, float SpawnRadius); // Function Scavenger.S_AISpawner.SpawnAIAtLocation // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0xffff8008e4a10000
	int32_t GetNumLivingAI(); // Function Scavenger.S_AISpawner.GetNumLivingAI // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_AITask_MoveTo
// Size: 0x118 (Inherited: 0x70)
struct US_AITask_MoveTo : UAITask {
	struct FMulticastInlineDelegate OnMoveFinished; // 0x70(0x10)
	enum class EPathFollowingResult MoveResult; // 0x80(0x01)
	enum class ENavPathEvent NavPathEvent; // 0x81(0x01)
	enum class EPathFollowingRequestResult PathFollowingRequestResult; // 0x82(0x01)
	char pad_83[0x5]; // 0x83(0x05)
	struct FAIMoveRequest MoveRequest; // 0x88(0x50)
	char pad_D8[0x40]; // 0xd8(0x40)

	float GetPathLength(); // Function Scavenger.S_AITask_MoveTo.GetPathLength // (Final|Native|Protected|BlueprintCallable) // @ game+0xffff8008e4a10000
	struct US_AITask_MoveTo* AIMoveTo(struct AAIController* Controller, struct FVector GoalLocation, struct AActor* GoalActor, float AcceptanceRadius, enum class EAIOptionFlag StopOnOverlap, enum class EAIOptionFlag AcceptPartialPath, bool bUsePathfinding, bool bLockAILogic, bool bUseContinuosGoalTracking, bool bStopMovementOnFinish, bool bProjectGoalOnNavigation, float MaxDistanceFromGoalActor, struct FVector OffsetFromLeader, bool bShouldDecelerateAtEndPoint); // Function Scavenger.S_AITask_MoveTo.AIMoveTo // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_AITask_Wildlife_MoveTo
// Size: 0x128 (Inherited: 0x118)
struct US_AITask_Wildlife_MoveTo : US_AITask_MoveTo {
	char pad_118[0x10]; // 0x118(0x10)

	struct US_AITask_Wildlife_MoveTo* AIWildlifeMoveTo(struct AAIController* Controller, struct FVector GoalLocation, struct AActor* GoalActor, float AcceptanceRadius, enum class EAIOptionFlag StopOnOverlap, enum class EAIOptionFlag AcceptPartialPath, bool bUsePathfinding, bool bLockAILogic, bool bUseContinuosGoalTracking, bool bStopMovementOnFinish, bool bProjectGoalOnNavigation, float MaxDistanceFromGoalActor, struct FVector OffsetFromLeader, bool bShouldDecelerateAtEndPoint, bool bAttemptWideTurnAround, float MinAngleForTurnAroundInDegrees, float TurnRadius); // Function Scavenger.S_AITask_Wildlife_MoveTo.AIWildlifeMoveTo // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_AITickManager
// Size: 0x728 (Inherited: 0xb0)
struct US_AITickManager : UActorComponent {
	char pad_B0[0x678]; // 0xb0(0x678)
};

// Class Scavenger.S_AITriggerVolume
// Size: 0x2e0 (Inherited: 0x2c0)
struct AS_AITriggerVolume : AS_AreaVolumeBase {
	char pad_2C0[0x18]; // 0x2c0(0x18)
	struct FName OriginalActorLabel; // 0x2d8(0x08)
};

// Class Scavenger.S_AkCallbackManager
// Size: 0xf0 (Inherited: 0x28)
struct US_AkCallbackManager : UObject {
	char pad_28[0xc8]; // 0x28(0xc8)
};

// Class Scavenger.S_AlphaPostProcessComponent
// Size: 0x240 (Inherited: 0x200)
struct US_AlphaPostProcessComponent : USceneComponent {
	int32_t DefaultAlphaScreenPercentage; // 0x1f8(0x04)
	struct TArray<struct UPrimitiveComponent*> m_screenAlignedPrimitives; // 0x200(0x10)
	char pad_214[0x2c]; // 0x214(0x2c)

	void RemoveStaticMesh(struct UStaticMeshComponent* StaticMeshComponent); // Function Scavenger.S_AlphaPostProcessComponent.RemoveStaticMesh // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void RemoveBillboard(struct UMaterialBillboardComponent* BillboardComponent); // Function Scavenger.S_AlphaPostProcessComponent.RemoveBillboard // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	struct UPrimitiveComponent* FindLayer(struct FName LayerName); // Function Scavenger.S_AlphaPostProcessComponent.FindLayer // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void ClearLayers(); // Function Scavenger.S_AlphaPostProcessComponent.ClearLayers // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	struct UMaterialBillboardComponent* AddWorldBillboard(struct UMaterialInterface* Material, int32_t SizeX, int32_t SizeY, bool isScreenSize, struct FName LayerName, int32_t sortIndex); // Function Scavenger.S_AlphaPostProcessComponent.AddWorldBillboard // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	struct UStaticMeshComponent* AddStaticMesh(struct UMaterialInterface* Material, struct UStaticMesh* StaticMesh, struct FName LayerName, int32_t sortIndex); // Function Scavenger.S_AlphaPostProcessComponent.AddStaticMesh // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	struct UStaticMeshComponent* AddSphere(struct UMaterialInterface* Material, struct FVector Origin, float Radius, struct FName LayerName, int32_t sortIndex); // Function Scavenger.S_AlphaPostProcessComponent.AddSphere // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0xffff8008e4a10000
	struct UMaterialBillboardComponent* AddScreenBillboard(struct UMaterialInterface* Material, int32_t SizeX, int32_t SizeY, struct FName LayerName, int32_t sortIndex); // Function Scavenger.S_AlphaPostProcessComponent.AddScreenBillboard // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	struct UStaticMeshComponent* AddFullscreenQuad(struct UMaterialInterface* Material, struct FName LayerName, int32_t sortIndex); // Function Scavenger.S_AlphaPostProcessComponent.AddFullscreenQuad // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	struct UStaticMeshComponent* AddBox(struct UMaterialInterface* Material, struct FVector Origin, struct FVector Extent, struct FName LayerName, int32_t sortIndex); // Function Scavenger.S_AlphaPostProcessComponent.AddBox // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_AmbianceComponent
// Size: 0x210 (Inherited: 0x200)
struct US_AmbianceComponent : USceneComponent {
	float m_ActivationRadius; // 0x1f8(0x04)
	struct US_AmbianceSystemComponent* m_AmbianceSystem; // 0x200(0x08)
	bool m_bFailedInit; // 0x208(0x01)
	bool m_bIsEnabled; // 0x209(0x01)
	char pad_20E[0x2]; // 0x20e(0x02)

	void SetIsEnabled(bool IsEnabled); // Function Scavenger.S_AmbianceComponent.SetIsEnabled // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool IsEnabled(); // Function Scavenger.S_AmbianceComponent.IsEnabled // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_AmbianceBedComponent
// Size: 0x230 (Inherited: 0x210)
struct US_AmbianceBedComponent : US_AmbianceComponent {
	struct US_AmbianceBedDataAsset* m_AmbianceBedAsset; // 0x210(0x08)
	bool m_bForceUnique; // 0x218(0x01)
	char pad_219[0x3]; // 0x219(0x03)
	struct FName m_GroupName; // 0x21c(0x08)
	char pad_224[0xc]; // 0x224(0x0c)

	struct FS_AmbianceBedData GetAmbianceBedData(); // Function Scavenger.S_AmbianceBedComponent.GetAmbianceBedData // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_AmbianceEmitterComponent
// Size: 0x230 (Inherited: 0x210)
struct US_AmbianceEmitterComponent : US_AmbianceComponent {
	struct TArray<struct FTransform> m_RandomEmitterTransforms; // 0x210(0x10)
	struct US_AmbianceEmitterDataAsset* m_AmbianceEmitterAsset; // 0x220(0x08)
	char pad_228[0x8]; // 0x228(0x08)

	struct FTransform GetRandomEmitterTransform(); // Function Scavenger.S_AmbianceEmitterComponent.GetRandomEmitterTransform // (Native|Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct FS_AmbianceEmitterData GetAmbianceEmitterData(); // Function Scavenger.S_AmbianceEmitterComponent.GetAmbianceEmitterData // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_AmbianceBedDataAsset
// Size: 0x40 (Inherited: 0x30)
struct US_AmbianceBedDataAsset : UDataAsset {
	struct FS_AmbianceBedData m_AmbianceBedData; // 0x30(0x10)
};

// Class Scavenger.S_AmbianceEmitterDataAsset
// Size: 0x40 (Inherited: 0x30)
struct US_AmbianceEmitterDataAsset : UDataAsset {
	struct FS_AmbianceEmitterData m_AmbianceEmitterData; // 0x30(0x10)
};

// Class Scavenger.S_AmbianceSystemComponent
// Size: 0x210 (Inherited: 0xb0)
struct US_AmbianceSystemComponent : UActorComponent {
	char pad_B0[0x20]; // 0xb0(0x20)
	struct TArray<struct US_AmbianceBedComponent*> TrackedAmbianceBedComponents; // 0xd0(0x10)
	struct TArray<struct US_AmbianceEmitterComponent*> TrackedAmbianceEmitterComponents; // 0xe0(0x10)
	char pad_F0[0x120]; // 0xf0(0x120)
};

// Class Scavenger.S_Animatable
// Size: 0x28 (Inherited: 0x28)
struct US_Animatable : UInterface {

	struct UAnimInstance* GetAnimInstance(); // Function Scavenger.S_Animatable.GetAnimInstance // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_AnimInstance
// Size: 0x370 (Inherited: 0x2c0)
struct US_AnimInstance : UAnimInstance {
	bool bSkipNextCriticalNotifies; // 0x2b8(0x01)
	char pad_2C1[0xaf]; // 0x2c1(0xaf)

	void ScavBlueprintUpdateFastPath(); // Function Scavenger.S_AnimInstance.ScavBlueprintUpdateFastPath // (Event|Public|BlueprintEvent) // @ game+0xffff8008e4a10000
	void ScavBlueprintUpdateAnimation(float DeltaSeconds); // Function Scavenger.S_AnimInstance.ScavBlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0xffff8008e4a10000
	void OnPreBoneFinalization_BP(); // Function Scavenger.S_AnimInstance.OnPreBoneFinalization_BP // (Event|Public|BlueprintEvent) // @ game+0xffff8008e4a10000
	void OnAttack_BP(enum class ES_WeaponSlot weaponSlot, enum class ES_TriggerType triggerType, enum class ES_AttackEvent attackEvent); // Function Scavenger.S_AnimInstance.OnAttack_BP // (Event|Public|BlueprintEvent) // @ game+0xffff8008e4a10000
	void OnAnimMontageEnded(struct UAnimMontage* Montage, bool bInterrupted, int32_t montageInstanceID); // Function Scavenger.S_AnimInstance.OnAnimMontageEnded // (Final|Native|Private) // @ game+0xffff8008e4a10000
	void OnAnimMontageBlendingOut(struct UAnimMontage* Montage, bool bInterrupted, int32_t montageInstanceID); // Function Scavenger.S_AnimInstance.OnAnimMontageBlendingOut // (Final|Native|Private) // @ game+0xffff8008e4a10000
	void OnAnimMontageBegin(struct UAnimMontage* Montage, int32_t montageInstanceID); // Function Scavenger.S_AnimInstance.OnAnimMontageBegin // (Final|Native|Private) // @ game+0xffff8008e4a10000
	bool IsPlayingRootMotionAnimation(); // Function Scavenger.S_AnimInstance.IsPlayingRootMotionAnimation // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool IsMontageQueuedOrActivelyPlaying(struct UAnimMontage* Montage); // Function Scavenger.S_AnimInstance.IsMontageQueuedOrActivelyPlaying // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	void HandleOnMontageEnded(struct UAnimMontage* Montage, bool bInterrupted, int32_t montageInstanceID); // Function Scavenger.S_AnimInstance.HandleOnMontageEnded // (Final|Native|Private) // @ game+0xffff8008e4a10000
	void HandleOnAllMontageInstancesEnded(); // Function Scavenger.S_AnimInstance.HandleOnAllMontageInstancesEnded // (Final|Native|Private) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_AnimNotifyBase
// Size: 0x40 (Inherited: 0x38)
struct US_AnimNotifyBase : UAnimNotify {
	bool m_Critical; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
};

// Class Scavenger.S_AnimNotify_AttackEventCurrentWeapon
// Size: 0x48 (Inherited: 0x40)
struct US_AnimNotify_AttackEventCurrentWeapon : US_AnimNotifyBase {
	enum class ES_AnimAttackEventType AttackEventType; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
};

// Class Scavenger.S_AnimNotify_AttackEventMelee
// Size: 0x90 (Inherited: 0x40)
struct US_AnimNotify_AttackEventMelee : US_AnimNotifyBase {
	enum class ES_AnimAttackEventType AttackEventType; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	struct FFloatInterval PitchInterval; // 0x44(0x08)
	float MinAngle; // 0x4c(0x04)
	float MaxAngle; // 0x50(0x04)
	float ForwardDistance; // 0x54(0x04)
	float AIForwardDistanceScalar; // 0x58(0x04)
	float HalfHeight; // 0x5c(0x04)
	struct FVector StartingOffset; // 0x60(0x0c)
	float DamageMultiplierOnNONCharacter; // 0x6c(0x04)
	float DamageMultiplier; // 0x70(0x04)
	struct FVector MeleeDirectionOverride; // 0x74(0x0c)
	bool IgnorePitch; // 0x80(0x01)
	char pad_81[0x7]; // 0x81(0x07)
	struct UAnimMontage* RecoilMontage; // 0x88(0x08)
};

// Class Scavenger.S_AnimNotify_AttackEventResetMelee
// Size: 0x48 (Inherited: 0x40)
struct US_AnimNotify_AttackEventResetMelee : US_AnimNotifyBase {
	enum class ES_AnimAttackEventType AttackEventType; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
};

// Class Scavenger.S_AnimNotify_AudioEventTag
// Size: 0x48 (Inherited: 0x40)
struct US_AnimNotify_AudioEventTag : US_AnimNotifyBase {
	struct US_AIAudioEventType* Event; // 0x40(0x08)
};

// Class Scavenger.S_AnimNotify_ChangeKeeperCloakState
// Size: 0x48 (Inherited: 0x40)
struct US_AnimNotify_ChangeKeeperCloakState : US_AnimNotifyBase {
	enum class ES_KeeperCloakState NewKeeperState; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
};

// Class Scavenger.SAN_WeaponEvent
// Size: 0x40 (Inherited: 0x40)
struct USAN_WeaponEvent : US_AnimNotifyBase {
};

// Class Scavenger.SAN_AttackEvent
// Size: 0x48 (Inherited: 0x40)
struct USAN_AttackEvent : USAN_WeaponEvent {
	enum class ES_AnimAttackEventType AttackEventType; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
};

// Class Scavenger.S_AnimNotify_CreateGrenade
// Size: 0x48 (Inherited: 0x48)
struct US_AnimNotify_CreateGrenade : USAN_AttackEvent {
};

// Class Scavenger.S_AnimNotify_DealAssassinationDamage
// Size: 0x40 (Inherited: 0x40)
struct US_AnimNotify_DealAssassinationDamage : US_AnimNotifyBase {
};

// Class Scavenger.S_AnimNotify_DealExecutionDamage
// Size: 0x58 (Inherited: 0x40)
struct US_AnimNotify_DealExecutionDamage : US_AnimNotifyBase {
	bool bIsFatal; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	float Damage; // 0x44(0x04)
	float CameraShakeScale; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
	struct UMatineeCameraShake* CameraShakeType; // 0x50(0x08)
};

// Class Scavenger.S_AnimNotify_EmotePlantItem
// Size: 0x40 (Inherited: 0x40)
struct US_AnimNotify_EmotePlantItem : US_AnimNotifyBase {
};

// Class Scavenger.S_AnimNotify_EmoteSpawnItem
// Size: 0xe0 (Inherited: 0x40)
struct US_AnimNotify_EmoteSpawnItem : US_AnimNotifyBase {
	struct AActor* SpawnedItemClass; // 0x40(0x08)
	float InLifespan; // 0x48(0x04)
	struct FName BannerParameterName; // 0x4c(0x08)
	struct FName EmblemParameterName; // 0x54(0x08)
	int32_t MaterialIndex; // 0x5c(0x04)
	struct FName SocketName; // 0x60(0x08)
	char pad_68[0x78]; // 0x68(0x78)
};

// Class Scavenger.S_AnimNotify_ExecutionCamera
// Size: 0x90 (Inherited: 0x40)
struct US_AnimNotify_ExecutionCamera : US_AnimNotifyBase {
	bool OverrideFovSetting; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	struct FS_CameraArmFOVSettings FovSettings; // 0x44(0x04)
	bool OverrideLengthSettings; // 0x48(0x01)
	char pad_49[0x3]; // 0x49(0x03)
	struct FS_CameraArmLengthSettings LengthSettings; // 0x4c(0x04)
	bool OverrideSocketOffsetSetting; // 0x50(0x01)
	char pad_51[0xf]; // 0x51(0x0f)
	struct FS_CamerArmSocketOffsetSettings SocketOffsetSetting; // 0x60(0x20)
	bool OverrideTargetOffsetSetting; // 0x80(0x01)
	char pad_81[0x3]; // 0x81(0x03)
	struct FS_CamerArmTranslationOffsetSettings TargetOffsetSetting; // 0x84(0x0c)
};

// Class Scavenger.S_AnimNotify_Foley
// Size: 0x50 (Inherited: 0x40)
struct US_AnimNotify_Foley : US_AnimNotifyBase {
	enum class ES_FoleyEvent FoleyType; // 0x40(0x01)
	bool IsVoice; // 0x41(0x01)
	char pad_42[0x2]; // 0x42(0x02)
	struct FName CustomName; // 0x44(0x08)
	char pad_4C[0x4]; // 0x4c(0x04)
};

// Class Scavenger.S_AnimNotify_Footstep
// Size: 0x48 (Inherited: 0x40)
struct US_AnimNotify_Footstep : US_AnimNotifyBase {
	enum class ES_FootstepWeight FootstepWeight; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
};

// Class Scavenger.S_AnimNotify_InfectedMontageFinished
// Size: 0x40 (Inherited: 0x40)
struct US_AnimNotify_InfectedMontageFinished : US_AnimNotifyBase {
};

// Class Scavenger.S_AnimNotify_KeeperAttachToSocket
// Size: 0x50 (Inherited: 0x40)
struct US_AnimNotify_KeeperAttachToSocket : US_AnimNotifyBase {
	float SocketBlendTime; // 0x40(0x04)
	struct FName SocketName; // 0x44(0x08)
	char pad_4C[0x4]; // 0x4c(0x04)
};

// Class Scavenger.S_AnimNotify_KeeperAttachToSpringArm
// Size: 0x48 (Inherited: 0x40)
struct US_AnimNotify_KeeperAttachToSpringArm : US_AnimNotifyBase {
	float SocketBlendTime; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class Scavenger.S_AnimNotify_KeeperPerformAction
// Size: 0x40 (Inherited: 0x40)
struct US_AnimNotify_KeeperPerformAction : US_AnimNotifyBase {
};

// Class Scavenger.S_AnimNotify_LeapLaunch
// Size: 0x40 (Inherited: 0x40)
struct US_AnimNotify_LeapLaunch : US_AnimNotifyBase {
};

// Class Scavenger.S_AnimNotify_MeleeSound
// Size: 0x48 (Inherited: 0x40)
struct US_AnimNotify_MeleeSound : US_AnimNotifyBase {
	enum class ES_MeleeSoundStrength Strength; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
};

// Class Scavenger.S_AnimNotify_PlayCameraShake
// Size: 0x58 (Inherited: 0x40)
struct US_AnimNotify_PlayCameraShake : US_AnimNotifyBase {
	struct UMatineeCameraShake* ShakeClass; // 0x40(0x08)
	float InnerRadius; // 0x48(0x04)
	float OuterRadius; // 0x4c(0x04)
	float Falloff; // 0x50(0x04)
	bool bOrientShakeTowardsEpicenter; // 0x54(0x01)
	char pad_55[0x3]; // 0x55(0x03)
};

// Class Scavenger.S_AnimNotify_PlayWeaponMontage
// Size: 0x48 (Inherited: 0x40)
struct US_AnimNotify_PlayWeaponMontage : US_AnimNotifyBase {
	struct UAnimMontage* WeaponMontage; // 0x40(0x08)
};

// Class Scavenger.S_AnimNotify_ReadyEventCurrentWeapon
// Size: 0x48 (Inherited: 0x40)
struct US_AnimNotify_ReadyEventCurrentWeapon : US_AnimNotifyBase {
	enum class ES_AnimReadyEvent EventType; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	float SocketBlendTime; // 0x44(0x04)
};

// Class Scavenger.S_AnimNotify_ReleaseGrenadeTrigger
// Size: 0x40 (Inherited: 0x40)
struct US_AnimNotify_ReleaseGrenadeTrigger : US_AnimNotifyBase {
};

// Class Scavenger.S_AnimNotify_ReloadEventCurrentWeapon
// Size: 0x48 (Inherited: 0x40)
struct US_AnimNotify_ReloadEventCurrentWeapon : US_AnimNotifyBase {
	enum class ES_AnimReloadEventType ReloadEventType; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
};

// Class Scavenger.S_AnimNotify_ReloadSound
// Size: 0x48 (Inherited: 0x40)
struct US_AnimNotify_ReloadSound : US_AnimNotifyBase {
	enum class ES_ReloadSound ReloadSound; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
};

// Class Scavenger.S_AnimNotify_ResetRunnerGravity
// Size: 0x40 (Inherited: 0x40)
struct US_AnimNotify_ResetRunnerGravity : US_AnimNotifyBase {
};

// Class Scavenger.S_AnimNotify_RunnerLeapLaunch
// Size: 0x40 (Inherited: 0x40)
struct US_AnimNotify_RunnerLeapLaunch : US_AnimNotifyBase {
};

// Class Scavenger.S_AnimNotify_SetBraindead
// Size: 0x48 (Inherited: 0x40)
struct US_AnimNotify_SetBraindead : US_AnimNotifyBase {
	bool SetBrainDead; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
};

// Class Scavenger.S_AnimNotify_SpawnMontageFinished
// Size: 0x40 (Inherited: 0x40)
struct US_AnimNotify_SpawnMontageFinished : US_AnimNotifyBase {
};

// Class Scavenger.S_AnimNotify_StowEventCurrentWeapon
// Size: 0x48 (Inherited: 0x40)
struct US_AnimNotify_StowEventCurrentWeapon : US_AnimNotifyBase {
	enum class ES_AnimStowEvent EventType; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	float SocketBlendTime; // 0x44(0x04)
};

// Class Scavenger.S_AnimNotify_TurnOnRagdoll
// Size: 0x40 (Inherited: 0x40)
struct US_AnimNotify_TurnOnRagdoll : US_AnimNotifyBase {
};

// Class Scavenger.S_AnimNotifyStateBase
// Size: 0x30 (Inherited: 0x30)
struct US_AnimNotifyStateBase : UAnimNotifyState {
};

// Class Scavenger.S_AnimNotifyState_AIBrainDead
// Size: 0x30 (Inherited: 0x30)
struct US_AnimNotifyState_AIBrainDead : US_AnimNotifyStateBase {
};

// Class Scavenger.S_AnimNotifyState_AssassinationSucc
// Size: 0x38 (Inherited: 0x30)
struct US_AnimNotifyState_AssassinationSucc : US_AnimNotifyStateBase {
	char pad_30[0x8]; // 0x30(0x08)
};

// Class Scavenger.S_AnimNotifyState_AttachMagToHand
// Size: 0x90 (Inherited: 0x30)
struct US_AnimNotifyState_AttachMagToHand : US_AnimNotifyStateBase {
	struct TMap<struct USkeletalMeshComponent*, struct FS_OriginalMagazineAttachInfo> AnimInstanceToAttachInfo; // 0x30(0x50)
	struct FName CharacterAttachSocket; // 0x80(0x08)
	float AttachmentBlendInTime; // 0x88(0x04)
	float AttachmentBlendOutTime; // 0x8c(0x04)
};

// Class Scavenger.S_AnimNotifyState_AttackSyncSucc
// Size: 0x38 (Inherited: 0x30)
struct US_AnimNotifyState_AttackSyncSucc : US_AnimNotifyStateBase {
	char pad_30[0x8]; // 0x30(0x08)
};

// Class Scavenger.S_AnimNotifyState_BlockAIControllerRotation
// Size: 0x38 (Inherited: 0x30)
struct US_AnimNotifyState_BlockAIControllerRotation : US_AnimNotifyStateBase {
	bool ResetControlRotationToPawnRotation; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// Class Scavenger.S_AnimNotifyState_CapsuleSucc
// Size: 0xa0 (Inherited: 0x30)
struct US_AnimNotifyState_CapsuleSucc : US_AnimNotifyStateBase {
	bool AIWindow; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	struct FFloatRange AllowedCapsuleSuccDistance; // 0x34(0x10)
	struct FFloatRange AllowedCapsuleSuccDistanceServer; // 0x44(0x10)
	struct FFloatRange CapsuleSuccAngleTolerance; // 0x54(0x10)
	struct FFloatRange CapsuleSuccAngleToleranceServer; // 0x64(0x10)
	struct FFloatRange DesiredEndingDistanceRange; // 0x74(0x10)
	struct FFloatRange AllowedCapsuleSuccSpeed; // 0x84(0x10)
	struct FFloatInterval AITargetMoveWithinAngleRange; // 0x94(0x08)
	float AITargetMoveToMaxSpeed; // 0x9c(0x04)
};

// Class Scavenger.S_AnimNotifyState_ChargeComboWindow
// Size: 0x40 (Inherited: 0x30)
struct US_AnimNotifyState_ChargeComboWindow : US_AnimNotifyStateBase {
	bool ForceMontageAtEnd; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
	struct UAnimMontage* Montage; // 0x38(0x08)
};

// Class Scavenger.S_AnimNotifyState_DisableInput
// Size: 0x38 (Inherited: 0x30)
struct US_AnimNotifyState_DisableInput : US_AnimNotifyStateBase {
	bool DisableAllInput; // 0x30(0x01)
	bool DisableMoveInput; // 0x31(0x01)
	bool DisableWeaponInput; // 0x32(0x01)
	bool DisableInteractInput; // 0x33(0x01)
	bool DisableUIInput; // 0x34(0x01)
	char pad_35[0x3]; // 0x35(0x03)
};

// Class Scavenger.S_AnimNotifyState_GiveGE
// Size: 0x40 (Inherited: 0x30)
struct US_AnimNotifyState_GiveGE : US_AnimNotifyStateBase {
	struct UGameplayEffect* AppliedEffect; // 0x30(0x08)
	float Level; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
};

// Class Scavenger.S_AnimNotifyState_MeleeRecoil
// Size: 0x68 (Inherited: 0x30)
struct US_AnimNotifyState_MeleeRecoil : US_AnimNotifyStateBase {
	float YawBegin; // 0x30(0x04)
	float PitchBegin; // 0x34(0x04)
	float YawEnd; // 0x38(0x04)
	float PitchEnd; // 0x3c(0x04)
	float RayDistance; // 0x40(0x04)
	struct FVector MeleeOffset; // 0x44(0x0c)
	struct UAnimMontage* RecoilMontage; // 0x50(0x08)
	float TickRate; // 0x58(0x04)
	char pad_5C[0xc]; // 0x5c(0x0c)
};

// Class Scavenger.S_AnimNotifyState_PoiseLock
// Size: 0x30 (Inherited: 0x30)
struct US_AnimNotifyState_PoiseLock : US_AnimNotifyStateBase {
};

// Class Scavenger.S_AnimNotifyState_SelectTarget
// Size: 0x48 (Inherited: 0x30)
struct US_AnimNotifyState_SelectTarget : US_AnimNotifyStateBase {
	struct FFloatInterval AllowedTargetDistanceFromAttacker; // 0x30(0x08)
	struct FFloatInterval AllowedTargetYawFromAttackerFacingDirection; // 0x38(0x08)
	float DistanceToAngleWeightRatio; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class Scavenger.S_VolumeComponent
// Size: 0x4e0 (Inherited: 0x4e0)
struct US_VolumeComponent : UStaticMeshComponent {

	void NotifyComponentEndOverlap(struct UPrimitiveComponent* ourComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComponent, int32_t OtherBodyIndex); // Function Scavenger.S_VolumeComponent.NotifyComponentEndOverlap // (Final|Native|Private) // @ game+0xffff8008e4a10000
	void NotifyComponentBeginOverlap(struct UPrimitiveComponent* ourComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComponent, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult HitResult); // Function Scavenger.S_VolumeComponent.NotifyComponentBeginOverlap // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_AreaVolumeComponentBase
// Size: 0x4e0 (Inherited: 0x4e0)
struct US_AreaVolumeComponentBase : US_VolumeComponent {
};

// Class Scavenger.S_AssassinationAbility
// Size: 0x3f0 (Inherited: 0x3b8)
struct US_AssassinationAbility : US_GameplayAbility {
	char pad_3B8[0x4]; // 0x3b8(0x04)
	float MaxAssassinationDistance; // 0x3bc(0x04)
	float MaxAssassinationConeAngle; // 0x3c0(0x04)
	float MaxAssassinationTargetBackConeAngle; // 0x3c4(0x04)
	struct UGameplayEffect* AttackerGameplayEffect; // 0x3c8(0x08)
	struct UGameplayEffect* VictimGameplayEffect; // 0x3d0(0x08)
	struct AS_AICharacter* m_target; // 0x3d8(0x08)
	char pad_3E0[0x10]; // 0x3e0(0x10)

	void OnMontageEnded(); // Function Scavenger.S_AssassinationAbility.OnMontageEnded // (Final|Native|Private) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_AssassinationMontagePackage
// Size: 0x6b0 (Inherited: 0x30)
struct US_AssassinationMontagePackage : UDataAsset {
	struct FS_WeaponAssassinationMontages WeaponClassDefaults[0x12]; // 0x30(0x630)
	struct TMap<SoftClassProperty, struct FS_WeaponAssassinationMontages> WeaponOverrides; // 0x660(0x50)
};

// Class Scavenger.S_AsyncSpringArmComponent
// Size: 0x290 (Inherited: 0x280)
struct US_AsyncSpringArmComponent : USpringArmComponent {
	char pad_280[0x10]; // 0x280(0x10)
};

// Class Scavenger.S_AttackEventMontagePackage
// Size: 0x130 (Inherited: 0x30)
struct US_AttackEventMontagePackage : UDataAsset {
	struct FS_CharacterStanceContainer CharacterStates[0x4]; // 0x30(0x100)
};

// Class Scavenger.S_CharacterMontagePackage
// Size: 0x620 (Inherited: 0x30)
struct US_CharacterMontagePackage : UDataAsset {
	struct FS_WeaponBaseMontagePackage WeaponClassMontagePackages[0x12]; // 0x30(0x5a0)
	struct TMap<SoftClassProperty, struct FS_WeaponBaseMontagePackage> WeaponOverrideMontagePackages; // 0x5d0(0x50)
};

// Class Scavenger.S_WeaponMontagePackage
// Size: 0xd0 (Inherited: 0x30)
struct US_WeaponMontagePackage : UDataAsset {
	struct FS_CharacterBaseMontagePackage DefaultCharacterMontagePackages; // 0x30(0x50)
	struct TMap<SoftClassProperty, struct FS_CharacterBaseMontagePackage> CharacterOverrideMontagePackages; // 0x80(0x50)
};

// Class Scavenger.S_WeaponAttachmentMontagePackage
// Size: 0x80 (Inherited: 0x30)
struct US_WeaponAttachmentMontagePackage : UDataAsset {
	struct TMap<enum class ES_WeaponMontageEvent, struct FS_WeaponAttachmentOverridePackages> EventMontagePackages; // 0x30(0x50)
};

// Class Scavenger.S_AttributeSetBase
// Size: 0x160 (Inherited: 0x30)
struct US_AttributeSetBase : UAttributeSet {
	struct FMulticastInlineDelegate OnAnyAttributeChanged; // 0x30(0x10)
	char pad_40[0x120]; // 0x40(0x120)

	bool Matches(struct FName AttributeName, struct FGameplayAttribute GameplayAttribute); // Function Scavenger.S_AttributeSetBase.Matches // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	float GetInitialAttributeValue(struct FName AttributeName, float notFoundValue); // Function Scavenger.S_AttributeSetBase.GetInitialAttributeValue // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	float GetAttributeValueWithWeaponClassContext(struct FName baseAttributeName, enum class ES_WeaponClass WeaponClass); // Function Scavenger.S_AttributeSetBase.GetAttributeValueWithWeaponClassContext // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	float GetAttributeValueWithIsUsingADSContext(struct FName baseAttributeName, bool bIsUsingADS); // Function Scavenger.S_AttributeSetBase.GetAttributeValueWithIsUsingADSContext // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	float GetAttributeValueWithChangeCauseContext(struct FName baseAttributeName, enum class ES_StatChangeCauseType changeCause); // Function Scavenger.S_AttributeSetBase.GetAttributeValueWithChangeCauseContext // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	float GetAttributeValue(struct FName AttributeName, float notFoundValue); // Function Scavenger.S_AttributeSetBase.GetAttributeValue // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	void AddAttributeChangedListener(struct FName AttributeName, struct FDelegate onAttributeChanged); // Function Scavenger.S_AttributeSetBase.AddAttributeChangedListener // (Final|Native|Public|BlueprintCallable|Const) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_AttributeSetActor
// Size: 0xe60 (Inherited: 0x160)
struct US_AttributeSetActor : US_AttributeSetBase {
	struct FS_GameplayAttributeData Armor; // 0x160(0x90)
	struct FS_GameplayAttributeData ArmorMaximum; // 0x1f0(0x90)
	struct FS_GameplayAttributeData ArmorPerLevel; // 0x280(0x90)
	struct FS_GameplayAttributeData Cloaked; // 0x310(0x90)
	struct FS_GameplayAttributeData DamageResistance; // 0x3a0(0x90)
	struct FS_GameplayAttributeData DamageResistanceExplosive; // 0x430(0x90)
	struct FS_GameplayAttributeData DamageResistanceFalling; // 0x4c0(0x90)
	struct FS_GameplayAttributeData DamageResistanceRadiation; // 0x550(0x90)
	struct FS_GameplayAttributeData Health; // 0x5e0(0x90)
	struct FS_GameplayAttributeData HealthMaximum; // 0x670(0x90)
	struct FS_GameplayAttributeData HealthRecoveryLimitMaximum; // 0x700(0x90)
	struct FS_GameplayAttributeData HealthRegenRate; // 0x790(0x90)
	struct FS_GameplayAttributeData HealthStunTime; // 0x820(0x90)
	struct FGameplayAttributeData Parameter_DamageAmount; // 0x8b0(0x10)
	struct FS_GameplayAttributeData Shield; // 0x8c0(0x90)
	struct FS_GameplayAttributeData ShieldMaximum; // 0x950(0x90)
	struct FS_GameplayAttributeData ShieldPercentRegenRate; // 0x9e0(0x90)
	struct FS_GameplayAttributeData ShieldRebootTimer; // 0xa70(0x90)
	struct FS_GameplayAttributeData ShieldStunTimer; // 0xb00(0x90)
	struct FS_GameplayAttributeData ShieldPercentL1; // 0xb90(0x90)
	struct FS_GameplayAttributeData ShieldPercentL2; // 0xc20(0x90)
	struct FS_GameplayAttributeData ShieldPercentL3; // 0xcb0(0x90)
	struct FS_GameplayAttributeData ShieldPercentL4; // 0xd40(0x90)
	struct FS_GameplayAttributeData ShieldPercentL5; // 0xdd0(0x90)

	void NotifyReplicatedShieldStunTimer(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetActor.NotifyReplicatedShieldStunTimer // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedShieldRebootTimer(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetActor.NotifyReplicatedShieldRebootTimer // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedShieldPercentRegenRate(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetActor.NotifyReplicatedShieldPercentRegenRate // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedShieldPercentL5(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetActor.NotifyReplicatedShieldPercentL5 // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedShieldPercentL4(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetActor.NotifyReplicatedShieldPercentL4 // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedShieldPercentL3(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetActor.NotifyReplicatedShieldPercentL3 // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedShieldPercentL2(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetActor.NotifyReplicatedShieldPercentL2 // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedShieldPercentL1(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetActor.NotifyReplicatedShieldPercentL1 // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedShieldMaximum(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetActor.NotifyReplicatedShieldMaximum // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedShield(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetActor.NotifyReplicatedShield // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedHealthStunTime(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetActor.NotifyReplicatedHealthStunTime // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedHealthRegenRate(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetActor.NotifyReplicatedHealthRegenRate // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedHealthRecoveryLimitMaximum(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetActor.NotifyReplicatedHealthRecoveryLimitMaximum // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedHealthMaximum(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetActor.NotifyReplicatedHealthMaximum // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedHealth(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetActor.NotifyReplicatedHealth // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedDamageResistanceRadiation(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetActor.NotifyReplicatedDamageResistanceRadiation // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedDamageResistanceFalling(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetActor.NotifyReplicatedDamageResistanceFalling // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedDamageResistanceExplosive(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetActor.NotifyReplicatedDamageResistanceExplosive // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedDamageResistance(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetActor.NotifyReplicatedDamageResistance // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedCloaked(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetActor.NotifyReplicatedCloaked // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedArmorPerLevel(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetActor.NotifyReplicatedArmorPerLevel // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedArmorMaximum(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetActor.NotifyReplicatedArmorMaximum // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedArmor(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetActor.NotifyReplicatedArmor // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_AttributeSetPawn
// Size: 0xe60 (Inherited: 0xe60)
struct US_AttributeSetPawn : US_AttributeSetActor {
};

// Class Scavenger.S_AttributeSetCharacter
// Size: 0x36e0 (Inherited: 0xe60)
struct US_AttributeSetCharacter : US_AttributeSetPawn {
	struct FS_GameplayAttributeData ColdResistance; // 0xe60(0x90)
	struct FS_GameplayAttributeData CollapsingStormFreezingHealthRecoveryLimitMaximumLossPerSecond; // 0xef0(0x90)
	struct FS_GameplayAttributeData DamageFractionToApplyToRecoveryLimit; // 0xf80(0x90)
	struct FS_GameplayAttributeData DamageMultiplier; // 0x1010(0x90)
	struct FS_GameplayAttributeData DamageMultiplierBoundsMax; // 0x10a0(0x90)
	struct FS_GameplayAttributeData DamageMultiplierBow; // 0x1130(0x90)
	struct FS_GameplayAttributeData DamageMultiplierExplosive; // 0x11c0(0x90)
	struct FS_GameplayAttributeData DamageMultiplierMelee; // 0x1250(0x90)
	struct FS_GameplayAttributeData DamageMultiplierPistol; // 0x12e0(0x90)
	struct FS_GameplayAttributeData DamageMultiplierRanged; // 0x1370(0x90)
	struct FS_GameplayAttributeData DamageMultiplierRifle; // 0x1400(0x90)
	struct FS_GameplayAttributeData DamageMultiplierShotgun; // 0x1490(0x90)
	struct FS_GameplayAttributeData DamageOverTimeAcidCount; // 0x1520(0x90)
	struct FS_GameplayAttributeData DamageOverTimeBleedCount; // 0x15b0(0x90)
	struct FS_GameplayAttributeData DamageOverTimeFireCount; // 0x1640(0x90)
	struct FS_GameplayAttributeData DamageOverTimePlasmaCount; // 0x16d0(0x90)
	struct FS_GameplayAttributeData DamageOverTimePoisonCount; // 0x1760(0x90)
	struct FS_GameplayAttributeData DodgeCooldownSpeedMultiplier; // 0x17f0(0x90)
	struct FS_GameplayAttributeData DownedStateBleedOutSpeedMultiplier; // 0x1880(0x90)
	struct FS_GameplayAttributeData ExhaustionDebuffDurationInSeconds; // 0x1910(0x90)
	struct FS_GameplayAttributeData FireSpeedMultiplier; // 0x19a0(0x90)
	struct FS_GameplayAttributeData FireSpeedMultiplierMelee; // 0x1a30(0x90)
	struct FS_GameplayAttributeData FireSpeedMultiplierMeleeMaximum; // 0x1ac0(0x90)
	struct FS_GameplayAttributeData FireSpeedMultiplierPistol; // 0x1b50(0x90)
	struct FS_GameplayAttributeData FlinchMultiplier; // 0x1be0(0x90)
	struct FS_GameplayAttributeData FlinchADSMultiplier; // 0x1c70(0x90)
	struct FS_GameplayAttributeData FoodHealthBonusMultiplier; // 0x1d00(0x90)
	struct FS_GameplayAttributeData FoodHealthBonusMultiplierRaw; // 0x1d90(0x90)
	struct FS_GameplayAttributeData FreezingHealthRecoveryLimitMaximumLossPerSecond; // 0x1e20(0x90)
	struct FS_GameplayAttributeData HealthRecoveryLimit; // 0x1eb0(0x90)
	struct FS_GameplayAttributeData Hunger; // 0x1f40(0x90)
	struct FS_GameplayAttributeData InventoryStackSizeMultiplier; // 0x1fd0(0x90)
	struct FS_GameplayAttributeData LootAmountMultiplierAnimal; // 0x2060(0x90)
	struct FS_GameplayAttributeData MovementAbilitySpeedMultiplier; // 0x20f0(0x90)
	struct FS_GameplayAttributeData MovementSpeedADSMultiplier; // 0x2180(0x90)
	struct FS_GameplayAttributeData MovementSpeedCrouch; // 0x2210(0x90)
	struct FS_GameplayAttributeData MovementSpeedDownedMultiplier; // 0x22a0(0x90)
	struct FS_GameplayAttributeData MovementSpeedMultiplier; // 0x2330(0x90)
	struct FS_GameplayAttributeData MovementSpeedSprintBonus; // 0x23c0(0x90)
	struct FS_GameplayAttributeData MovementSpeedWalk; // 0x2450(0x90)
	struct FS_GameplayAttributeData Radiation; // 0x24e0(0x90)
	struct FS_GameplayAttributeData RadiationMaximum; // 0x2570(0x90)
	struct FS_GameplayAttributeData RecoilADSMultiplier; // 0x2600(0x90)
	struct FS_GameplayAttributeData RecoilHipfireMultiplier; // 0x2690(0x90)
	struct FS_GameplayAttributeData ReloadSpeedMultiplier; // 0x2720(0x90)
	struct FS_GameplayAttributeData ReviveSpeedMultiplier; // 0x27b0(0x90)
	struct FS_GameplayAttributeData SpreadPerShotADSMultiplier; // 0x2840(0x90)
	struct FS_GameplayAttributeData SpreadPerShotHipfireMultiplier; // 0x28d0(0x90)
	struct FS_GameplayAttributeData SpreadRateMovingMultiplier; // 0x2960(0x90)
	struct FS_GameplayAttributeData SpreadRateSteadyMultiplier; // 0x29f0(0x90)
	struct FS_GameplayAttributeData SpreadMaxADSMultiplier; // 0x2a80(0x90)
	struct FS_GameplayAttributeData SpreadMaxHipfireMultiplier; // 0x2b10(0x90)
	struct FS_GameplayAttributeData Stamina; // 0x2ba0(0x90)
	struct FS_GameplayAttributeData StaminaCostFractionAppliedToHunger; // 0x2c30(0x90)
	struct FS_GameplayAttributeData StaminaCostToDodge; // 0x2cc0(0x90)
	struct FS_GameplayAttributeData StaminaCostToSlide; // 0x2d50(0x90)
	struct FS_GameplayAttributeData StaminaCostToJump; // 0x2de0(0x90)
	struct FS_GameplayAttributeData StaminaCostToMantle; // 0x2e70(0x90)
	struct FS_GameplayAttributeData StaminaCostToMeleeHeavy; // 0x2f00(0x90)
	struct FS_GameplayAttributeData StaminaCostToMeleeLight; // 0x2f90(0x90)
	struct FS_GameplayAttributeData StaminaCostToSprintPerSecond; // 0x3020(0x90)
	struct FS_GameplayAttributeData StaminaMaximum; // 0x30b0(0x90)
	struct FS_GameplayAttributeData StaminaRecoveryPerSecond; // 0x3140(0x90)
	struct FS_GameplayAttributeData StaminaStunTimeInSeconds; // 0x31d0(0x90)
	struct FS_GameplayAttributeData Temperature; // 0x3260(0x90)
	struct FS_GameplayAttributeData TemperatureDangerThreshold; // 0x32f0(0x90)
	struct FS_GameplayAttributeData TemperatureMaximum; // 0x3380(0x90)
	struct FS_GameplayAttributeData WarmingHealthRecoveryLimitMaximumGainPerSecond; // 0x3410(0x90)
	struct FS_GameplayAttributeData WeaponReadySpeedMultiplier; // 0x34a0(0x90)
	struct FS_GameplayAttributeData WeaponReadySpeedMultiplierMelee; // 0x3530(0x90)
	struct FS_GameplayAttributeData WeaponStowSpeedMultiplier; // 0x35c0(0x90)
	struct FS_GameplayAttributeData WeaponStowSpeedMultiplierMelee; // 0x3650(0x90)

	void NotifyReplicatedWeaponStowSpeedMultiplierMelee(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedWeaponStowSpeedMultiplierMelee // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedWeaponStowSpeedMultiplier(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedWeaponStowSpeedMultiplier // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedWeaponReadySpeedMultiplierMelee(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedWeaponReadySpeedMultiplierMelee // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedWeaponReadySpeedMultiplier(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedWeaponReadySpeedMultiplier // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedWarmingHealthRecoveryLimitMaximumGainPerSecond(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedWarmingHealthRecoveryLimitMaximumGainPerSecond // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedTemperatureMaximum(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedTemperatureMaximum // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedTemperatureDangerThreshold(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedTemperatureDangerThreshold // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedTemperature(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedTemperature // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedStaminaStunTimeInSeconds(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedStaminaStunTimeInSeconds // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedStaminaRecoveryPerSecond(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedStaminaRecoveryPerSecond // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedStaminaMaximum(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedStaminaMaximum // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedStaminaCostToSprintPerSecond(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedStaminaCostToSprintPerSecond // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedStaminaCostToSlide(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedStaminaCostToSlide // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedStaminaCostToMeleeLight(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedStaminaCostToMeleeLight // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedStaminaCostToMeleeHeavy(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedStaminaCostToMeleeHeavy // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedStaminaCostToMantle(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedStaminaCostToMantle // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedStaminaCostToJump(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedStaminaCostToJump // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedStaminaCostToDodge(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedStaminaCostToDodge // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedStaminaCostFractionAppliedToHunger(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedStaminaCostFractionAppliedToHunger // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedStamina(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedStamina // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedSpreadRateSteadyMultiplier(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedSpreadRateSteadyMultiplier // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedSpreadRateMovingMultiplier(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedSpreadRateMovingMultiplier // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedSpreadPerShotHipfireMultiplier(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedSpreadPerShotHipfireMultiplier // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedSpreadPerShotADSMultiplier(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedSpreadPerShotADSMultiplier // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedSpreadMaxHipfireMultiplier(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedSpreadMaxHipfireMultiplier // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedSpreadMaxADSMultiplier(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedSpreadMaxADSMultiplier // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedReviveSpeedMultiplier(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedReviveSpeedMultiplier // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedReloadSpeedMultiplier(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedReloadSpeedMultiplier // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedRecoilHipfireMultiplier(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedRecoilHipfireMultiplier // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedRecoilADSMultiplier(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedRecoilADSMultiplier // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedRadiationMaximum(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedRadiationMaximum // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedRadiation(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedRadiation // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedMovementSpeedWalk(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedMovementSpeedWalk // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedMovementSpeedSprintBonus(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedMovementSpeedSprintBonus // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedMovementSpeedMultiplier(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedMovementSpeedMultiplier // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedMovementSpeedDownedMultiplier(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedMovementSpeedDownedMultiplier // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedMovementSpeedCrouch(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedMovementSpeedCrouch // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedMovementSpeedADSMultiplier(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedMovementSpeedADSMultiplier // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedMovementAbilitySpeedMultiplier(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedMovementAbilitySpeedMultiplier // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedLootAmountMultiplierAnimal(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedLootAmountMultiplierAnimal // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedInventoryStackSizeMultiplier(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedInventoryStackSizeMultiplier // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedHunger(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedHunger // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedHealthRecoveryLimit(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedHealthRecoveryLimit // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedFreezingHealthRecoveryLimitMaximumLossPerSecond(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedFreezingHealthRecoveryLimitMaximumLossPerSecond // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedFoodHealthBonusMultiplierRaw(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedFoodHealthBonusMultiplierRaw // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedFoodHealthBonusMultiplier(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedFoodHealthBonusMultiplier // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedFlinchMultiplier(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedFlinchMultiplier // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedFlinchADSMultiplier(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedFlinchADSMultiplier // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedFireSpeedMultiplierPistol(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedFireSpeedMultiplierPistol // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedFireSpeedMultiplierMeleeMaximum(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedFireSpeedMultiplierMeleeMaximum // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedFireSpeedMultiplierMelee(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedFireSpeedMultiplierMelee // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedFireSpeedMultiplier(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedFireSpeedMultiplier // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedExhaustionDebuffDurationInSeconds(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedExhaustionDebuffDurationInSeconds // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedDownedStateBleedOutSpeedMultiplier(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedDownedStateBleedOutSpeedMultiplier // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedDodgeCooldownSpeedMultiplier(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedDodgeCooldownSpeedMultiplier // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedDamageOverTimePoisonCount(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedDamageOverTimePoisonCount // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedDamageOverTimePlasmaCount(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedDamageOverTimePlasmaCount // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedDamageOverTimeFireCount(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedDamageOverTimeFireCount // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedDamageOverTimeBleedCount(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedDamageOverTimeBleedCount // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedDamageOverTimeAcidCount(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedDamageOverTimeAcidCount // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedDamageMultiplierShotgun(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedDamageMultiplierShotgun // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedDamageMultiplierRifle(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedDamageMultiplierRifle // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedDamageMultiplierRanged(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedDamageMultiplierRanged // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedDamageMultiplierPistol(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedDamageMultiplierPistol // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedDamageMultiplierMelee(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedDamageMultiplierMelee // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedDamageMultiplierExplosive(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedDamageMultiplierExplosive // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedDamageMultiplierBow(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedDamageMultiplierBow // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedDamageMultiplierBoundsMax(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedDamageMultiplierBoundsMax // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedDamageMultiplier(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedDamageMultiplier // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedDamageFractionToApplyToRecoveryLimit(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedDamageFractionToApplyToRecoveryLimit // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedCollapsingStormFreezingHealthRecoveryLimitMaximumLossPerSecond(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedCollapsingStormFreezingHealthRecoveryLimitMaximumLossPerSecond // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void NotifyReplicatedColdResistance(struct FS_GameplayAttributeData oldGameplayAttributeData); // Function Scavenger.S_AttributeSetCharacter.NotifyReplicatedColdResistance // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_AttributeSetAICharacter
// Size: 0x36e0 (Inherited: 0x36e0)
struct US_AttributeSetAICharacter : US_AttributeSetCharacter {
};

// Class Scavenger.S_AttributeSetPlayerCharacter
// Size: 0x36e0 (Inherited: 0x36e0)
struct US_AttributeSetPlayerCharacter : US_AttributeSetAICharacter {
};

// Class Scavenger.S_AttributeSetVehicle
// Size: 0xe60 (Inherited: 0xe60)
struct US_AttributeSetVehicle : US_AttributeSetPawn {
};

// Class Scavenger.S_AudioImpactHandler
// Size: 0x28 (Inherited: 0x28)
struct US_AudioImpactHandler : UInterface {
};

// Class Scavenger.S_AudioSettings
// Size: 0x70 (Inherited: 0x38)
struct US_AudioSettings : UDeveloperSettings {
	float WhizByDetectionRadius; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
	struct TArray<struct FName> DialogueVoice; // 0x40(0x10)
	struct TArray<struct FName> DialogueEvent; // 0x50(0x10)
	struct TArray<struct FName> DialogueContext; // 0x60(0x10)

	struct FName GetDialogueVoice(struct FName Voice); // Function Scavenger.S_AudioSettings.GetDialogueVoice // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0xffff8008e4a10000
	struct FName GetDialogueEvent(struct FName Event); // Function Scavenger.S_AudioSettings.GetDialogueEvent // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0xffff8008e4a10000
	struct FName GetDialogueContext(struct FName Context); // Function Scavenger.S_AudioSettings.GetDialogueContext // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_AudioUtils
// Size: 0x28 (Inherited: 0x28)
struct US_AudioUtils : UBlueprintFunctionLibrary {

	int32_t PostSubtitledEvent(struct UObject* WorldContextObject, struct UAkAudioEvent* AkEvent, struct FText SpeakerName, struct FDelegate PostEventCallback, struct FString EventName); // Function Scavenger.S_AudioUtils.PostSubtitledEvent // (Final|BlueprintCosmetic|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool IsLocallyControlledOrSpectated(struct AActor* Actor); // Function Scavenger.S_AudioUtils.IsLocallyControlledOrSpectated // (Final|Native|Static|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool IsActorFriendlyToListener(struct AActor* Actor); // Function Scavenger.S_AudioUtils.IsActorFriendlyToListener // (Final|Native|Static|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_AutoHarvestedFoliageActor
// Size: 0x2a8 (Inherited: 0x288)
struct AS_AutoHarvestedFoliageActor : AActor {
	struct UStaticMeshComponent* m_staticMeshComponent; // 0x288(0x08)
	char pad_290[0x8]; // 0x290(0x08)
	float PhysicsDurationInSeconds; // 0x298(0x04)
	float SinkDurationInSeconds; // 0x29c(0x04)
	float DistanceToSink; // 0x2a0(0x04)
	char pad_2A4[0x4]; // 0x2a4(0x04)
};

// Class Scavenger.S_ItemBase
// Size: 0x448 (Inherited: 0x288)
struct AS_ItemBase : AActor {
	char pad_288[0x8]; // 0x288(0x08)
	bool bAllowSkinning; // 0x290(0x01)
	char pad_291[0x7]; // 0x291(0x07)
	struct FS_ItemState ItemState; // 0x298(0x40)
	struct FS_CosmeticLoadoutSlot m_cosmeticLoadoutSlot; // 0x2d8(0x28)
	struct US_CosmeticSkinningComponent* m_cosmeticSkinningComponent; // 0x300(0x08)
	struct USC_SkeletalMeshComponent* m_cosmeticAttachmentComponent; // 0x308(0x08)
	struct TSoftObjectPtr<struct USkeletalMesh> m_loadingCosmeticAttachmentMesh; // 0x310(0x28)
	char pad_338[0x10]; // 0x338(0x10)
	struct TMap<struct FName, struct USC_SkeletalMeshComponent*> m_socketSpecificCosmeticAttachmentComponents; // 0x348(0x50)
	char pad_398[0x50]; // 0x398(0x50)
	struct TMap<struct FName, struct FS_CosmeticItemMetadataItemSocketAttachmentCustomization> m_socketNameToLoadingSocketSpecificCosmeticAttachmentMesh; // 0x3e8(0x50)
	char pad_438[0x10]; // 0x438(0x10)

	void SetItemStatValue(enum class ES_ItemStatType itemStatType, float Value); // Function Scavenger.S_ItemBase.SetItemStatValue // (Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void SetItemStats(struct FS_ItemStats ItemStats); // Function Scavenger.S_ItemBase.SetItemStats // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	void NotifyReplicatedItemState(); // Function Scavenger.S_ItemBase.NotifyReplicatedItemState // (Final|Native|Protected) // @ game+0xffff8008e4a10000
	float GetItemStatValue(enum class ES_ItemStatType itemStatType); // Function Scavenger.S_ItemBase.GetItemStatValue // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct FS_ItemState GetItemState(); // Function Scavenger.S_ItemBase.GetItemState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct FName GetItemId(); // Function Scavenger.S_ItemBase.GetItemId // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct US_ItemData* GetItemData(); // Function Scavenger.S_ItemBase.GetItemData // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_AutoPickupItem
// Size: 0x450 (Inherited: 0x448)
struct AS_AutoPickupItem : AS_ItemBase {
	struct UStaticMeshComponent* m_meshComponent; // 0x448(0x08)

	void NotifyValidPlayerOverlap_BP(struct AS_PlayerCharacter* playerCharacter); // Function Scavenger.S_AutoPickupItem.NotifyValidPlayerOverlap_BP // (Event|Public|BlueprintEvent) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_AutoPingComponent
// Size: 0x200 (Inherited: 0xb0)
struct US_AutoPingComponent : UActorComponent {
	enum class ES_AutoPingNotificationType AutoPingNotificationType; // 0xb0(0x01)
	enum class ES_AutoPingType AutoPingType; // 0xb1(0x01)
	bool bIsOwnedByAllPlayers; // 0xb2(0x01)
	bool bIsOwnedByAllTeams; // 0xb3(0x01)
	bool bDoesOverrideObjectiveLocation; // 0xb4(0x01)
	char pad_B5[0x3]; // 0xb5(0x03)
	struct FVector LocationOffset; // 0xb8(0x0c)
	float OffscreenTracking; // 0xc4(0x04)
	int32_t Priority; // 0xc8(0x04)
	bool bShouldRePing; // 0xcc(0x01)
	bool bShouldStartEnabled; // 0xcd(0x01)
	char pad_CE[0x2]; // 0xce(0x02)
	float VisibleDistance; // 0xd0(0x04)
	float SwapDistance; // 0xd4(0x04)
	float VisibleDistanceRemovalScalar; // 0xd8(0x04)
	char pad_DC[0x4]; // 0xdc(0x04)
	struct TMap<struct AS_PlayerController*, struct FS_PingItemHandle> m_mapOfPlayerControllerToPingItemHandle; // 0xe0(0x50)
	char pad_130[0x28]; // 0x130(0x28)
	struct TSet<struct AS_PlayerController*> m_owningPlayers; // 0x158(0x50)
	char pad_1A8[0x58]; // 0x1a8(0x58)

	void SetVisibleDistance(float Distance); // Function Scavenger.S_AutoPingComponent.SetVisibleDistance // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool SetUniqueOwningTeam(int32_t TeamIndex); // Function Scavenger.S_AutoPingComponent.SetUniqueOwningTeam // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool SetUniqueOwningPlayer(struct AS_PlayerController* PlayerController); // Function Scavenger.S_AutoPingComponent.SetUniqueOwningPlayer // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void SetShouldRePing(bool shouldRePing); // Function Scavenger.S_AutoPingComponent.SetShouldRePing // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool SetPriority(int32_t Priority); // Function Scavenger.S_AutoPingComponent.SetPriority // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool SetIsOwnedByAllTeams(bool isOwnedByAllTeams); // Function Scavenger.S_AutoPingComponent.SetIsOwnedByAllTeams // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool SetIsOwnedByAllPlayers(bool isOwnedByAllPlayers); // Function Scavenger.S_AutoPingComponent.SetIsOwnedByAllPlayers // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void SetEnabled(bool IsEnabled); // Function Scavenger.S_AutoPingComponent.SetEnabled // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void RemovePingItem(struct AS_PlayerController* PlayerController); // Function Scavenger.S_AutoPingComponent.RemovePingItem // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool RemoveOwningTeam(int32_t TeamIndex); // Function Scavenger.S_AutoPingComponent.RemoveOwningTeam // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool RemoveOwningPlayer(struct AS_PlayerController* PlayerController); // Function Scavenger.S_AutoPingComponent.RemoveOwningPlayer // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void RemoveAllPingItems(); // Function Scavenger.S_AutoPingComponent.RemoveAllPingItems // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool PingItem(struct AS_PlayerController* PlayerController); // Function Scavenger.S_AutoPingComponent.PingItem // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void InternalHandleTeamCountChanged(int32_t newTeamCount); // Function Scavenger.S_AutoPingComponent.InternalHandleTeamCountChanged // (Final|Native|Private) // @ game+0xffff8008e4a10000
	void InternalHandlePlayerLogin(struct FS_EventParameterControllerVariant PlayerController); // Function Scavenger.S_AutoPingComponent.InternalHandlePlayerLogin // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void HandleEncounterAutoPingsChanged(struct AS_PlayerController* PlayerController, bool bIsEnabled); // Function Scavenger.S_AutoPingComponent.HandleEncounterAutoPingsChanged // (Final|Native|Public) // @ game+0xffff8008e4a10000
	float GetVisibleDistanceRemovalScalar(); // Function Scavenger.S_AutoPingComponent.GetVisibleDistanceRemovalScalar // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	float GetVisibleDistance(); // Function Scavenger.S_AutoPingComponent.GetVisibleDistance // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	float GetSwapDistance(); // Function Scavenger.S_AutoPingComponent.GetSwapDistance // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool GetShouldRePing(); // Function Scavenger.S_AutoPingComponent.GetShouldRePing // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	int32_t GetPriority(); // Function Scavenger.S_AutoPingComponent.GetPriority // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	float GetOffscreenTracking(); // Function Scavenger.S_AutoPingComponent.GetOffscreenTracking // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct FVector GetObjectiveLocation(); // Function Scavenger.S_AutoPingComponent.GetObjectiveLocation // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct AActor* GetObjectiveActor(); // Function Scavenger.S_AutoPingComponent.GetObjectiveActor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct FVector GetLocationOffset(); // Function Scavenger.S_AutoPingComponent.GetLocationOffset // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool GetIsOwningTeam(int32_t TeamIndex); // Function Scavenger.S_AutoPingComponent.GetIsOwningTeam // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool GetIsOwningPlayer(struct AS_PlayerController* PlayerController); // Function Scavenger.S_AutoPingComponent.GetIsOwningPlayer // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool GetIsOwnedByAllTeams(); // Function Scavenger.S_AutoPingComponent.GetIsOwnedByAllTeams // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool GetIsOwnedByAllPlayers(); // Function Scavenger.S_AutoPingComponent.GetIsOwnedByAllPlayers // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool GetIsEnabled(); // Function Scavenger.S_AutoPingComponent.GetIsEnabled // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool GetIsChangeAllowed(); // Function Scavenger.S_AutoPingComponent.GetIsChangeAllowed // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool GetDoesOverrideObjectiveLocation(); // Function Scavenger.S_AutoPingComponent.GetDoesOverrideObjectiveLocation // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	enum class ES_AutoPingType GetAutoPingType(); // Function Scavenger.S_AutoPingComponent.GetAutoPingType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	enum class ES_AutoPingNotificationType GetAutoPingNotificationType(); // Function Scavenger.S_AutoPingComponent.GetAutoPingNotificationType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool EvaluatePing_BP(struct AS_PlayerController* PlayerController); // Function Scavenger.S_AutoPingComponent.EvaluatePing_BP // (Event|Public|BlueprintEvent) // @ game+0xffff8008e4a10000
	bool AddOwningTeam(int32_t TeamIndex); // Function Scavenger.S_AutoPingComponent.AddOwningTeam // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool AddOwningPlayer(struct AS_PlayerController* PlayerController); // Function Scavenger.S_AutoPingComponent.AddOwningPlayer // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_AutoPingManagerComponent
// Size: 0x250 (Inherited: 0xb0)
struct US_AutoPingManagerComponent : UActorComponent {
	struct TArray<struct FS_AutoPingChannel> AutoPingChannels; // 0xb0(0x10)
	float PlayerPingProcessDelayTime; // 0xc0(0x04)
	char pad_C4[0xc]; // 0xc4(0x0c)
	struct TMap<int32_t, struct FS_AutoPingPriorityContainer> m_mapOfPriorityToPriorityContainer; // 0xd0(0x50)
	char pad_120[0x20]; // 0x120(0x20)
	struct TMap<struct AS_PlayerController*, struct FS_AutoPingCounts> m_mapOfPlayerControllerToAutoPingCounts; // 0x140(0x50)
	struct TMap<struct AS_PlayerController*, struct FS_AutoPingCounts> m_previousMapOfPlayerControllerToAutoPingCounts; // 0x190(0x50)
	struct TMap<struct AS_PlayerController*, struct FS_AutoPingReprocessData> m_mapOfPlayerControllerToReprocessTime; // 0x1e0(0x50)
	struct TArray<struct US_AutoPingComponent*> m_encounterEntrances; // 0x230(0x10)
	struct TArray<struct US_EncounterAutoPing*> m_encounterAutoPings; // 0x240(0x10)

	bool UpdateAutoPing(struct US_AutoPingComponent* autoPingComponent); // Function Scavenger.S_AutoPingManagerComponent.UpdateAutoPing // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool RemoveAutoPingForTeam(struct US_AutoPingComponent* autoPingComponent, int32_t TeamIndex); // Function Scavenger.S_AutoPingManagerComponent.RemoveAutoPingForTeam // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool RemoveAutoPingForPlayer(struct US_AutoPingComponent* autoPingComponent, struct AS_PlayerController* PlayerController); // Function Scavenger.S_AutoPingManagerComponent.RemoveAutoPingForPlayer // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool RemoveAutoPing(struct US_AutoPingComponent* autoPingComponent); // Function Scavenger.S_AutoPingManagerComponent.RemoveAutoPing // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	struct FVector GetLocationForTeam(int32_t TeamIndex, struct FS_TeamGameState teamGameState); // Function Scavenger.S_AutoPingManagerComponent.GetLocationForTeam // (Native|Event|Protected|HasOutParms|HasDefaults|BlueprintEvent) // @ game+0xffff8008e4a10000
	bool GetIsOkayToAddRemoveOrUpdate(); // Function Scavenger.S_AutoPingManagerComponent.GetIsOkayToAddRemoveOrUpdate // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool AddAutoPing(struct US_AutoPingComponent* autoPingComponent); // Function Scavenger.S_AutoPingManagerComponent.AddAutoPing // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_FrontEndItemReceiver
// Size: 0x290 (Inherited: 0x288)
struct AS_FrontEndItemReceiver : AActor {
	enum class ES_FrontEndItemReceiverType ItemReceiverType; // 0x288(0x01)
	char pad_289[0x7]; // 0x289(0x07)
};

// Class Scavenger.S_BannerReceiver
// Size: 0x2a8 (Inherited: 0x290)
struct AS_BannerReceiver : AS_FrontEndItemReceiver {
	struct AS_CosmeticBanner* BannerClass; // 0x290(0x08)
	struct AS_CosmeticBanner* M_Banner; // 0x298(0x08)
	struct USceneComponent* m_bannerAttachmentPoint; // 0x2a0(0x08)
};

// Class Scavenger.S_BaseWidget
// Size: 0x278 (Inherited: 0x270)
struct US_BaseWidget : UUserWidget {
	char pad_270[0x1]; // 0x270(0x01)
	bool bInitiallyVisible; // 0x271(0x01)
	char pad_272[0x6]; // 0x272(0x06)

	void SetWidgetVisible(bool visible); // Function Scavenger.S_BaseWidget.SetWidgetVisible // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void OnVisibilityChange(bool bIsVisible); // Function Scavenger.S_BaseWidget.OnVisibilityChange // (Event|Protected|BlueprintEvent) // @ game+0xffff8008e4a10000
	bool IsWidgetVisible(); // Function Scavenger.S_BaseWidget.IsWidgetVisible // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	enum class ESlateVisibility GetSlateVisibility(); // Function Scavenger.S_BaseWidget.GetSlateVisibility // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_BasicSpectatorPlayerPawn
// Size: 0x458 (Inherited: 0x310)
struct AS_BasicSpectatorPlayerPawn : ASpectatorPawn {
	char pad_310[0x38]; // 0x310(0x38)
	struct US_SpringArmComponent* PlayerSpringArmComp; // 0x348(0x08)
	struct US_SpringArmComponent* VehicleSpringArmComp; // 0x350(0x08)
	struct UCameraComponent* PlayerCameraComp; // 0x358(0x08)
	struct UCameraComponent* VehicleCameraComp; // 0x360(0x08)
	struct APawn* CurrentTargetPawn; // 0x368(0x08)
	struct FRotator TargetPlayerRotator; // 0x370(0x0c)
	struct FRotator TargetVehicleRotator; // 0x37c(0x0c)
	struct FMulticastInlineDelegate OnTargetPawnChanged; // 0x388(0x10)
	struct FMulticastInlineDelegate OnTargetPawnUpdate; // 0x398(0x10)
	struct FMulticastInlineDelegate OnTargetPawnADSChange; // 0x3a8(0x10)
	struct FS_ShelterInterfaceData ShelterData; // 0x3b8(0x98)
	float SpringArmRotationUpdateHz; // 0x450(0x04)
	float InterpolationSpeed; // 0x454(0x04)

	void UpdateTargetPawnADS(); // Function Scavenger.S_BasicSpectatorPlayerPawn.UpdateTargetPawnADS // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void TriggerOnTargetPawnUpdate(); // Function Scavenger.S_BasicSpectatorPlayerPawn.TriggerOnTargetPawnUpdate // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void SetSpringArmRelativeRotation(struct USceneComponent* SpringArm, struct FRotator baseAimRotation); // Function Scavenger.S_BasicSpectatorPlayerPawn.SetSpringArmRelativeRotation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0xffff8008e4a10000
	void SetCurrentTargetPawn(struct APawn* NewCurrentTargetPawn); // Function Scavenger.S_BasicSpectatorPlayerPawn.SetCurrentTargetPawn // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void OnRepCurrentTargetPawn(struct APawn* PreviousPawn); // Function Scavenger.S_BasicSpectatorPlayerPawn.OnRepCurrentTargetPawn // (Final|Native|Public) // @ game+0xffff8008e4a10000
	void MimicTargetControlRotation(); // Function Scavenger.S_BasicSpectatorPlayerPawn.MimicTargetControlRotation // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	struct FString GetTargetPlayerName(); // Function Scavenger.S_BasicSpectatorPlayerPawn.GetTargetPlayerName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct APawn* GetNextTargetPawn(bool cycleForward, struct APawn* CurrentTarget); // Function Scavenger.S_BasicSpectatorPlayerPawn.GetNextTargetPawn // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	struct APawn* GetCurrentTargetPawn(); // Function Scavenger.S_BasicSpectatorPlayerPawn.GetCurrentTargetPawn // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_BloodSplatManagerComponent
// Size: 0xd0 (Inherited: 0xb0)
struct US_BloodSplatManagerComponent : UActorComponent {
	uint32_t MaxDecals; // 0xb0(0x04)
	float DecalLifetime; // 0xb4(0x04)
	float FadeTime; // 0xb8(0x04)
	char pad_BC[0x4]; // 0xbc(0x04)
	struct TArray<struct FS_BloodSplat> m_splats; // 0xc0(0x10)
};

// Class Scavenger.S_BoneDataAsset
// Size: 0x40 (Inherited: 0x30)
struct US_BoneDataAsset : UDataAsset {
	struct TArray<struct FBodyPingRegion> BulletBodyPingRegions; // 0x30(0x10)
};

// Class Scavenger.S_BoneDataComponent
// Size: 0x170 (Inherited: 0xb0)
struct US_BoneDataComponent : UActorComponent {
	struct TMap<struct FName, struct FBoneHitInfo> BoneHitInfo; // 0xb0(0x50)
	struct TMap<struct FName, struct FAimAssistInfo> AimAssistInfo; // 0x100(0x50)
	struct US_BoneDataAsset* BulletBodyPingRegionsOverrideAsset; // 0x150(0x08)
	struct TArray<struct FBodyPingRegion> BulletBodyPingRegions; // 0x158(0x10)
	bool DebugRenderOverrideAssetInTool; // 0x168(0x01)
	char pad_169[0x7]; // 0x169(0x07)

	struct US_BoneDataComponent* GetBoneDataComponentOfActor(struct AActor* Actor); // Function Scavenger.S_BoneDataComponent.GetBoneDataComponentOfActor // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_BoxSplineComponent
// Size: 0x5c0 (Inherited: 0x540)
struct US_BoxSplineComponent : USplineComponent {
	struct TArray<struct FS_SplineBoxData> BoxData; // 0x540(0x10)
	float MaxDeviation; // 0x550(0x04)
	float StepTime; // 0x554(0x04)
	float SplineTime; // 0x558(0x04)
	float MaxWidth; // 0x55c(0x04)
	float MinBoxLength; // 0x560(0x04)
	bool bShouldShowBoxDataDebug; // 0x564(0x01)
	char pad_565[0x3]; // 0x565(0x03)
	struct TMap<struct UStaticMeshComponent*, struct FS_DerezVisualGuidesData> VisualGuidesMap; // 0x568(0x50)
	char pad_5B8[0x8]; // 0x5b8(0x08)

	bool IsLocationInsideDerezZone(struct FVector otherLocation); // Function Scavenger.S_BoxSplineComponent.IsLocationInsideDerezZone // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool IsLocationCloserToSplineIn2D(struct FVector otherLocation, float minDistance); // Function Scavenger.S_BoxSplineComponent.IsLocationCloserToSplineIn2D // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool IsInputKeyAnEnd(float InputKey); // Function Scavenger.S_BoxSplineComponent.IsInputKeyAnEnd // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool IsCloserSplinePointAnEnd(struct FVector otherLocation); // Function Scavenger.S_BoxSplineComponent.IsCloserSplinePointAnEnd // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	void GenerateBoxData(); // Function Scavenger.S_BoxSplineComponent.GenerateBoxData // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_BPNode_PlayMontage
// Size: 0x70 (Inherited: 0x30)
struct US_BPNode_PlayMontage : UBlueprintAsyncActionBase {
	struct FMulticastInlineDelegate Completed; // 0x30(0x10)
	struct FMulticastInlineDelegate Interrupted; // 0x40(0x10)
	struct FMulticastInlineDelegate Failed; // 0x50(0x10)
	struct UAnimInstance* m_animInstance; // 0x60(0x08)
	struct UAnimMontage* m_animMontage; // 0x68(0x08)

	struct US_BPNode_PlayMontage* PlayMontage(struct UAnimInstance* AnimInstance, struct UAnimMontage* Montage); // Function Scavenger.S_BPNode_PlayMontage.PlayMontage // (Final|Native|Static|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_BreakableAssetUserData
// Size: 0x40 (Inherited: 0x28)
struct US_BreakableAssetUserData : UAssetUserData {
	bool Breakable; // 0x28(0x01)
	char pad_29[0x7]; // 0x29(0x07)
	struct UParticleSystem* ParticleSystemTemplate; // 0x30(0x08)
	struct UAkAudioEvent* BreakSoundEvent; // 0x38(0x08)
};

// Class Scavenger.S_BTDecorator_AITriggers
// Size: 0xb0 (Inherited: 0x68)
struct US_BTDecorator_AITriggers : UBTDecorator {
	int32_t IntValue; // 0x68(0x04)
	enum class ES_BlackBoardEntryComparison Operator; // 0x6c(0x01)
	char pad_6D[0x3]; // 0x6d(0x03)
	struct FS_OverlordReference OverlordFilter; // 0x70(0x10)
	struct TArray<struct FS_TriggerReference> TriggersToEvaluate; // 0x80(0x10)
	char pad_90[0x20]; // 0x90(0x20)

	void OnTriggerVolumeDataUpdated(struct AS_AITriggerVolume* TriggerVolume, struct AActor* OtherActor); // Function Scavenger.S_BTDecorator_AITriggers.OnTriggerVolumeDataUpdated // (Final|Native|Public) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_BTDecorator_AudioEventTag
// Size: 0x70 (Inherited: 0x68)
struct US_BTDecorator_AudioEventTag : UBTDecorator {
	struct US_AIAudioEventType* Event; // 0x68(0x08)
};

// Class Scavenger.S_BTDecorator_SetAudioState
// Size: 0x70 (Inherited: 0x68)
struct US_BTDecorator_SetAudioState : UBTDecorator {
	enum class ES_AIAudioState State; // 0x68(0x01)
	char pad_69[0x7]; // 0x69(0x07)
};

// Class Scavenger.S_BTServiceRunScavangerEQS
// Size: 0xf0 (Inherited: 0x98)
struct US_BTServiceRunScavangerEQS : UBTService_BlackboardBase {
	struct FEQSParametrizedQueryExecutionRequest EQSRequest; // 0x98(0x48)
	char pad_E0[0x10]; // 0xe0(0x10)
};

// Class Scavenger.S_BTScavengerRequiredService
// Size: 0xa0 (Inherited: 0x98)
struct US_BTScavengerRequiredService : UBTService_BlueprintBase {
	struct AS_AIController* m_AIController; // 0x98(0x08)

	void OnEnterBehavior(struct AS_AIController* ScavengerController, struct AS_AICharacter* ScavengerAICharacter); // Function Scavenger.S_BTScavengerRequiredService.OnEnterBehavior // (Event|Protected|BlueprintEvent) // @ game+0xffff8008e4a10000
	void CleanUpBehavior(struct AS_AIController* ScavengerController, struct AS_AICharacter* ScavengerAICharacter); // Function Scavenger.S_BTScavengerRequiredService.CleanUpBehavior // (Event|Protected|BlueprintEvent) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_EQSScoringBase
// Size: 0x38 (Inherited: 0x28)
struct US_EQSScoringBase : UObject {
	bool DiscardZeroValueItems; // 0x28(0x01)
	bool InvertScoreLogic; // 0x29(0x01)
	bool ScoreFromLastKnownEnemyPos; // 0x2a(0x01)
	bool ScoreFromCustomScoringPoint; // 0x2b(0x01)
	float ScoreWeightMultiplier; // 0x2c(0x04)
	float DiscardBelowThisValue; // 0x30(0x04)
	float DiscardAboveThisValue; // 0x34(0x04)
};

// Class Scavenger.S_EQSScoring_Distance
// Size: 0x48 (Inherited: 0x38)
struct US_EQSScoring_Distance : US_EQSScoringBase {
	float minDistance; // 0x38(0x04)
	float MaxDistance; // 0x3c(0x04)
	bool ScoreFromEnemy; // 0x40(0x01)
	enum class ES_ScoringDistance ScoringMode; // 0x41(0x01)
	char pad_42[0x6]; // 0x42(0x06)
};

// Class Scavenger.S_EQSScoring_Visibility
// Size: 0x40 (Inherited: 0x38)
struct US_EQSScoring_Visibility : US_EQSScoringBase {
	enum class ETraceTypeQuery TraceChannel; // 0x38(0x01)
	bool ScoreFromEnemy; // 0x39(0x01)
	char pad_3A[0x2]; // 0x3a(0x02)
	float PointZOffset; // 0x3c(0x04)
};

// Class Scavenger.S_EQSScoring_Dot
// Size: 0x40 (Inherited: 0x38)
struct US_EQSScoring_Dot : US_EQSScoringBase {
	bool ScoreFromEnemy; // 0x38(0x01)
	bool UseRightVector; // 0x39(0x01)
	char pad_3A[0x6]; // 0x3a(0x06)
};

// Class Scavenger.S_EQSScoring_PositionalRelationDOT_FWD
// Size: 0x40 (Inherited: 0x38)
struct US_EQSScoring_PositionalRelationDOT_FWD : US_EQSScoringBase {
	bool ScoreFromEnemy; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
};

// Class Scavenger.S_EQSScoring_PositionalRelationDOT_SIDE
// Size: 0x40 (Inherited: 0x40)
struct US_EQSScoring_PositionalRelationDOT_SIDE : US_EQSScoring_PositionalRelationDOT_FWD {
};

// Class Scavenger.S_EQSScoring_LowCover
// Size: 0x40 (Inherited: 0x38)
struct US_EQSScoring_LowCover : US_EQSScoringBase {
	bool ScoreFromEnemy; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
};

// Class Scavenger.S_EQSScoring_HighCover
// Size: 0x40 (Inherited: 0x38)
struct US_EQSScoring_HighCover : US_EQSScoringBase {
	bool ScoreFromEnemy; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
};

// Class Scavenger.S_EQSScoring_ContainsTag
// Size: 0x40 (Inherited: 0x38)
struct US_EQSScoring_ContainsTag : US_EQSScoringBase {
	struct FName Tag; // 0x38(0x08)
};

// Class Scavenger.S_BTTaskEQSScoringContainer
// Size: 0xa0 (Inherited: 0x70)
struct US_BTTaskEQSScoringContainer : UBTTaskNode {
	struct TArray<struct US_EQSScoringBase*> ScoringTemplates; // 0x70(0x10)
	enum class EEnvQueryRunMode ScoringRunMode; // 0x80(0x01)
	char pad_81[0x7]; // 0x81(0x07)
	struct TArray<struct US_EQSScoringBase*> ScoringTemplateInstances; // 0x88(0x10)
	enum class EEnvQueryPointClumpingMode AIClumpingMode; // 0x98(0x01)
	bool IncludeTargetsNearestFPA; // 0x99(0x01)
	bool IncludeMyNearestFPA; // 0x9a(0x01)
	char pad_9B[0x5]; // 0x9b(0x05)
};

// Class Scavenger.S_BTTaskMeleeAttack
// Size: 0x78 (Inherited: 0x70)
struct US_BTTaskMeleeAttack : UBTTaskNode {
	int32_t m_meleeDamageAmount; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
};

// Class Scavenger.S_BTTaskOverlordStage
// Size: 0xb0 (Inherited: 0x70)
struct US_BTTaskOverlordStage : UBTTaskNode {
	char pad_70[0x18]; // 0x70(0x18)
	struct FS_OverlordReference OverlordFilter; // 0x88(0x10)
	struct FS_SquadReference SquadName; // 0x98(0x08)
	struct FS_StageReference NewStage; // 0xa0(0x08)
	enum class ES_StageChangeUrgency stageChangeUrgency; // 0xa8(0x01)
	enum class ES_StageChangeStateHint stageChangeStateHint; // 0xa9(0x01)
	char pad_AA[0x6]; // 0xaa(0x06)
};

// Class Scavenger.S_BTTaskSetBlackboardValueBase
// Size: 0xa8 (Inherited: 0x70)
struct US_BTTaskSetBlackboardValueBase : UBTTaskNode {
	struct FBlackboardKeySelector BlackboardKey; // 0x70(0x28)
	struct FString CachedDescription; // 0x98(0x10)
};

// Class Scavenger.S_BTTaskSetIntBlackboardValue
// Size: 0xb0 (Inherited: 0xa8)
struct US_BTTaskSetIntBlackboardValue : US_BTTaskSetBlackboardValueBase {
	int32_t IntValue; // 0xa8(0x04)
	char pad_AC[0x4]; // 0xac(0x04)
};

// Class Scavenger.S_BTTaskSetBoolBlackboardValue
// Size: 0xb0 (Inherited: 0xa8)
struct US_BTTaskSetBoolBlackboardValue : US_BTTaskSetBlackboardValueBase {
	bool BoolValue; // 0xa8(0x01)
	char pad_A9[0x7]; // 0xa9(0x07)
};

// Class Scavenger.S_BTTaskSetObjectBlackboardValue
// Size: 0xb0 (Inherited: 0xa8)
struct US_BTTaskSetObjectBlackboardValue : US_BTTaskSetBlackboardValueBase {
	struct UObject* ObjectValue; // 0xa8(0x08)
};

// Class Scavenger.S_BTTaskSetFloatBlackboardValue
// Size: 0xb0 (Inherited: 0xa8)
struct US_BTTaskSetFloatBlackboardValue : US_BTTaskSetBlackboardValueBase {
	float FloatValue; // 0xa8(0x04)
	char pad_AC[0x4]; // 0xac(0x04)
};

// Class Scavenger.S_BTTaskSpawnerControl
// Size: 0x110 (Inherited: 0x70)
struct US_BTTaskSpawnerControl : UBTTaskNode {
	char pad_70[0x18]; // 0x70(0x18)
	struct FS_OverlordReference OverlordFilter; // 0x88(0x10)
	struct FS_SpawnerReference SpawnerName; // 0x98(0x10)
	struct FS_SleepingBool Sleeping; // 0xa8(0x02)
	struct FS_SpawnOneByOneBool SpawnOneByOne; // 0xaa(0x02)
	struct FS_OnlyUsePointsForSpawningBool OnlyUsePointsForSpawning; // 0xac(0x02)
	struct FS_OnlyUsePointsForReplenishBool OnlyUsePointsForReplenish; // 0xae(0x02)
	struct FS_MaximumNumberOfSpawnedActorsInt MaximumNumberOfSpawnedActors; // 0xb0(0x08)
	struct FS_MaximumNumberInitiallySpawnedActorsInt MaximumNumberInitiallySpawnedActors; // 0xb8(0x08)
	struct FS_MinimumTimeBetweenSpawnsFVector2D MinimumTimeBetweenSpawns; // 0xc0(0x0c)
	struct FS_MinimumTimeAfterInitalSpawnsFVector2D MinimumTimeAfterInitalSpawns; // 0xcc(0x0c)
	struct FS_ReplenishmentActiveBool ReplenishmentActive; // 0xd8(0x02)
	char pad_DA[0x2]; // 0xda(0x02)
	struct FS_MaxReplenishmentCountInt MaxReplenishmentCount; // 0xdc(0x08)
	struct FS_AllowSpawnWithPlayersInsideBool AllowSpawnWithPlayersInside; // 0xe4(0x02)
	char pad_E6[0x2]; // 0xe6(0x02)
	struct FS_FallbackSpawnRadiusFloat FallbackSpawnRadius; // 0xe8(0x08)
	struct FS_FallbackSpawnHeightFloat FallbackSpawnHeight; // 0xf0(0x08)
	struct FS_ActiveRadiusFloat ActiveRadius; // 0xf8(0x08)
	struct FS_InactiveRadiusFloat InactiveRadius; // 0x100(0x08)
	struct FS_OpenSpanwerObjectBool OpenSpawnerObject; // 0x108(0x02)
	char pad_10A[0x6]; // 0x10a(0x06)
};

// Class Scavenger.S_BuildSettings
// Size: 0x70 (Inherited: 0x38)
struct US_BuildSettings : UDeveloperSettings {
	bool AllowDebug; // 0x38(0x01)
	bool Retail; // 0x39(0x01)
	bool CaptureBuild; // 0x3a(0x01)
	char pad_3B[0x5]; // 0x3b(0x05)
	struct FString CV1; // 0x40(0x10)
	struct FString CV2; // 0x50(0x10)
	struct FString DeploymentId; // 0x60(0x10)
};

// Class Scavenger.S_BulletMovementComponent
// Size: 0x1e0 (Inherited: 0x1d0)
struct US_BulletMovementComponent : UProjectileMovementComponent {
	bool HitSimpleCollision; // 0x1d0(0x01)
	enum class ECollisionChannel ClientCollisionChannel; // 0x1d1(0x01)
	enum class ECollisionChannel ServerCollisionChannel; // 0x1d2(0x01)
	bool LimitMovementByBoundsAndScaleOnHit; // 0x1d3(0x01)
	float DeltaMoveScaleOnHit; // 0x1d4(0x04)
	char pad_1D8[0x8]; // 0x1d8(0x08)
};

// Class Scavenger.S_ProjectileBase
// Size: 0x3e0 (Inherited: 0x288)
struct AS_ProjectileBase : AActor {
	struct UProjectileMovementComponent* m_projectileMovement; // 0x288(0x08)
	struct FVector m_initialSuggestedVelocity; // 0x290(0x0c)
	struct FVector m_cachedMovementVelocity; // 0x29c(0x0c)
	bool m_bCancelGravityScale; // 0x2a8(0x01)
	char pad_2A9[0x7]; // 0x2a9(0x07)
	struct FS_WhizBySound m_whizBySound; // 0x2b0(0x28)
	bool m_bExpectedImpact; // 0x2d8(0x01)
	char pad_2D9[0x3]; // 0x2d9(0x03)
	struct FVector m_expectedImpact; // 0x2dc(0x0c)
	enum class ES_ProjectileImpactResponse ImpactResponse; // 0x2e8(0x01)
	char pad_2E9[0x3]; // 0x2e9(0x03)
	float TimeToDestroyAfterAttachment; // 0x2ec(0x04)
	float TimeToDestroyAfterAttachmentPlayer; // 0x2f0(0x04)
	float TimeToDestroyAfterImpact; // 0x2f4(0x04)
	float ExtraAttachDepth; // 0x2f8(0x04)
	float AcceptableDistanceToAttachedBone; // 0x2fc(0x04)
	bool AttachToEverything; // 0x300(0x01)
	char pad_301[0x7]; // 0x301(0x07)
	struct US_DamageTypeExplosive* ExplosiveDamageType; // 0x308(0x08)
	char pad_310[0x8c]; // 0x310(0x8c)
	enum class EPhysicalSurface CustomImpactSurface; // 0x39c(0x01)
	bool DoubleImpactFX; // 0x39d(0x01)
	char pad_39E[0x2]; // 0x39e(0x02)
	struct FFloatInterval AIProjectileSpeed; // 0x3a0(0x08)
	float CharacterAttachScale; // 0x3a8(0x04)
	char pad_3AC[0x8]; // 0x3ac(0x08)
	float m_bloodSplatConeAngle; // 0x3b4(0x04)
	float m_maxBloodSplatDist; // 0x3b8(0x04)
	char m_numBloodSplats; // 0x3bc(0x01)
	char pad_3BD[0xb]; // 0x3bd(0x0b)
	struct AS_WeaponBase* m_weapon; // 0x3c8(0x08)
	char pad_3D0[0x10]; // 0x3d0(0x10)

	void SetImpactSurface(enum class EPhysicalSurface NewImpactSurface); // Function Scavenger.S_ProjectileBase.SetImpactSurface // (Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void SetDoubleImpactFX(bool bEnabled); // Function Scavenger.S_ProjectileBase.SetDoubleImpactFX // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void OnStop(struct FHitResult ImpactResult); // Function Scavenger.S_ProjectileBase.OnStop // (Native|Protected|HasOutParms) // @ game+0xffff8008e4a10000
	void OnSpawnFromPool(); // Function Scavenger.S_ProjectileBase.OnSpawnFromPool // (Native|Event|Public|BlueprintEvent) // @ game+0xffff8008e4a10000
	void OnReturnToPool(); // Function Scavenger.S_ProjectileBase.OnReturnToPool // (Native|Event|Public|BlueprintEvent) // @ game+0xffff8008e4a10000
	void OnOwnerDestroyed(struct AActor* DestroyedActor); // Function Scavenger.S_ProjectileBase.OnOwnerDestroyed // (Native|Protected) // @ game+0xffff8008e4a10000
	void OnImpactWithLandscape(struct FHitResult ImpactResult, float SnowDepth); // Function Scavenger.S_ProjectileBase.OnImpactWithLandscape // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xffff8008e4a10000
	void OnImpact(struct FHitResult ImpactResult); // Function Scavenger.S_ProjectileBase.OnImpact // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0xffff8008e4a10000
	void OnBounce(struct FHitResult ImpactResult, struct FVector ImpactVelocity); // Function Scavenger.S_ProjectileBase.OnBounce // (Native|Protected|HasOutParms|HasDefaults) // @ game+0xffff8008e4a10000
	bool IsDoubleImpactFXEnabled(); // Function Scavenger.S_ProjectileBase.IsDoubleImpactFXEnabled // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	enum class EPhysicalSurface GetImpactSurface(); // Function Scavenger.S_ProjectileBase.GetImpactSurface // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct US_DamageTypeExplosive* GetExplosiveDamageType(); // Function Scavenger.S_ProjectileBase.GetExplosiveDamageType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_BulletProjectile
// Size: 0x3f0 (Inherited: 0x3e0)
struct AS_BulletProjectile : AS_ProjectileBase {
	bool NeverDamageOnImpact; // 0x3e0(0x01)
	char pad_3E1[0xf]; // 0x3e1(0x0f)
};

// Class Scavenger.S_CableActor
// Size: 0x2a8 (Inherited: 0x290)
struct AS_CableActor : ACableActor {
	float TimeUntilDeactivate; // 0x290(0x04)
	char pad_294[0x14]; // 0x294(0x14)
};

// Class Scavenger.S_CacheSpatialAuthorityInterface
// Size: 0x28 (Inherited: 0x28)
struct US_CacheSpatialAuthorityInterface : UInterface {
};

// Class Scavenger.S_CameraEffectsSystem
// Size: 0x330 (Inherited: 0x288)
struct AS_CameraEffectsSystem : AActor {
	bool isInShelter; // 0x288(0x01)
	bool isInStorm; // 0x289(0x01)
	char pad_28A[0x2]; // 0x28a(0x02)
	float Storminess; // 0x28c(0x04)
	float WindDirection; // 0x290(0x04)
	float WindForce; // 0x294(0x04)
	float TimeOfDay; // 0x298(0x04)
	float PlayerDistanceFromStorm; // 0x29c(0x04)
	float ClosestStormRadius; // 0x2a0(0x04)
	struct FVector ClosestStormLocation; // 0x2a4(0x0c)
	float WindSpinLerpMinDistance; // 0x2b0(0x04)
	float WindSpinLerpMaxDistance; // 0x2b4(0x04)
	float WindSpinLerpDuration; // 0x2b8(0x04)
	float WindSpinLerpUpdateInterval; // 0x2bc(0x04)
	struct FVector WindDirectionSpinTargetVector; // 0x2c0(0x0c)
	float WindLerpAlpha; // 0x2cc(0x04)
	struct FVector WindDirectionSpinLerpedVector; // 0x2d0(0x0c)
	bool RenderCameraEffects; // 0x2dc(0x01)
	char pad_2DD[0x3]; // 0x2dd(0x03)
	struct APawn* CurrentPawn; // 0x2e0(0x08)
	struct UCameraComponent* CurrentCameraAttachedTo; // 0x2e8(0x08)
	struct FMulticastInlineDelegate InShelterChanged; // 0x2f0(0x10)
	struct FMulticastInlineDelegate InStormChanged; // 0x300(0x10)
	struct UParticleSystemComponent* PS_SnowflakesNative; // 0x310(0x08)
	struct UParticleSystemComponent* PS_SnowStormTransitionNative; // 0x318(0x08)
	struct UParticleSystemComponent* PS_SnowFlakesInStormNative; // 0x320(0x08)
	char pad_328[0x8]; // 0x328(0x08)

	void UpdateWind(float DeltaTime); // Function Scavenger.S_CameraEffectsSystem.UpdateWind // (Final|Native|Protected|BlueprintCallable) // @ game+0xffff8008e4a10000
	void UpdateSnowflakes(bool DisableSnowflakes); // Function Scavenger.S_CameraEffectsSystem.UpdateSnowflakes // (Final|Native|Protected|BlueprintCallable) // @ game+0xffff8008e4a10000
	void HandleOnStormCategoryChanged(enum class ES_StormCategory StormCategory); // Function Scavenger.S_CameraEffectsSystem.HandleOnStormCategoryChanged // (Final|Native|Protected) // @ game+0xffff8008e4a10000
	void HandleOnShelterStateChanged(enum class ES_ShelterType newShelterState); // Function Scavenger.S_CameraEffectsSystem.HandleOnShelterStateChanged // (Final|Native|Protected) // @ game+0xffff8008e4a10000
	void HandleOnFocusedCharacterChanged(struct APawn* oldPawn, struct APawn* NewPawn); // Function Scavenger.S_CameraEffectsSystem.HandleOnFocusedCharacterChanged // (Final|Native|Protected) // @ game+0xffff8008e4a10000
	void GetPawnWithValidation_BP(int32_t PlayerIndex, struct APawn* OutValidPawn, struct FVector OutPawnLocation, struct FVector OutPawnVelocity); // Function Scavenger.S_CameraEffectsSystem.GetPawnWithValidation_BP // (Final|Native|Protected|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0xffff8008e4a10000
	void GetPawnFromLocalController0_BP(struct APawn* OutPawn); // Function Scavenger.S_CameraEffectsSystem.GetPawnFromLocalController0_BP // (Final|Native|Protected|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_ViewportFadePhase
// Size: 0x60 (Inherited: 0x58)
struct US_ViewportFadePhase : US_PostMatchPhase {
	enum class ES_ViewportFadeType ViewportFadeType; // 0x58(0x01)
	char pad_59[0x3]; // 0x59(0x03)
	float FadeDuration; // 0x5c(0x04)

	void HandleOnFadeFinished(bool IsFadingOut); // Function Scavenger.S_ViewportFadePhase.HandleOnFadeFinished // (Final|Native|Private) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_CameraManagerComponent
// Size: 0x210 (Inherited: 0x200)
struct US_CameraManagerComponent : USceneComponent {
	struct UCameraComponent* CurrentCamera; // 0x1f8(0x08)
	char pad_208[0x8]; // 0x208(0x08)

	void SetEditorViewAsCurrentCamera(); // Function Scavenger.S_CameraManagerComponent.SetEditorViewAsCurrentCamera // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void SetCurrentCamera(struct UCameraComponent* Camera); // Function Scavenger.S_CameraManagerComponent.SetCurrentCamera // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool GetCurrentCameraTransform(struct FTransform outTransform); // Function Scavenger.S_CameraManagerComponent.GetCurrentCameraTransform // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool GetCurrentCameraRotation(struct FRotator OutRotation); // Function Scavenger.S_CameraManagerComponent.GetCurrentCameraRotation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool GetCurrentCameraLocation(struct FVector OutLocation); // Function Scavenger.S_CameraManagerComponent.GetCurrentCameraLocation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool GetCurrentCameraFieldOfView(float outFieldOfView); // Function Scavenger.S_CameraManagerComponent.GetCurrentCameraFieldOfView // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool GetCurrentCamera(struct FVector OutLocation, struct FRotator outRotator, float outFieldOfView); // Function Scavenger.S_CameraManagerComponent.GetCurrentCamera // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0xffff8008e4a10000
	void ClearCurrentCamera(struct UCameraComponent* conditionallyClearIfCamera); // Function Scavenger.S_CameraManagerComponent.ClearCurrentCamera // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_ChallengeManagerComponent
// Size: 0xb0 (Inherited: 0xb0)
struct US_ChallengeManagerComponent : UActorComponent {

	struct US_ChallengeManagerComponent* GetChallengeManagerComponentOfActor(struct AActor* Actor); // Function Scavenger.S_ChallengeManagerComponent.GetChallengeManagerComponentOfActor // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_ChallengeStatisticsProcessor
// Size: 0x98 (Inherited: 0x28)
struct US_ChallengeStatisticsProcessor : UObject {
	struct FMulticastInlineDelegate OnChallengeComplete; // 0x28(0x10)
	struct AS_PlayerState* m_owningPlayerState; // 0x38(0x08)
	char pad_40[0x58]; // 0x40(0x58)

	void TrackStatistic(struct FName StatName, enum class ES_ChallengeTrackingSetting trackingType, int32_t increment); // Function Scavenger.S_ChallengeStatisticsProcessor.TrackStatistic // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void SetupPlayerCharacterCallbacks(struct AS_PlayerCharacter* NewCharacter); // Function Scavenger.S_ChallengeStatisticsProcessor.SetupPlayerCharacterCallbacks // (Final|Native|Private) // @ game+0xffff8008e4a10000
	void SetupCallbacks_BP(struct AS_PlayerController* PlayerController); // Function Scavenger.S_ChallengeStatisticsProcessor.SetupCallbacks_BP // (Event|Protected|BlueprintEvent) // @ game+0xffff8008e4a10000
	void ProcessItemCrafted(struct FS_RecipeMetadata craftedItemData); // Function Scavenger.S_ChallengeStatisticsProcessor.ProcessItemCrafted // (Final|Native|Protected|HasOutParms|BlueprintCallable) // @ game+0xffff8008e4a10000
	void OnTerminatedSomeone(struct FS_EventParameterVariant TerminalActor, struct FS_ActorTerminalParameters ActorTerminalParameters); // Function Scavenger.S_ChallengeStatisticsProcessor.OnTerminatedSomeone // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void OnKilledPawn(struct FS_EventParameterVariant KilledPawn, struct FS_DeathRecap DeathRecap); // Function Scavenger.S_ChallengeStatisticsProcessor.OnKilledPawn // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void OnInteractionStopped(enum class ES_Interaction interactionType, bool isTimedInteraction, struct AActor* Actor, struct UPrimitiveComponent* Component, int32_t instanceIndex); // Function Scavenger.S_ChallengeStatisticsProcessor.OnInteractionStopped // (Final|Native|Private) // @ game+0xffff8008e4a10000
	void OnInteractionComplete(struct FS_EventParameterVariant InteractableActor, struct FS_EventParameterVariant InteractableComponent, int32_t InteractableIndex, float InteractionPercentage); // Function Scavenger.S_ChallengeStatisticsProcessor.OnInteractionComplete // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void OnDamageDealtByPlayer(struct AActor* DamagedActor, float DamageAmount, struct FDamageEvent DamageEvent, struct AActor* CauseActor, bool Critical); // Function Scavenger.S_ChallengeStatisticsProcessor.OnDamageDealtByPlayer // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void OnActorStatsStateChanged(struct FS_EventParameterControllerVariant ChangeCausingController, struct FS_EventParameterVariant ChangedActor, enum class ES_StatsState OldState, enum class ES_StatsState NewState, struct FS_ActorStatsStateChangedParameters ActorStatsStateChangedParameters); // Function Scavenger.S_ChallengeStatisticsProcessor.OnActorStatsStateChanged // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void OnActorDamaged(struct FS_EventParameterControllerVariant DamagingController, struct FS_EventParameterVariant DamagedActor, float DamageDealt); // Function Scavenger.S_ChallengeStatisticsProcessor.OnActorDamaged // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_CharacterAnimInstance
// Size: 0x510 (Inherited: 0x370)
struct US_CharacterAnimInstance : US_AnimInstance {
	struct ACharacter* Native_CharacterOwner; // 0x370(0x08)
	struct AS_CharacterBase* Native_ScavengerCharacterOwner; // 0x378(0x08)
	struct US_MeleeHitPlaybackSettings* MeleeHitSettings; // 0x380(0x08)
	float Speed; // 0x388(0x04)
	struct FVector RelativeVelocity; // 0x38c(0x0c)
	float MovementDirection; // 0x398(0x04)
	bool IsDead; // 0x39c(0x01)
	bool IsAlive; // 0x39d(0x01)
	bool IsInAir; // 0x39e(0x01)
	char pad_39F[0x1]; // 0x39f(0x01)
	struct FVector LookAtPosition; // 0x3a0(0x0c)
	bool ShouldLookAt; // 0x3ac(0x01)
	bool IsAICharacter; // 0x3ad(0x01)
	bool IsSprinting; // 0x3ae(0x01)
	char pad_3AF[0x1]; // 0x3af(0x01)
	struct TMap<struct FName, struct FS_SoftPingMixInfo> SoftPingMixes; // 0x3b0(0x50)
	float TimeBetweenRecordedShots; // 0x400(0x04)
	enum class ES_AILocomotionState LocomotionType; // 0x404(0x01)
	bool Native_IsJumping; // 0x405(0x01)
	char pad_406[0x2]; // 0x406(0x02)
	float Native_FallingSpeed; // 0x408(0x04)
	char pad_40C[0x4]; // 0x40c(0x04)
	bool Native_IsCrouching; // 0x410(0x01)
	bool Native_IsDodging; // 0x411(0x01)
	char pad_412[0x2]; // 0x412(0x02)
	struct FName Native_CosmeticSkinId; // 0x414(0x08)
	char pad_41C[0xf4]; // 0x41c(0xf4)

	struct UAnimMontage* SelectAttackEventMontage(struct TArray<struct UAnimMontage*> MontageVariations, enum class ES_WeaponMontageEvent attackEvent, enum class ES_TriggerType triggerType); // Function Scavenger.S_CharacterAnimInstance.SelectAttackEventMontage // (Native|Event|Public|HasOutParms|BlueprintEvent) // @ game+0xffff8008e4a10000
	void OnSprintUpdated(bool IsSprintOn); // Function Scavenger.S_CharacterAnimInstance.OnSprintUpdated // (Final|Native|Private) // @ game+0xffff8008e4a10000
	void OnMovementModeChanged(struct ACharacter* Character, enum class EMovementMode PreviousMovementMode, char PreviousCustomMode); // Function Scavenger.S_CharacterAnimInstance.OnMovementModeChanged // (Final|Native|Private) // @ game+0xffff8008e4a10000
	void OnCrouchUpdated(bool IsCrouchOn); // Function Scavenger.S_CharacterAnimInstance.OnCrouchUpdated // (Final|Native|Private) // @ game+0xffff8008e4a10000
	void OnCharacterStatsStateChanged(struct US_StatsComponent* StatsComponent, enum class ES_StatsState OldState, enum class ES_StatsState NewState); // Function Scavenger.S_CharacterAnimInstance.OnCharacterStatsStateChanged // (Native|Protected) // @ game+0xffff8008e4a10000
	void OnCharacterPreTakePointDamage(struct AActor* DamagedActor, float UnmodifiedDamageAmount, float ArmorDamageAmount, float HealthDamageAmount, struct FPointDamageEvent DamageEvent, struct FHitResult HitResult, struct AActor* CauseActor, char DamageModifiersApplied, bool bIsCritical); // Function Scavenger.S_CharacterAnimInstance.OnCharacterPreTakePointDamage // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	float GetSpeed(); // Function Scavenger.S_CharacterAnimInstance.GetSpeed // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct FVector GetRelativeVelocity(); // Function Scavenger.S_CharacterAnimInstance.GetRelativeVelocity // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	float GetMovementDirection(); // Function Scavenger.S_CharacterAnimInstance.GetMovementDirection // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	float GetAverageAccelerationOverTime(float Seconds); // Function Scavenger.S_CharacterAnimInstance.GetAverageAccelerationOverTime // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_KungFuAttacker
// Size: 0x40 (Inherited: 0x28)
struct US_KungFuAttacker : UObject {
	char pad_28[0x18]; // 0x28(0x18)
};

// Class Scavenger.S_CharacterMovementComponent
// Size: 0x1120 (Inherited: 0xb10)
struct US_CharacterMovementComponent : UCharacterMovementComponent {
	char pad_B10[0x30]; // 0xb10(0x30)
	struct FMulticastInlineDelegate OnSprintUpdated; // 0xb40(0x10)
	struct FMulticastInlineDelegate OnWalkUpdated; // 0xb50(0x10)
	struct FMulticastInlineDelegate OnDodgeUpdated; // 0xb60(0x10)
	struct FMulticastInlineDelegate OnSlideUpdated; // 0xb70(0x10)
	struct FMulticastInlineDelegate OnMantleUpdated; // 0xb80(0x10)
	bool DoesCrouchToggle; // 0xb90(0x01)
	bool EnableFriendlySoftCollision; // 0xb91(0x01)
	char pad_B92[0x2]; // 0xb92(0x02)
	float JumpLaunchDelay; // 0xb94(0x04)
	float ExhaustedJumpLaunchDelay; // 0xb98(0x04)
	char pad_B9C[0x4]; // 0xb9c(0x04)
	struct FMulticastInlineDelegate OnJumpTriggered; // 0xba0(0x10)
	float ExhaustedSprintBonusMultiplier; // 0xbb0(0x04)
	char pad_BB4[0x54]; // 0xbb4(0x54)
	char pad_C08_0 : 2; // 0xc08(0x01)
	char m_bWantsToSprint : 1; // 0xc08(0x01)
	char pad_C08_3 : 5; // 0xc08(0x01)
	char pad_C09[0x3]; // 0xc09(0x03)
	struct FS_MoveSpeed m_replicatedMoveSpeed; // 0xc0c(0x18)
	char pad_C24[0x24]; // 0xc24(0x24)
	struct FS_SlideState m_slideState; // 0xc48(0x40)
	char pad_C88[0xe8]; // 0xc88(0xe8)
	char m_bApplyFriendlySoftCollision : 1; // 0xd70(0x01)
	char pad_D70_1 : 7; // 0xd70(0x01)
	char pad_D71[0x1f]; // 0xd71(0x1f)
	float NoClipMaxSpeed; // 0xd90(0x04)
	float SprintAddToMaxSpeed; // 0xd94(0x04)
	float InitialMaxWalkSpeedBaseValue; // 0xd98(0x04)
	float MinSprintTimeToSlide; // 0xd9c(0x04)
	float MinSpeedToSlide; // 0xda0(0x04)
	char pad_DA4[0x4]; // 0xda4(0x04)
	struct FS_SlideSettings DodgeSlide; // 0xda8(0x98)
	struct FS_SlideSettings FlatSlide; // 0xe40(0x98)
	char pad_ED8[0x18]; // 0xed8(0x18)
	struct TArray<struct FS_SlideSettings> CustomDodge; // 0xef0(0x10)
	float SlideStuckSpeed; // 0xf00(0x04)
	float SlideStuckMaxTime; // 0xf04(0x04)
	float MinSlideTimeAfterLanding; // 0xf08(0x04)
	float InstantSlideFromLandedTime; // 0xf0c(0x04)
	float JumpSlideTimeOutTime; // 0xf10(0x04)
	float FallingSlideTimeOutTime; // 0xf14(0x04)
	float PerfectSlideTimeOutTime; // 0xf18(0x04)
	char pad_F1C[0x4]; // 0xf1c(0x04)
	struct TArray<struct FS_MantleSettings> MantleSettings; // 0xf20(0x10)
	float ExhaustedMantlePlaybackRate; // 0xf30(0x04)
	float MaxMantleFloorSideAngle; // 0xf34(0x04)
	float MaxMantleFloorFwdAngle; // 0xf38(0x04)
	float MaxFenceDepth; // 0xf3c(0x04)
	float MinPlatformDepth; // 0xf40(0x04)
	float MaxExtraLaunchUp; // 0xf44(0x04)
	float LaunchPushMulti; // 0xf48(0x04)
	float FriendlySoftCollisionRadius; // 0xf4c(0x04)
	float FriendlySoftCollisionPushSpeed; // 0xf50(0x04)
	bool m_stationaryCharacter; // 0xf54(0x01)
	bool bBlockClientSimNavWalkingOnServer; // 0xf55(0x01)
	char pad_F56[0x2]; // 0xf56(0x02)
	struct UCurveFloat* ClientMaxAcceleration; // 0xf58(0x08)
	struct UCurveFloat* ClientMaxInAirAcceleration; // 0xf60(0x08)
	float StrafeSpeedStartFadeAngle; // 0xf68(0x04)
	float StrafeSpeedFadeRange; // 0xf6c(0x04)
	float MaxStrafeSpeed; // 0xf70(0x04)
	float MaxBackpedalSpeed; // 0xf74(0x04)
	float MaxStrafeAcceleration; // 0xf78(0x04)
	float MaxBackpedalAcceleration; // 0xf7c(0x04)
	bool ReenablePhysicsOnLaunch; // 0xf80(0x01)
	bool ProjectPositionToPhysics; // 0xf81(0x01)
	bool ProjectPositionToPhysicsOnClientSim; // 0xf82(0x01)
	char pad_F83[0x1]; // 0xf83(0x01)
	float ProjectPositionAboveNavMeshScaleUp; // 0xf84(0x04)
	float ProjectPositionAboveNavMeshScaleDown; // 0xf88(0x04)
	bool OrientMeshToUnderlyingPhysics; // 0xf8c(0x01)
	char pad_F8D[0x3]; // 0xf8d(0x03)
	float OrientationToUnderlyingPhysicsRate; // 0xf90(0x04)
	char pad_F94[0xc]; // 0xf94(0x0c)
	struct FS_CharacterMovementOverrides m_CharacterMovementOverrides; // 0xfa0(0x168)
	char pad_1108[0x18]; // 0x1108(0x18)

	void UnlockMovement(); // Function Scavenger.S_CharacterMovementComponent.UnlockMovement // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void SocialHub_SetSlideVelocity(struct FVector NewVelocity); // Function Scavenger.S_CharacterMovementComponent.SocialHub_SetSlideVelocity // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0xffff8008e4a10000
	struct FVector SocialHub_GetSlideVelocity(); // Function Scavenger.S_CharacterMovementComponent.SocialHub_GetSlideVelocity // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	void SetWalkSpeedBaseValue(float Value); // Function Scavenger.S_CharacterMovementComponent.SetWalkSpeedBaseValue // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void ServerStartSlide(enum class ES_Slide SlideType, struct FVector SlideDir, int32_t customIdx, uint32_t slideID, bool bJumpingSlide, bool bFallingSlide, bool bPerfectSlide); // Function Scavenger.S_CharacterMovementComponent.ServerStartSlide // (Net|NetReliableNative|Event|Public|NetServer|HasDefaults|NetValidate) // @ game+0xffff8008e4a10000
	void ServerSetMantleData(struct FVector StartLocation, struct FVector ledgeNormal, int32_t mantleIdx, bool fenceMantle, bool crouchToFit, int32_t ConditionalMontageIdx); // Function Scavenger.S_CharacterMovementComponent.ServerSetMantleData // (Net|NetReliableNative|Event|Public|NetServer|HasDefaults|NetValidate) // @ game+0xffff8008e4a10000
	void ServerSetFriendlySoftCollisionHeading(int32_t softCollHeading); // Function Scavenger.S_CharacterMovementComponent.ServerSetFriendlySoftCollisionHeading // (Net|Native|Event|Public|NetServer|NetValidate) // @ game+0xffff8008e4a10000
	void ServerRequestNoClip(bool bDoNoClip); // Function Scavenger.S_CharacterMovementComponent.ServerRequestNoClip // (Net|Native|Event|Public|NetServer|NetValidate) // @ game+0xffff8008e4a10000
	void ServerNotifyClientStoppedSliding(uint32_t slideID); // Function Scavenger.S_CharacterMovementComponent.ServerNotifyClientStoppedSliding // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0xffff8008e4a10000
	void ServerAbortSlide(); // Function Scavenger.S_CharacterMovementComponent.ServerAbortSlide // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0xffff8008e4a10000
	void ResetMovementLock(); // Function Scavenger.S_CharacterMovementComponent.ResetMovementLock // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool ProbeForMantle(struct FVector outLedgeNormal, struct FVector outLedgeLocation, struct UPrimitiveComponent* outLedgePrimitive, int32_t outMantleIdx, bool outFenceMantle, bool outCrouchToFit); // Function Scavenger.S_CharacterMovementComponent.ProbeForMantle // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|Const) // @ game+0xffff8008e4a10000
	void OnRep_SetCurrentSlide(); // Function Scavenger.S_CharacterMovementComponent.OnRep_SetCurrentSlide // (Final|Native|Protected) // @ game+0xffff8008e4a10000
	void OnRep_CharacterMovementOverrides(); // Function Scavenger.S_CharacterMovementComponent.OnRep_CharacterMovementOverrides // (Final|Native|Private) // @ game+0xffff8008e4a10000
	void NotifySlideUpdated_BP(enum class ES_Slide Slide, int32_t customIdx); // Function Scavenger.S_CharacterMovementComponent.NotifySlideUpdated_BP // (Event|Public|BlueprintEvent) // @ game+0xffff8008e4a10000
	void NotifyDodgeUpdated_BP(bool IsDodging, int32_t customIdx); // Function Scavenger.S_CharacterMovementComponent.NotifyDodgeUpdated_BP // (Event|Public|BlueprintEvent) // @ game+0xffff8008e4a10000
	void MulticastStartSlide(enum class ES_Slide SlideType, struct FVector SlideDir, int32_t customIdx, uint32_t slideID, bool bJumpingSlide, bool bFallingSlide, bool bPerfectSlide); // Function Scavenger.S_CharacterMovementComponent.MulticastStartSlide // (Net|Native|Event|NetMulticast|Public|HasDefaults) // @ game+0xffff8008e4a10000
	void MulticastExecuteMantleRemoteClients(struct FVector ledgeNormal, int32_t mantleIdx, bool fenceMantle, bool crouchToFit, struct FVector StartPos, int32_t ConditionalMontageIdx); // Function Scavenger.S_CharacterMovementComponent.MulticastExecuteMantleRemoteClients // (Net|Native|Event|NetMulticast|Public|HasDefaults) // @ game+0xffff8008e4a10000
	void LockMovement(); // Function Scavenger.S_CharacterMovementComponent.LockMovement // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool IsSlidingButNotDodging(); // Function Scavenger.S_CharacterMovementComponent.IsSlidingButNotDodging // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool IsSlideButNotDodge(enum class ES_Slide Slide); // Function Scavenger.S_CharacterMovementComponent.IsSlideButNotDodge // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0xffff8008e4a10000
	bool IsDodging(); // Function Scavenger.S_CharacterMovementComponent.IsDodging // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	bool IsDodge(enum class ES_Slide Slide); // Function Scavenger.S_CharacterMovementComponent.IsDodge // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0xffff8008e4a10000
	bool IsApplyingFriendlySoftCollision(); // Function Scavenger.S_CharacterMovementComponent.IsApplyingFriendlySoftCollision // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	float GetWalkSpeedValue(); // Function Scavenger.S_CharacterMovementComponent.GetWalkSpeedValue // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	float GetTotalSlideTime(); // Function Scavenger.S_CharacterMovementComponent.GetTotalSlideTime // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct FVector GetSlideDirection(); // Function Scavenger.S_CharacterMovementComponent.GetSlideDirection // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	struct US_CharacterMovementComponent* GetScavengerMovementComponentOfActor(struct AActor* Actor); // Function Scavenger.S_CharacterMovementComponent.GetScavengerMovementComponentOfActor // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0xffff8008e4a10000
	enum class ES_Slide GetCurrentSlide(); // Function Scavenger.S_CharacterMovementComponent.GetCurrentSlide // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	int32_t GetCurrentCustomSlideIdx(); // Function Scavenger.S_CharacterMovementComponent.GetCurrentCustomSlideIdx // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xffff8008e4a10000
	void EndMantle(struct UAnimMontage* Montage, bool bInterrupted, int32_t montageInstanceID); // Function Scavenger.S_CharacterMovementComponent.EndMantle // (Final|Native|Public) // @ game+0xffff8008e4a10000
	void ClientNotifyServerStoppedSliding(uint32_t slideID); // Function Scavenger.S_CharacterMovementComponent.ClientNotifyServerStoppedSliding // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0xffff8008e4a10000
	void ClientMantleAck(); // Function Scavenger.S_CharacterMovementComponent.ClientMantleAck // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0xffff8008e4a10000
	void AbortSlide(); // Function Scavenger.S_CharacterMovementComponent.AbortSlide // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_CheatMenuConfig
// Size: 0xa0 (Inherited: 0x28)
struct US_CheatMenuConfig : UObject {
	struct TArray<struct FS_CheatMenuConfigEntry> Lines; // 0x28(0x10)
	struct FS_CheatMenuHUDConfig HUDConfig; // 0x38(0x64)
	char pad_9C[0x4]; // 0x9c(0x04)
};

// Class Scavenger.S_CheatMenuHUDBase
// Size: 0x528 (Inherited: 0x378)
struct AS_CheatMenuHUDBase : AHUD {
	char pad_378[0x10]; // 0x378(0x10)
	struct UInputComponent* m_inputComponent; // 0x388(0x08)
	char pad_390[0x198]; // 0x390(0x198)
};

// Class Scavenger.S_CheatMenuHUD
// Size: 0x5d0 (Inherited: 0x528)
struct AS_CheatMenuHUD : AS_CheatMenuHUDBase {
	char pad_528[0xa8]; // 0x528(0xa8)

	void HandleUnseenRewardsChanged(struct AS_PlayerControllerBase* Controller, struct FS_OnlineServiceManagerPlayerState PlayerState); // Function Scavenger.S_CheatMenuHUD.HandleUnseenRewardsChanged // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void HandleStoreDataRefreshed(); // Function Scavenger.S_CheatMenuHUD.HandleStoreDataRefreshed // (Final|Native|Private) // @ game+0xffff8008e4a10000
	void HandleSeasonStatesRefreshed(struct AS_PlayerControllerBase* Controller, struct FS_OnlineServiceManagerPlayerState PlayerState); // Function Scavenger.S_CheatMenuHUD.HandleSeasonStatesRefreshed // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void HandlePlayerResearchProjectsRefreshed(struct AS_PlayerControllerBase* PlayerController, struct FS_OnlineServiceManagerPlayerState PlayerState); // Function Scavenger.S_CheatMenuHUD.HandlePlayerResearchProjectsRefreshed // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void HandlePlayerPowerStateRefreshed(struct FS_OnlinePowerGenerationState PowerGenerationState); // Function Scavenger.S_CheatMenuHUD.HandlePlayerPowerStateRefreshed // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void HandlePlayerInventoryRefreshed(struct AS_PlayerControllerBase* PlayerController, struct FS_OnlineServiceManagerPlayerState PlayerState); // Function Scavenger.S_CheatMenuHUD.HandlePlayerInventoryRefreshed // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void HandlePlayerCurrencyRefreshed(struct AS_PlayerControllerBase* PlayerController, struct FS_OnlineServiceManagerPlayerState PlayerState); // Function Scavenger.S_CheatMenuHUD.HandlePlayerCurrencyRefreshed // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void HandlePlayerCosmeticLoadoutChanged(struct AS_PlayerControllerBase* Controller); // Function Scavenger.S_CheatMenuHUD.HandlePlayerCosmeticLoadoutChanged // (Final|Native|Private) // @ game+0xffff8008e4a10000
	void HandlePlayerClassChanged(struct US_PlayerClassData* ClassData); // Function Scavenger.S_CheatMenuHUD.HandlePlayerClassChanged // (Final|Native|Private) // @ game+0xffff8008e4a10000
	void HandleLeaderboardsRefreshed(); // Function Scavenger.S_CheatMenuHUD.HandleLeaderboardsRefreshed // (Final|Native|Private) // @ game+0xffff8008e4a10000
	void HandleLeaderboardContentsRefreshed(struct FString leaderboardId); // Function Scavenger.S_CheatMenuHUD.HandleLeaderboardContentsRefreshed // (Final|Native|Private) // @ game+0xffff8008e4a10000
	void HandleCharacterCosmeticLoadoutRefreshed(struct AS_PlayerControllerBase* PlayerController, struct FName characterClassId, struct FS_CosmeticLoadout newLoadout); // Function Scavenger.S_CheatMenuHUD.HandleCharacterCosmeticLoadoutRefreshed // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
	void HandleChallengeInstancesRefreshed(struct AS_PlayerControllerBase* Controller, struct FS_OnlineServiceManagerPlayerState PlayerState); // Function Scavenger.S_CheatMenuHUD.HandleChallengeInstancesRefreshed // (Final|Native|Private|HasOutParms) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_UserCheatMenuSettingsSave
// Size: 0xa0 (Inherited: 0x28)
struct US_UserCheatMenuSettingsSave : USaveGame {
	struct FS_CheatMenuHUDState StoredSettings; // 0x28(0x78)
};

// Class Scavenger.S_ChildActorComponent
// Size: 0x230 (Inherited: 0x230)
struct US_ChildActorComponent : UChildActorComponent {

	bool ReparentChildActor(struct AActor* newParent); // Function Scavenger.S_ChildActorComponent.ReparentChildActor // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_BaseCameraSetting
// Size: 0x38 (Inherited: 0x28)
struct US_BaseCameraSetting : UObject {
	struct FString SettingName; // 0x28(0x10)
};

// Class Scavenger.S_ScalarCameraSetting
// Size: 0x48 (Inherited: 0x38)
struct US_ScalarCameraSetting : US_BaseCameraSetting {
	char pad_38[0x10]; // 0x38(0x10)
};

// Class Scavenger.S_ToggleCameraSetting
// Size: 0x40 (Inherited: 0x38)
struct US_ToggleCameraSetting : US_BaseCameraSetting {
	char pad_38[0x8]; // 0x38(0x08)
};

// Class Scavenger.S_CameraSettings
// Size: 0x68 (Inherited: 0x28)
struct US_CameraSettings : UObject {
	struct TArray<struct US_SettingsCategory*> SettingCategories; // 0x28(0x10)
	enum class ES_SettingCategory SelectedSettingCategory; // 0x38(0x01)
	char pad_39[0x3]; // 0x39(0x03)
	int32_t SelectedCategoryVerticalIndex; // 0x3c(0x04)
	enum class ES_SettingCategory Setting1Category; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	int32_t Setting1Index; // 0x44(0x04)
	enum class ES_SettingCategory Setting2Category; // 0x48(0x01)
	char pad_49[0x3]; // 0x49(0x03)
	int32_t Setting2Index; // 0x4c(0x04)
	bool bSettingsPageSelected; // 0x50(0x01)
	bool bSettingChangedByCommmandLine; // 0x51(0x01)
	char pad_52[0x16]; // 0x52(0x16)

	void SaveSettingsToFile(); // Function Scavenger.S_CameraSettings.SaveSettingsToFile // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void PreviousCategory(); // Function Scavenger.S_CameraSettings.PreviousCategory // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void NextCategory(); // Function Scavenger.S_CameraSettings.NextCategory // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void InputUp(); // Function Scavenger.S_CameraSettings.InputUp // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void InputDown(); // Function Scavenger.S_CameraSettings.InputDown // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	bool GetToggleSetting(enum class ES_SettingCategory SettingCategory, int32_t SettingIndex); // Function Scavenger.S_CameraSettings.GetToggleSetting // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	struct US_BaseCameraSetting* GetSetting(enum class ES_SettingCategory SettingCategory, int32_t SettingIndex); // Function Scavenger.S_CameraSettings.GetSetting // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	float GetScalarSetting(enum class ES_SettingCategory SettingCategory, int32_t SettingIndex); // Function Scavenger.S_CameraSettings.GetScalarSetting // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	struct US_SettingsCategory* GetCategory(enum class ES_SettingCategory SettingCategory); // Function Scavenger.S_CameraSettings.GetCategory // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_SettingsCategory
// Size: 0x48 (Inherited: 0x28)
struct US_SettingsCategory : UObject {
	struct FString CategoryName; // 0x28(0x10)
	struct TArray<struct US_BaseCameraSetting*> Settings; // 0x38(0x10)

	bool GetToggleSettingValueAtIndex(int32_t Index); // Function Scavenger.S_SettingsCategory.GetToggleSettingValueAtIndex // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	struct FString GetSettingNameAtIndex(int32_t Index); // Function Scavenger.S_SettingsCategory.GetSettingNameAtIndex // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	float GetScalarSettingValueAtIndex(int32_t Index); // Function Scavenger.S_SettingsCategory.GetScalarSettingValueAtIndex // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void ChangeScalarSettingAtIndex(int32_t Index, float Delta); // Function Scavenger.S_SettingsCategory.ChangeScalarSettingAtIndex // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
	void ChangeNonScalarSettingAtIndex(int32_t Index, int32_t change); // Function Scavenger.S_SettingsCategory.ChangeNonScalarSettingAtIndex // (Final|Native|Public|BlueprintCallable) // @ game+0xffff8008e4a10000
};

// Class Scavenger.S_CineCamConfig
// Size: 0x98 (Inherited: 0x28)
struct US_CineCamConfig : UObject {
	struct TArray<struct FS_CineCamConfigScalarSetting> Movement; // 0x28(0x10)
	struct TArray<struct FS_CineCamConfigScalarSetting> Orientation; // 0x38(0x10)
	struct TArray<struct FS_CineCamConfigScalarSetting> Lens; // 0x48(0x10)
	struct TArray<struct FS_CineCamConfigScalarSetting> WorldTime; // 0x58(0x10)
	struct TArray<struct FS_CineCamConfigToggleSetting> AxisLock; // 0x68(0x10)
	struct TArray<struct FS_CineCamConfigToggleSetting> TargetLock; // 0x78(0x10)
