// UserDefinedStruct ST_Reputation.ST_Reputation
// Size: 0x69 (Inherited: 0x00)
struct FST_Reputation {
	float HealthPercentageForDamaged_5_7E8B3301450EA509E53C41A124D53FEF; // 0x00(0x04)
	float HealthPercentageForDowned_6_01CD62324D08614F5A90D3B9DBAA885A; // 0x04(0x04)
	float RogueTimeForDamaging_28_6A4C78AB4286EEC98458A892B366491A; // 0x08(0x04)
	float RogueTimeForDowning_29_E8A18081449519297919F89CE46DA6D4; // 0x0c(0x04)
	float RogueTimeForReviving_30_CB89AB624537548F53AA0BA6CFD53F57; // 0x10(0x04)
	float RogueTimeForKilling_31_1C6C17694E10EED7D1BE15AF82377132; // 0x14(0x04)
	float RogueExpirationBuffer_27_C84664E14DB6235CAF7EF4B752F3B4B5; // 0x18(0x04)
	float ReputationPointsPerDowning_18_287022F8464748B6DCBF308A4FAAFC29; // 0x1c(0x04)
	float ReputationPointsPerKillPlayer_22_DBE8BE6543E0425568E924ADBCC1F999; // 0x20(0x04)
	float ReputationPointsPerDowningRogue_34_23C4368D4BB1133614E5C0B021204902; // 0x24(0x04)
	float ReputationPointsPerKillRogue_20_708817FF4ACBB17D1B9D5C99C3F8206B; // 0x28(0x04)
	float ReputationPointsForNoPvP_37_A8164CE142BEC8B94A69D4A5C3E09FEF; // 0x2c(0x04)
	int32_t RogueOutlineVisibilityDistance_40_CA2A5E734A5B052CC46468831729FF7C; // 0x30(0x04)
	bool RogueTeammatesCanReportRogueActs_46_F3A167BB4E6994BE9A9F3C83CB6B0897; // 0x34(0x01)
	char pad_35[0x3]; // 0x35(0x03)
	float RogueTeammateRange_50_3D4AB3334A2F20F11D9D2CA22ECA54E3; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
	struct TArray<struct FST_IntervalStingPair> ReputationTitles_44_6D848C1C41D020568865858B5902BD24; // 0x40(0x10)
	int32_t RogueRank1MapDistance_53_DB5AA9C74AF0A4FE9A3007843DC3C87C; // 0x50(0x04)
	int32_t RogueRank1MapUpdateFrequency_55_9673124E4B3D69419539D6B778A3060C; // 0x54(0x04)
	int32_t RogueRank2MapDistance_57_4FC4603A4D2F3CB1CFF713B7EDF177D9; // 0x58(0x04)
	int32_t RogueRank2MapUpdateFrequency_59_F33BD15A47CAC52B4121BBBE01301BDC; // 0x5c(0x04)
	int32_t RogueRank3MapDistance_61_A3625B654A9BD2A9D5498AA8BBB18E71; // 0x60(0x04)
	int32_t RogueRank3MapUpdateFrequency_63_C450E43849E3DCD9A11F1DAA3CF46DD6; // 0x64(0x04)
	bool RogueRank3AppliesStencil_66_415B59004C4E4BF38DF1B881089F01E4; // 0x68(0x01)
};

