// WidgetBlueprintGeneratedClass WBP_ParabolicEffectContainer.WBP_ParabolicEffectContainer_C
// Size: 0x518 (Inherited: 0x4d0)
struct UWBP_ParabolicEffectContainer_C : US_EffectContainerWidget {
	struct UVerticalBox* MessageFeed; // 0x4d0(0x08)
	struct UWBP_MessageFeedLine_C* WBP_MessageFeedLine; // 0x4d8(0x08)
	struct UWBP_MessageFeedLine_C* WBP_MessageFeedLine_4; // 0x4e0(0x08)
	struct UWBP_MessageFeedLine_C* WBP_MessageFeedLine_C_1; // 0x4e8(0x08)
	struct UWBP_MessageFeedLine_C* WBP_MessageFeedLine_C_2; // 0x4f0(0x08)
	struct UWBP_MessageFeedLine_C* WBP_MessageFeedLine_C_3; // 0x4f8(0x08)
	struct UWBP_MessageFeedLine_C* WBP_MessageFeedLine_C_5; // 0x500(0x08)
	struct UWBP_MessageFeedLine_C* WBP_MessageFeedLine_C_6; // 0x508(0x08)
	struct UWBP_MessageFeedLine_C* WBP_MessageFeedLine_C_7; // 0x510(0x08)
};

