// WidgetBlueprintGeneratedClass WBP_MapWidget.WBP_MapWidget_C
// Size: 0xcbd (Inherited: 0xb78)
struct UWBP_MapWidget_C : US_WidgetMap {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0xb78(0x08)
	struct UCanvasPanel* CANVAS_MapRoot; // 0xb80(0x08)
	struct UTextBlock* Coord_11; // 0xb88(0x08)
	struct UTextBlock* Coord_12; // 0xb90(0x08)
	struct UTextBlock* Coord_13; // 0xb98(0x08)
	struct UTextBlock* Coord_A_2; // 0xba0(0x08)
	struct UTextBlock* Coord_B_2; // 0xba8(0x08)
	struct UTextBlock* Coord_C_2; // 0xbb0(0x08)
	struct UImage* GutterBackroundBottomImage; // 0xbb8(0x08)
	struct UImage* GutterBackroundLeftImage; // 0xbc0(0x08)
	struct UImage* GutterBackroundRightImage; // 0xbc8(0x08)
	struct UImage* GutterBackroundTopImage; // 0xbd0(0x08)
	struct UImage* IMG_Map; // 0xbd8(0x08)
	struct UInvalidationBox* InvalidationBox_2; // 0xbe0(0x08)
	struct UCanvasPanel* LeftPanel; // 0xbe8(0x08)
	struct UImage* LineBottomImage; // 0xbf0(0x08)
	struct UImage* LineLeftImage; // 0xbf8(0x08)
	struct UImage* LineRightImage; // 0xc00(0x08)
	struct UImage* LineTopImage; // 0xc08(0x08)
	struct UCanvasPanel* MapMarkerPanel; // 0xc10(0x08)
	struct UCanvasPanel* MapPanel; // 0xc18(0x08)
	struct UCanvasPanel* UpperPanel; // 0xc20(0x08)
	int32_t MaxIconCount; // 0xc28(0x04)
	char pad_C2C[0x4]; // 0xc2c(0x04)
	struct TArray<struct UWBP_Map_Label_C*> Icons; // 0xc30(0x10)
	int32_t CurrentClippedIconIndex; // 0xc40(0x04)
	struct FLinearColor CircleColor; // 0xc44(0x10)
	struct FLinearColor NextColorColor; // 0xc54(0x10)
	char pad_C64[0x4]; // 0xc64(0x04)
	struct UTextureRenderTarget2D* RT_StormCloudMask; // 0xc68(0x08)
	struct FString DEBUG_StreamingLayerName; // 0xc70(0x10)
	struct UParticleSystemComponent* MarkerPillar; // 0xc80(0x08)
	struct FVector2D IconSize; // 0xc88(0x08)
	struct ACAM_OverheadMap_C* CachedOverheadMap; // 0xc90(0x08)
	bool ShowGrid01; // 0xc98(0x01)
	char pad_C99[0x7]; // 0xc99(0x07)
	struct UMaterialInstanceDynamic* Grid01; // 0xca0(0x08)
	struct UMaterialInstanceDynamic* Grid02; // 0xca8(0x08)
	struct FVector2D RegionalLabelZoomThreshold; // 0xcb0(0x08)
	int32_t CurrentZoomIndex; // 0xcb8(0x04)
	enum class ESlateVisibility CoordVisbility; // 0xcbc(0x01)

	void ToggleEditorMapCoords_BP(int32_t cheatValue); // Function WBP_MapWidget.WBP_MapWidget_C.ToggleEditorMapCoords_BP // (Event|Protected|BlueprintEvent) // @ game+0xffff8008e4a10000
	void ExecuteUbergraph_WBP_MapWidget(int32_t EntryPoint); // Function WBP_MapWidget.WBP_MapWidget_C.ExecuteUbergraph_WBP_MapWidget // (Final|UbergraphFunction) // @ game+0xffff8008e4a10000
};

