// WidgetBlueprintGeneratedClass WBP_RadialCompass.WBP_RadialCompass_C
// Size: 0x6b0 (Inherited: 0x648)
struct UWBP_RadialCompass_C : US_WidgetCompass {
	struct UImage* Compass_East_Image; // 0x648(0x08)
	struct UImage* Compass_North_Image; // 0x650(0x08)
	struct UImage* Compass_South_Image; // 0x658(0x08)
	struct UImage* Compass_West_Image; // 0x660(0x08)
	struct UImage* divline; // 0x668(0x08)
	struct UImage* East_ImageBacker; // 0x670(0x08)
	struct UImage* East_ImageBacker_2; // 0x678(0x08)
	struct UImage* Image; // 0x680(0x08)
	struct UImage* Image_1052; // 0x688(0x08)
	struct UImage* Image_1164; // 0x690(0x08)
	struct UImage* N_ImageBacker; // 0x698(0x08)
	struct UImage* South_ImageBacker; // 0x6a0(0x08)
	struct UMaterialInstanceDynamic* CompassMaterial; // 0x6a8(0x08)
};

