// WidgetBlueprintGeneratedClass WBP_KilledBy.WBP_KilledBy_C
// Size: 0x4f8 (Inherited: 0x4b8)
struct UWBP_KilledBy_C : US_WidgetMinimal {
	struct UImage* PlayerBanner; // 0x4b8(0x08)
	struct US_RichTextBlock* PlayerLevel; // 0x4c0(0x08)
	struct US_RichTextBlock* PlayerName; // 0x4c8(0x08)
	struct UImage* PlayerPortrait; // 0x4d0(0x08)
	struct US_RichTextBlock* Text_KilledBy; // 0x4d8(0x08)
	struct UImage* weapon; // 0x4e0(0x08)
	struct US_RichTextBlock* WeaponName; // 0x4e8(0x08)
	struct US_RichTextBlock* WeaponType; // 0x4f0(0x08)
};

